{
  "input": "pdf_full_content.json",
  "toc_items_total": 43,
  "sections_found": 37,
  "sections": [
    {
      "id": "LỜI NÓI ĐẦU",
      "title": "LỜI NÓI ĐẦU",
      "content": "LỜI NÓI ĐẦU Phần lớn các máy xây dựng và máy làm đất có nguyên lý quay vòng chung là đổi hướng chuyển động bằng cách quay các bánh điều khiển phía trước hoặc phía sau hoặc kết hợp xoay bán khung nối. Thực trạng phát triển máy công trình hiện nay cho thấy sự đa dạng và phong phú về các dạng kết cấu các hệ thống điều khiển quay vòng. Điều khiển quay vòng được thực hiện bằng việc sử dụng hệ thống điều khiển lái. Hệ thống điều khiển lái – hệ thống bao gồm tất cả các phần tử của xe được bố trí giữa người lái và các bánh lốp tiếp xúc với bề mặt đường và tham gia vào điều khiển quay vòng xe. Theo nguyên lý tác động hệ thống điều khiển lái được chia thành hệ thống điều khiển lái bằng cơ học, thủy cơ, thủy lực, điện và tổng hợp. Phổ biến nhất trong điều khiển quay vòng là dùng các hệ thống thủy lực điều khiển lái có sử dụng khung nối động, hệ thống con chính của các hệ thống này là cơ cấu lái thủy lực. Sở dĩ có đặc điểm này là do lực quay vòng của các máy công trình lớn hơn đáng kể so với các phương tiện vận tải khác. Các cơ cấu thủy lực điều khiển lái phổ biến nhất là các cơ cấu có mạch thủy lực mà trong đó máy thủy lực sẽ đảm bảo cấp một lượng chất lỏng công tác đến các xy lanh thủy lực chấp hành và thực hiện thông tin ngược tiêu cực. Trong các tài liệu kỹ thuật chuyên ngành đối với các cơ cấu thủy lái thủy lực người ta sử dụng các thuật ngữ như: bơm thủy lực, vô lăng thủy lực về bản chất là một. Các cơ cấu lái thủy lực có đặc điểm động học không hoàn hảo dẫn tới làm giảm chất lượng các quá trình điều khiển lái, từ đó gây ra các tác động tiêu cực toàn diện đến khả năng hoạt động của hệ thống điều khiển lái của xe. Khi quay vòng bánh lái trong quá trình xe đang chuyển động phát sinh hiện tượng gọi là mất lái, tức là quỹ đạo của xe bị lệch so với quỹ đạo ban đầu. Hiện tượng mất lái phát sinh do sự không ổn định của các quá trình chuyển tiếp trong cơ cấu điều khiển lái, được đánh giá thông qua các tham số chất lượng đặc trưng đầu ra của cơ cấu thủy lực điều khiển lái. Khi xe chuyển động với vận tốc lớn hiện tượng mất lái gây ra ảnh hưởng lớn nhất đến chất lượng quá trình quay vòng. Từ đó làm người lái phải luôn điều khiển bánh lái, làm tăng độ lệch quỹ đạo ban đầu, giảm độ dự trữ ổn định của xe khi vào cua và tăng thời gian thoát ra quỹ đạo chuyển động xác định, và từ đó có thể gây ra mất an toàn chuyển động, vì vậy lái xe buộc phải giảm vận tốc xe. Kết quả là làm giảm hiệu suất khai thác xe. Vì cơ cấu điều khiển lái là cơ cấu chính của toàn bộ hệ thống lái cho nên việc nâng cao chất lượng động học hệ thống thủy lực có ý nghĩa kỹ thuật quan trọng, nhiệm vụ này có thể thực hiện bằng cách tối ưu hóa các tham số kết cấu của cơ cấu thủy lực lái. Phân tích hoạt động của các doanh nghiệp trong nước sản xuất cơ cấu điểu khiển thủy lực lái cho thấy không có doanh nghiệp nào sản xuất các hệ thống tự động thiết kế vô lăng lái thủy lực, không có các cách thức lựa chọn các tham số kết cấu cơ bản của chúng dựa trên phương pháp tổng hợp tối ưu. Hiện nay việc lựa chọn các tham số kết cấu của cơ cấu thủy lực điều khiển lái vẫn được thực hiện theo phương pháp tính toán thiết kế truyền thống, chính vì vậy thường dẫn tới không đạt được các kết quả mong muốn. Ngược lại làm tăng các chỉ số sai lệch giá trị tham số kết cấu và phải hiệu chỉnh lại thông qua thực nghiệm nhằm đáp ứng yêu cầu của lãnh đạo doanh nghiệp, tuy nhiên hoạt động nâng cao chất lượng các chỉ số đối với các hệ thống này không được tiếp tục nghiên cứu, và do đó thường không tìm ra được giải pháp kết cấu tối ưu. Tất cả những điều này làm tăng công lao động trong hoạt động thiết kế và sản xuất, không giúp ích cho việc nâng cao các tính năng của các cơ cấu điều khiển lái bằng thủy lực được sản xuất, làm các sản phẩm chế tạo trong nước bị giảm tính cạnh tranh ngay tại thị trường nội địa và giảm năng suất của máy công trình theo yêu cầu đã đặt ra. Tất cả các vấn đề đã trình bày ở trên hiện nay là các vấn đề hết sức cấp bách cần giải quyết. Việc nghiên cứu xây dựng các phương pháp thiết kế khoa học và chuyên nghiệp bằng phương pháp tổng hợp tối ưu hóa các tham số kết cấu của cơ cấu thủy lực điều khiển lái và sản xuất các hệ thống này trong nước với các tính năng đáp ứng khả năng cạnh tranh cao, không thua kém các sản phẩm nhập khẩu là vấn đề sống còn của nghành chế tạo máy thủy lực, máy công trình trong nước."
    },
    {
      "id": "1",
      "title": "Các cơ cấu thủy lực điều khiển lái. Cấu tạo, nguyên lý hoạt động, các tham số và các yêu cầu.",
      "content": "1. Các cơ cấu thủy lực điều khiển lái. Cấu tạo, nguyên lý hoạt động, các tham số và các yêu cầu."
    },
    {
      "id": "1.1",
      "title": "Các nội dung cơ bản về cấu tạo dẫn động bằng thủy lực điều khiển lái. Nguyên tắc hoạt động.",
      "content": "1.1 Các nội dung cơ bản về cấu tạo dẫn động bằng thủy lực điều khiển lái. Nguyên tắc hoạt động. Hệ thống điều khiển lái cấu tạo gồm ba hệ thống con: hệ thống thủy lực điều khiển lái, cơ cấu quay vòng (hình thang lái hoặc khung nối) và các tương tác kích thích của môi trường bên ngoài (đặc điểm bề mặt đất). Cơ cấu điều khiển thủy lực lái là cụm động lập riêng biệt, là cơ cấu hoạt động trong thành phần của hệ thống thủy lực điều khiển lái liên kết với xi lanh chấp hành hoạt động nhờ bơm thủy lực cấp chất lỏng công tác từ thùng chứa thông qua hệ thống ống dẫn. Cơ cấu thủy lực điều khiển lái cấp một lượng chất lỏng công tác đến các xi lanh chấp hành tùy thuộc vào góc và tốc độ quay của tay lái (vô lăng). Đặc điểm này của cơ cấu thủy lực điều khiển lái đảm bảo có thể hoàn toàn bố trí một cách tự do các phần tử của nó trên xe, cho phép đơn giản hóa kết cấu và giảm khối lượng vật liệu chế tạo xe. Việc sử dụng cơ cấu thủy lực điều khiển lái mở ra khả năng lớn đa dạng sơ đồ cấu tạo hệ thống thủy lực điều khiển lái và tiêu chuẩn hóa các phần tử chính của chúng. Đồng thời các yếu tố này đảm bảo việc điều khiển được dễ ràng, nâng cao điều kiện làm việc của lái xe /48, 49/. Trên hình 1.1 trình bày sơ đồ khối hệ thống thủy lực điều khiển lái điển hình. Hệ thống gồm thùng chứa 1, nguồn áp lực chất lỏng công tác 2, động cơ dẫn động 3, cơ cấu thủy lực điều khiển lái 10, cơ cấu chấp hành 8, dẫn động lái 9, van an toàn 11 và bộ lọc 12. Cơ cấu thủy lực điều khiển lái giống như mọi thiết bị thủy lực theo dõi cấu tạo gồm tay lái 5, van phân phối 4, động cơ thủy lực cấp tín hiệu ngược 7, bộ vi sai 6. Bộ vi sai liên kết tay lái, van phân phối và động cơ thủy lực với nhau và đảm bảo thao tác tính toán độ chênh lệch tín hiệu đầu vào (quay vòng tay lái) và tín hiệu đầu ra (vòng quay của trục động cơ thủy lực tín hiệu ngược), đồng thời truyền hiệu chênh lệch tín hiệu tới van phân phối kiểm soát giá trị khác biệt của hệ thống theo dõi /39/. Nguyên lý hoạt động của hệ thống thủy lực điều khiển lái như sau: Khi không có tác động lên tay lái của cơ cấu thủy lực điều khiển lái dòng chất lỏng công tác từ nguồn nuôi cấp đến thùng chứa. Khi quay vòng tay lái sẽ kích hoạt bộ van phân phối và đảm bảo phân phối chất lỏng công tác đến khoang cơ cấu chấp hành tương ứng, đồng thời nối với khoang khác để xả chất lỏng công tác.Quan sát trên sơ đồ khối ta thấy (hình 11) động cơ thủy lực được liên kết nối tiếp với ống thủy lực của cơ cấu chấp hành. Cơ cấu thủy lực tác động lên dẫn động lái làm quá trình quay vòng xe diễn ra. Khi đó chất lỏng công tác tác động lên rô to của động cơ thủy lực, và thông qua bộ vi sai điều hòa hệ thống, đảm bảo dịch chuyển tương ứng cán xi lanh thủy lực (cơ cấu chấp hành) /39, 46/. Hình 1.1 Sơ đồ khối hệ thống thủy lực điều khiển lái điển hình"
    },
    {
      "id": "1.2",
      "title": "Tổng quan kết cấu các cơ cấu thủy lực điều khiển lái hiện nay, phân tích khuynh hướng phát triển chúng.",
      "content": "1.2 Tổng quan kết cấu các cơ cấu thủy lực điều khiển lái hiện nay, phân tích khuynh hướng phát triển. Phân tích các cơ cấu thủy lực điều khiển lái trong và ngoài nước hiện nay cho thấy rằng, trong các máy công trình và máy làm đường sử dụng rộng dãi sơ đồ mạch thủy lực đơn và mạch kép, cấu tạo gồm bơm thủy lực đóng vai trò cấp tín hiệu ngược giữa cơ cấu điều khiển và cơ cấu chấp hahfnh /39,49/. Sau đây chúng ta sẽ phân tích và nghiên cứu kết cấu của một số cơ cấu thủy lực điều khiển lái được sản xuất trong và ngoài nước. Trên hình 1.2 trình bày hình dạng chung và đặc điểm kết cấu của bộ phân phối thủy lực cơ cấu lái H ДП sản xuất tại nhà máy chế tạo dẫn động thủy lực Omsk. a) b) Hình 1.2 Cơ cấu thủy lực điều khiển lái H ДП a) – hình dạng chung; b) – kết cấu của bộ phân phối thủy lực Nguyên lý hoạt động của kết cấu này như sau: khi xoay tay láu, chất lỏng công tác sẽ qua các lỗ cao áp 1 đến khoang van 2, từ khoang van 2 chất lỏng công tác qua các rãnh 3 rồi đi qua các lỗ của dãy động cơ thủy lực 4 đến động cơ thủy lực cấp tín hiệu ngược, từ động cơ thủy lực chất lỏng công tác đi qua các lỗ 4 đến các rãnh cao áp của van 5, từ đây qua các lỗ 6 đến các khoang của các xi lanh chấp hành. Chất lỏng công tác từ khoang xả của xi lanh thủy lực đi qua các lỗ xả 7, rồi đi qua các rãnh xả 8, qua các lỗ 9 đi vào thùng chứa. Lượng chất lỏng thừa không đi vào động cơ thủy lực cấp tín hiệu ngược sẽ đổ vào các rãnh xả của bơm 10. Các nhược điểm của kết cấu này: Trục ra liên kết với van trượt bằng bán khớp nối hoặc bộ điều chỉnh vì vậy khi bị mòn sẽ làm tăng độ dơ và gây ra hiện tượng sứt mẻ trục nếu quay tay lái với tần số cao; Khoang cao áp trong thân bố trí ở phía trục ra cho nên dễ làm chảy dầu qua đệm làm kín trục; Chất lỏng công tác chịu áp suất cao đi qua van trượt, làm tăng áp suất trong van gây ra biến dạng hướng kính, hậu quả là có thể làm kẹt bộ phân phối thủy lực. Trên hình"
    },
    {
      "id": "1.3",
      "title": "Tổng quan các công trình đã nghiên cứu về các hệ thống thủy lực điều khiển lái.",
      "content": "1.3 trình bày hình dạng chung và đặc điểm kết cấu của cơ cấu lái do nhà máy Mogilevskyi Belarus sản xuất. a) Hình dạng chung b) kết cấu bộ phân phối thủy lực Hình 1.3 Cơ cấu điều khiển lái dẫn động bằng thủy lực sản xuất tại nhà máy Mogilevskyi. Ưu điểm dễ thấy của kiểu kết cấu này là: Trục ra được chế tạo liền trục với van trượt do vậy trách được trường hợp trục bị dơ và va đập khi làm việc; khoang cao áp trong thân van được thiết kế về phía động cơ thủy lực phát tín hiệu ngược tì chặt vào mặt bích của thân van loại bỏ khả năng dò rỉ chất lỏng công tác; chất lỏng công tác qua khoang van đi đến cửa xả, cho phép khắc phục được áp lực và biến dạng van khi áp lực tăng. Tuy nhiên kiểu kết cấu này cũng có nhược điểm ở chỗ thiết kế các rãnh xả trong van: thiết kế các lỗ thay cho các rãnh. Phương án thiết kế này giúp đơn giản hóa quá trình chế tạo, tuy nhiên nó làm xấu dạng đặc tính phi tuyến vùng hoạt động của bộ phân phối. Phương án thiết kế bộ phân phối thủy lực cơ cấu lái của nhà máy Mogilevskyi giống với bộ phân phối điều khiển lái SUB (hình 1.4, a) của công ty “Lifam”. Chỉ có điểm khác biệt ở chỗ các rãnh xi lanh cao áp và rãnh xả trong thân 6 và 7 của bộ phân phối “Lifam” được thiết kế dưới dạng hai lỗ. a) “Lifam” b) “Eaton” (USA) Hình 1.4. Các bộ phân phối của cơ cấu thủy lực điều khiển lái. Trên hình 1.4, b trình bày bộ phân phối thủy lực của công ty “Eaton” (USA). Đặc điểm của kiểu thiết kế này là hình dạng đặc trưng của các lỗ của dãy động cơ thủy lực và các rãnh hình ống trong vỏ. Dễ thấy rằng hình dạng này cho phép cải thiện đặc tính phi tuyến vùng làm việc của bộ phân phối. Các rãnh xả trong bộ phân phối được thiết kể kiểu lỗ. Trên hình"
    },
    {
      "id": "1.5",
      "title": "Các tiêu chí hiệu suất và con đường hợp lý hóa các quá trình công tác của hệ thống thủy lực điều khiển lái.",
      "content": "1.5 trình bày hình dạng chung và kết cấu của bộ phân phối cơ cấu điều khiển lái bằng dẫn động thủy lực của công ty “Danfoss”. Kiểu thiết kế này thực tế không khác gì so với kiểu thiết kế của công ty “Lifam”, điểm khác biệt là hình dạng các rãnh xả trong van: chúng được thiết kế dạng rãnh, nhằm nâng cao hình dạng đặc tính phi tuyến bề mặt làm việc của bộ phân phối. a) Hình dạng chung b) kết cấu bộ phân phối thủy lực Hình 1.5 Cơ cấu lái điều khiển thủy lực của công ty “Danfoss” Với vai trò là động cơ thủy lực tín hiệu ngược người ta sử dụng các kiểu bơm trình bày trên hình 1.6. Các phương án thiết kế trong nước thường nghiêng về việc sử dụng bơm nhông loại răng trong có bi đũa cố định, bởi vì chúng dễ chế tạo, nhưng chúng lại có kích thước lớn. Hình 1.7 trình bày các phương án thiết kế các loại bơm khác nhau. a) Bơm nhông có xi lanh cố định b) Bơm nhông răng trong Hình 1.6 Các phương án thiết kế động cơ thủy lực tín hiệu ngược Hình 7. Các phương án thiết kế bơm khác nhau Các cơ cấu điều khiển lái máy xây dựng của Mỹ thường sử dụng bơm nhông có răng trong do công ty “Char Lynn” chế tạo. Hiện nay khuynh hướng này bắt đầu được áp dụng trong nước. Nhà máy sản xuất dẫn động thủy lực Omsk sử dụng nhiều bơm nhông răng trong do Ý sản xuất, nó có đặc điểm là nâng cao tính năng tay lái thủy lực và giảm kích thước của nó. Như vậy trên cơ sở phân tích các phương án thiết kế các hệ thống thủy lực điều khiển lái được sản xuất hiện nay, đồng thời dựa trên việc phân tích các thông tin về bản quyền sáng chế và các tài liệu khoa học kỹ thuật có thể thấy rõ các khuynh hướng phát triển cơ bản của chúng và phân loại theo dấu hiệu kết cấu của bộ phân phối thủy lực (hình 1.8)/48,49,64,77,78,79/: Giảm lượng vật liệu tiêu thụ; Chế tạo trục ra đồng trục với van; Thiết kế các rãnh cao áp của bộ phân phối thủy lực sao cho khoang cao áp trong thân bố trí về hướng động cơ thủy lực tín hiệu ngược; Chế tạo các rãnh thay cho các lỗ trong thân van của bộ phân phối thủy lực; Sử dụng động cơ thủy lực tín hiệu ngược dạng bơm nhông răng trong. Theo kiểu thiết kế Theo kiểu thiết kế trục ra Theo cách bố trí các rãnh cao áp 1.3 Tổng quan các công trình đã nghiên cứu về các hệ thống thủy lực điều khiển lái. Các thiết bị thủy lực kiểu như các hệ thống thủy lực của các cơ cấu điều khiển lái được ứng dụng rộng rãi trong ngành công nghiệp hàng không và trên các phương tiện giao thông vận tải. Chúng được sử dụng với vai trò là các hệ thống kiểm soát và các cơ cấu chấp hành. Chúng có các đặc tính công suất lớn, tác động nhanh, điều khiển êm dịu tín hiệu ra, có độ chính xác cao, có các tính chất động học tốt, dễ biến đổi các dạng chuyển động khác nhau thành dạng chuyển động cần thiết và điều cũng rất quan trọng là chúng có kích thước nhỏ, vì vậy mà chúng được ứng dụng rộng rãi trong các lĩnh vực của nền kinh tế quốc dân /48, 49, 64/. Cũng chính vì vậy mà hiện nay chúng ta đã tích lũy được rất nhiều kinh nghiệm hoạt động nghiên cứu về lĩnh vực các hệ thống thủy lực của cơ cấu điều khiển lái. Các nhà nghiên cứu có những đóng góp quan trọng trong lĩnh vực này có thể kể đến như T.V. Alekseeva, Т.М. Bashta, V.A. Gamynin, B.L. Korobochkin, V.Ya. Obidina, N.A. Ulyanov, V.A. Khokhlov và cộng sự /2, 7, 16,60, 61, 32, 63, 64, 90, 97/. Các vấn đề liên quan đến khả năng chuyển động của máy công trình với vai trò là các phương tiện xe máy độc lập hoặc với vai trò là các cụm của máy cày – máy kéo được trình bày sâu trong nhiều công trình của các tác giả như S.M. Arakelyants, V.M. Boklaga, Yu.A. Bryansk, M.I. Griff, S.A. Deriuzhenko, M.A. Diatyan, A.V. Dmitrieva, N.N. Lubianogo, E.Yu. Malinovsky, D.M. Mitropolina, V.A. Popova, K.K. Polevitsky, B.M. Tishina, Ya.E. Farobina, E.M. Shapiro, V.F. Konovalova và các cộng sự /5,12, 13, 23, 25, 27, 29, 42, 47, 50, 51, 75, 74, 87, 88, 91, 93/. Các đặc tính làm việc quan trọng nhất của các hệ thống thủy lực điều khiển lái là chất lượng các đặc tính đầu ra, chúng quyết định đến khả năng điều khiển máy công trình và khả năng ổn định chuyển động trong quá trình quay vòng /13, 58/. Tính điều khiển của máy công trình được hiểu là toàn bộ các tính chất của hệ thống cho phép giữ hoặc thay đổi hướng chuyển động khi thực hiện các tác động tương ứng lên cần điều khiển. Các vấn đề về tính điều khiển của máy công trình được trình bày trong các công trình /17, 46, 47, 88, 91, 93/. Tính ổn định của hệ thống điều khiển lái của máy công trình được hiểu là khả năng quay trở lại trạng thái ban đầu sau khi đã ngừng các tác động gây ra sự mất cân bằng /50, 51, 62, 74/. Các dao động ngẫu nhiên của khâu ra trong quá trình quay vòng là hiện tượng mang tính đặc trưng đối với các phương tiện xe máy có sử dụng các hệ thống điều khiển lái dẫn động cơ khí hoặc dẫn động bằng thủy – cơ. Trong các hệ thống thủy lực điều khiển lái xét ở một khâu xác định hiện tượng này hoàn toàn biến mất. Vấn đề này đã được chứng minh trong các công trình /60, 61/. Phân tích các công trình này cho thấy rằng khi ghép động cơ thủy lực vào tuyến ống cao áp của xi lanh chấp hành, hệ thống theo dõi sẽ hoàn toàn ổn định được tín hiệu đầu ra – sự dịch chuyển của cán xi lanh thủy lực, bởi vì tín hiệu cuối cùng không chịu tác động của tín hiệu ngược. Do các dao động với tần số cao của động cơ thủy lực tín hiệu ngược được lọc bằng hệ thống dẫn động thủy lực, hệ thống dẫn động thủy lực là bộ lọc các tần số thấp, các dao động ngẫu nhiên của cán xi lanh thủy lực trong hệ thốn này không thể phát sinh. Nếu khi mắc động cơ thủy lực tín hiệu ngược vào tuyến ống xả hệ thống theo dõi xét về mặt chất lượng động học giống như hệ thống cơ với tín hiệu ngược có các đặc điểm như đã trình bày ở trên, có tính ổn định chống dao động ngẫu nhiên không cao do độ cứng của hệ thống thủy lực thấp và phần lớn các bộ phận chịu tác động của tín hiệu ngược. Như vậy khi lắp động cơ thủy lực tín hiệu ngược vào tuyến ống cao áp, các nghiên cứu về sự ổn định hệ thống chống lại dao động ngẫu nhiên phản ánh tương đối đầy đủ tính ổn định làm việc của hệ thống điều khiển lái /60, 61/. Tuy nhiên việc tiến hành nghiên cứu các cơ cấu thủy lực một cách toàn diện chưa được thực hiện, việc ứng dụng chúng vào một lĩnh vực mới mẻ nào đó hoặc thay đổi các điều kiện hoạt động thường phát sinh các vấn đề mới mà để giải quyết các vấn đề này nhờ các kết quả nghiên cứu được trình bày trong các công trình đã công bố là chưa đủ. Chẳng hạn như khi nghiên cứu các vấn đề về các hệ thống thủy lực và việc bố trí chúng lên ô tô, máy kéo và các xe tự hành v.v. Đặc điểm làm việc hệ thống thủy lực điều khiển lái /58/: 1. Hoạt động của hệ thống thủy lực điều khiển lái diễn ra trong các điều kiện thay đổi nhiệt độ thấp và mức độ bụi bẩn cao. Tải trọng tác động lên hệ thống thủy lực điều khiển lái thay đổi đột ngột cả về dấu (hướng) và độ lớn, không xác định được bằng các quy luật cho trước. Chính vì vấn đề này làm cho các chi tiết của hệ thống thủy lực lái nhanh bị mòn hơn so với các các kết cấu tương tự sử dụng trong công nghiệp xét cùng thời gian khai thác."
    },
    {
      "id": "2",
      "title": "Mô hình toán hệ thống điều khiển lái của máy công trình có khung nối.",
      "content": "2. Công suất của các bơm thường ổn định, tuy nhiên nó cũng có thể thay đổi đột ngột khi thay đổi tần số quay của động cơ nguồn cấp mô men đến nó, đây là nguyên nhân làm mất ổn định làm việc củ hệ thống thủy lực cơ cấu điều khiển lái."
    },
    {
      "id": "3",
      "title": "Các nghiên cứu lý thuyết hệ thống thủy lực điều khiển lái.",
      "content": "3. Đi cùng với khuynh hướng đơn giản hóa kết cấu, đặc trưng kết cấu đa dạng làm phát sinh khó khăn trong việc tiêu chuẩn hóa các cụm và các chi tiết. Điều này dẫn tới khó khăn trong việc tổng hợp nguyên lý hoạt động của các hệ thống. Trên cơ sở các nội dung đã trình bày có thể kết luận rằng, hệ thống thủy lực cơ cấu điều khiển lái xét về bản chất là nhóm các cơ cấu mới. Và dù việc nghiên cứu chúng được tiến hành bằng việc sử dụng các nguyên tắc chung đã được xây dựng trong lý thuyết điều khiển tự động và dẫn động theo, vẫn cần các nghiên cứu độc lập về hệ thống thủy lực điều khiển lái với các phương pháp phân tích và tổng hợp riêng."
    },
    {
      "id": "1.4",
      "title": "Các tham số chính của cơ cấu thủy lực điều khiển lái và các yêu cầu đối với các hệ thống thủy lực điều khiển lái.",
      "content": "1.4 Các tham số chính của cơ cấu thủy lực điều khiển lái và các yêu cầu đối với các hệ thống thủy lực điều khiển lái. Các tham số ra cơ bản của cơ cấu thủy lực điều khiển lái đóng vai trò tiêu chuẩn là lưu lượng chất lỏng công tác cấp đến xi lanh thủy lực chấp hành. Lưu lượng tại đầu ra của cơ cấu thủy lực điều khiển lái xác định theo công thực /48/: (1.1) Trong đó tốc độ quay của tay lái; q – thể tích công tác của động cơ thủy lực tín hiệu ngược; hiệu suất của cơ cấu. Một tham số không kém phần quan trọng của cơ cấu thủy lực điều khiển lái là áp suất đầu ra của cơ cấu hay áp suất tại đầu ra của bơm tạo ra bởi tại trọng khi quay vòng. Giá trị áp suất này được xác định theo công thức /48/: (1.2) Trong đó lực tại cán xi lanh chấp hành; F – diện tích bề mặt công tác của pistong xi lanh thủy lực; độ chênh áp suất trên cơ cấu lái. Các tham số đầu vào cơ bản của cơ cấu thủy lực điều khiển lái là lưu lượng bơm, lực trên cán pistong xi lanh chấp hành, các tác động điều khiển và kích thích. Ngoài các tham số trình bày ở trên cơ cấu thủy lực điều khiển lái còn có một loạt các chỉ số trình bày trong các công trình /48, 64/ như: Mô men trên tay lái được quy định theo tiêu chuẩn kỹ thuật cả trong trường hợp bơm hoạt động và trong chế độ hoạt động không an toàn. Độ chênh áp suất khi bộ phân phối thủy lực ở vị trí trung gian; Chỉ số độ trượt – rô to động cơ thủy lực tín hiệu ngược quay nhưng không tạo ra được áp suất cần thiết do hệ thống thủy lực điều khiển lái bị hở. Tốc độ trượt ra tăng cùng với sự giảm độ nhớt của chất lỏng công tác hay sự ra tăng của nhiệt độ dẫn tới tăng khe hơ hở giữa bề mặt làm kín của bộ phân phối van trượt và rô to động cơ thủy lực /63, 64/. Độ trượt được xác định tại vị trí biên của cán pistong xi lanh chấp hành trong quá trình trục cơ cấu thủy lực điều khiển lái quay về vị trí “в упор” với mô men cần thiết để duy trì khả năng hoạt động của van an toàn. Khi đó cần đo tần số quay của trục /63/. Tham số kết cấu chính của cơ cấu thủy lực điều khiển lái là các tham số của động cơ thủy lực tín hiệu ngược và các tham số của bộ phân phối thủy lực. Tham số chính của động cơ thủy lực tín hiệu ngược là thể tích công tác, xác định bằng kích thước của cặp bánh răng tạo thành thể tích khoang công tác. Trong bảng 1.1 trình bày các kích thước của kiểu bơm nhông răng trong và bơm nhông có xi lanh cố định đối với từng thể tích công tác. Thể tích công tác của động cơ thủy lực phụ thuộc vào giá trị lưu lượng tại đầu ra của cơ cấu thủy lực điều khiển lái /48, 64/. Các tham số kết cấu của bộ phân phối thủy lực gồm: Đường kính các lỗ dãy động cơ thủy lực của ống bộ phân phối thủy lực; Chiều rộng các rãnh cao áp của van trượt bộ phân phối thủy lực; Đường kính các lỗ xả của ống vỏ bộ phân phối thủy lực; Chiều rộng các rãnh xả của van trượt bộ phân phối thủy lực; Góc vùng không nhạy cảm của bộ phân phối thủy lực; Diện tích thiết diện của các rãnh xả tải của bơm trong ống vỏ bộ phân phối thủy lực. Bảng 1.1 Kính thước động cơ thủy lực tín hiệu ngược Thể tích công tác ∙10 -6 m 3 Độ dày cặp răng bơm nhông∙10 -3 m Độ dày răng bơm nhông có xi lanh cố định ∙10 -3 m 80 10,6 14 Thể tích công tác ∙10 -6 m 3 Độ dày cặp răng bơm nhông∙10 -3 m Độ dày răng bơm nhông có xi lanh cố định ∙10 -3 m 100 13,3 17,4 125 16,25 21,8 160 21,95 27,8 200 25,55 34,8 250 31,75 43,5 500 87 Dòng chất lỏng công tác đi qua các lỗ của dãy động cơ thủy lực (hình 1.9) đi đến động cơ thủy lực tín hiệu ngược, nhờ đó điều chỉnh lưu lượng trong cơ cấu thủy lực điều khiển lái, nói cách khác các tham số này ảnh hướng lớn đối với chất lượng hệ thống. Chất lỏng công tác từ động cơ thủy lực tín hiệu ngược đi qua các rãnh cao áp đến khoang của các xi lanh thủy lực. Chất lỏng công tác từ các xi lanh thủy lực đi qua các lỗ xả trong ống vỏ của bộ phân phối thủy lực (hình 1.11) đến cửa xả. Hình 1.9 Bố trí các lỗ của dãy động cơ thủy lực trong ống vỏ của bộ phân phối thủy lực. Hình 1.10 Mô phỏng các rãnh cao áp trong van trượt của bộ phân phối thủy lực Hình 1.11 Mô phỏng các lỗ xả trong ống vỏ của bộ phân phối thủy lực Hình 1.12 Mô phỏng các rãnh xả trong van của bộ phân phối thủy lực Chất lỏng từ xi lanh chấp hành đi qua các rãnh xả trong van trượt của bộ phân phối thủy lực đi đến cửa xả. Các góc của vùng không nhạy cảm của bộ phân phân phối thủy lực (hình 1.13) xác định hình dạng phi tuyến của bộ phân phối. Chất lỏng công tác thừa không đi qua các rãnh của dãy thủy lực đi qua các rãnh giảm tải của bơm trong ống vỏ bộ phân phối thủy lực đi đến cửa xả. Hình 1.13 Mô phỏng các góc vùng không nhạy của bộ phân phối thủy lực. Ngoài ra còn có các chỉ số chất lượng của hệ thống thủy lực điều khiển lái /48, 64, 65/: Hệ số tính dao động – mối quan hệ giữa hai giá trị độ lệch chuyển tiếp đặc trưng lớn nhất liên tiếp, hệ số tính dao động cho phép đánh giá độ ổn định của hệ thống phi tuyến; Thời gian của quá trình chuyển tiếp – là khoảng thời gian từ thời điểm cho kích thích điều khiển đến thời điểm mà tại đó độ lệch giá trị tín hiệu đầu ra so với giá trị cho trước không vượt quá 5%; Đại lượng vượt quá giá trị đầu ra – là mối quan hệ phần trăm của hiệu giữa giá trị đặc trưng chuyển tiếp lớn nhất và giá trị định trước đối với giá trị định trước này. Hình 14. Mô phỏng các rãnh giảm tải của bơm trong ống vỏ của bộ phân phối thủy lực Các hệ thống điều khiển lái là một trong các cụm quan trọng nhất của máy công trình. Trên cơ cở kinh nghiệm khai thác, phân tích các giải pháp kết cấu và các kết quả nghiên cứu chúng ta đưa ra một loạt các yêu cầu đối với hệ thống thủy lực điều khiển lái /21, 58, 66/ như sau: Trong mọi tình huống đối với lái xe cơ cấu điều khiển hoạt động của hệ thống điều khiển lái phải là cơ cấu điều khiển lái; Độ nhạy, khả năng điều chỉnh và khả năng tác động nhanh của hệ thống điều khiển lái phải đảo bảo sao cho người lái có thể tin cậy điều khiển xe theo quỹ đạo xác định khi thực hành tất cả các thao tác mà xe có thể thực hiện được; Các mạch thủy lực của hệ thống điều khiển lái bằng dẫn động thủy lực phải có các bộ phận sau /58, 66/: Bộ phân điều chỉnh áp suất để đảm bảo găn ngừa tình huống phát sinh áp suất vượt quá ngưỡng cho phép trong hệ thống thủy lực; Các ống mềm, ống nối, các ống dẫn cứng phải chịu được áp suất gấp 4 lần giới hạn áp suất giới hạn cho phép điều chỉnh bởi van điều chỉnh áp suất của hệ thống điều khiển lái; Vỏ bọc các ống dẫn chất lỏng công tác để trách hiện tượng xoắn, vặn quá mức, chống ma sát và chống mòn. Lực điều khiển không vượt quá các giá trị trình bày trong các công trình /21, 26/, cụ thể như sau: Lực điều khiển hệ thống điều khiển lái hoạt động bình thường không quá 350 N. Lực điều khiển hệ thống điều khiển lái trong trường hợp làm việc có hỏng hóc không quá 350 N. Khả năng quay của các bộ phận của khung nối từ một vị trí biên đến vị trí khác không vượt quá 5 vòng quay tay lái. Cho phép tăng số vòng quay của tay lái nếu tỉ số truyền góc của dẫn động thủy lực điều khiển lái không lớn hơn 20. Khi bơm không hoạt động có thể tăng tỉ số truyền để đảm bảo điều kiện quay vòng xe /58, 66/. Các cụm của hệ thống thủy lực điều khiển lái được thiết kế có khả năng hoạt động với áp suất lớn nhất là 16 Mpa /58, 66/. Kết cấu của hệ thống thủy lực điều khiển lái phải là một khối, bộ phân phối thủy lực phải có mối liện hệ với cơ quan điều khiển /21, 66/. Tốc độ trượt của cơ quan điều khiển khi bơm không hoạt động và khi bánh lái ở vị trí biên cần duy trì được áp suất trong ống cao áp điều chỉnh bằng van an toàn và không quá 0, 31 rad/s /21, 58/. Dự trữ kỹ thuật của hệ thống thủy lực điều khiển lái không thấp hơn độ dự trữ của xe /21/. Hệ thống thủy lực điều khiển lái phải đảm bảo khả năng quay tay lá với tần số lớn nhất không dưới 1,5 vòng /giây khi tần số quay trục khuỷu động cơ trong khoảng 60 – 100% so với tần số quay tiêu chuẩn /21, 58/. Dải độ nhớt cho phép đối với chất lỏng công tác phải nằm trong khoảng 10 1200 sSt. Tốt nhất là chất lỏng công tác có độ nhớt từ 20 – 300 sSt. Nhiệt độ lớn nhất của chất lỏng công tác không quá 80 0 C. Như vậy trên cơ sở các nội dung đã trình bày ở trên có thể đi đến kết luận rằng khi thiết kế hệ thống điều khiển lái cần đảm bảo tuân thủ nghiêm các yêu cầu trên để nâng cao độ an toàn cho máy công trình khi hoạt động, nâng cao chất lượng của máy công trình đảm bảo cạnh tranh trên thị trường. 1.5 Các tiêu chí hiệu suất và con đường hợp lý hóa các quá trình công tác của hệ thống thủy lực điều khiển lái. Khi giải các bài toán kỹ thuật thường yêu cầu so sánh một số các phương án giải quyết khác nhau và lựa chọn trong số chúng phương án tốt nhất. Việc sử dụng các phương pháp phi truyền thống thường kéo theo các sai số đáng kể. Trong trường hợp này cần điều chỉnh đưa thêm các tiêu chí hiệu suất, các giá trị đặc trưng cho tính chất của một trong các chỉ số kính tế kỹ thuật quan trọng nhất của đối tượng thiết kế /41/. Hiệu suất thiết bị có thể được xác định trong từng giai đoạn sau: ở giai đoạn đầu tiên – thiết kế sơ bộ và thiết kế hoàn chỉnh với việc xây dựng các bản vẽ của xe; giai đoạn hai – giai đoạn chế tạo, khi bản thiết kế được thể hiện bằng sản phẩm thử nghiệm cụ thể; giai đoạn ba – giai đoạn khai thác, khi xe được sản xuất loạt và đưa vào khai thác trong các điều kiện khác nhau /58/. Phương pháp tổng hợp tối ưu hóa cho phép giải quyết vấn đề là tạo ra các tham số đầu ra của đối tượng, tiêu chí hiệu suất ngay từ giai đoạn thiết kế. Hàm mục tiêu cho phép so sánh hai hoặc nhiều lời giải đối lập nhau. Hàm mục tiêu phải là hàm đơn trị của các tham số được thiết kế. Đáp án có thể đánh giá không chỉ một mà bằng một vài hàm mục tiêu. Trong trường hợp này cần đưa vào hệ thống các tiêu chí ứng với từng hàm mục tiêu khi sử dụng các tiêu chí tổng hợp. Các tiêu chí tốt nhất thường là sử dụng các hệ số gọi là hệ số trọng lượng /41/. Hiện nay thường sử dụng tiêu chí vec tơ. Trong công trình này tiêu chí hiệu suất được hiểu là các giới hạn đặc tính đầu ra, các chỉ số ổn định và chất lượng của hệ thống thủy lực điều khiển lái, các chỉ số này thể hiện khả năng hoạt động của hệ thống, tức là nó đáp ứng tất cả các yêu cầu đã đề ra đối với hệ thống. Như vậy các tiêu chí hiệu suất của hệ thống thủy lực điều khiển lái là: Đảm bảo lưu lượng cần thiết của hệ thống thủy lực điều khiển lái; Đảm bảo quay vòng xe khi áp suất trong hệ thống thủy lực điều khiển lái không vượt quá giá trị được điều chỉnh bởi van an toàn, nói cách khác là giảm độ chênh áp trong bộ phân phối thủy lực của cơ cấu thủy lực điều khiển lái; Đảm bảo ổn định làm việc của hệ thống thủy lực điều khiển lái; Sự tương thích các chỉ số chất lượng của quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái, chẳng hạn như sự chênh lệch thời gian của quá trình chuyển tiếp và độ chễ thực tế. Thể tích công tác của động cơ thủy lực tín hiệu ngược và các tham số cơ bản của bộ phân phối thủy lực đóng vai trò là các tham số kết cấu tối ưu của cơ cấu thủy lực điều khiển lái, các tham số này gồm các đường kính của các lỗ của dãy động cơ thủy lực, các góc nghiêng của vùng không nhạy cảm của bộ phân phối và diện tích thiết diện thông qua của các rãnh giảm tải của bộ phân phối. 1. Các yêu cầu đối với thể tích công tác của động cơ thủy lực tín hiệu ngược. Dễ thấy rằng thể tích chất lỏng công tác trong bơm phụ thuộc vào thiết kế kích thước của bơm, nói cách khác là phụ thuộc vào động cơ thủy lực thông tin ngược. Thể tích chất lỏng công tác tại đầu ra của hệ thống thủy lực cơ cấu điều khiển lái. Thể tích chất lỏng công tác tại đầu ra của hệ thống thủy lực cơ cấu điều khiển lái phải đủ để dịch chuyển cán pistong của xi lanh chấp hành từ vị trí biên đến vị trí khác, đảm bảo quay vòng hoàn toàn xe trong khoảng 5 vòng quay tay lái. Như vậy /3, 48/, (1.3) Trong đó thể tích chất lỏng cần để dịch chuyển pistong của xi lanh chấp hành từ vị trí biên đến vị trí khác; q – thể tích công tác của động cơ thủy lực tín hiệu ngược. 2. Các yêu cầu đối với áp suất trong hệ thống thủy lực điều khiển lái. Các yêu cầu đối với áp suất chất lỏng trong hệ thống nhằm đảm bảo sao cho giá trị áp suất sinh ra trên cán pistong của xi lanh chấp hành đảm bảo quay vòng xe nhưng không vượt quá giá trị áp suất được van an toàn điều chỉnh: (1.4) Trong đó áp suất điều chỉnh bởi van an toàn. 3. Tính ổn định trong hệ thống được đánh giá thông qua hệ số dao động M. Khi hệ số dao động lớn hơn hoặc bằng 100%, ứng với tình huống dao động của hệ thống không phải là dao động tắt dần, vì vậy để đảm bảo tính ổn định cần đảm bảo điều kiện sau: M < 100%. (1.5)"
    },
    {
      "id": "4",
      "title": "Nghiên cứu thực nghiệm cơ cấu thủy lực điều khiển lái.",
      "content": "4. Đối với hệ thống tự động điều chỉnh, giá trị vượt ngưỡng tín hiệu đầu ra phải không quá 20%, vì vậy điều kiện của tiêu chí hiệu suất đối với giá trị vượt ngưỡng là: σ < 20% (1.6) Như vậy các yêu cầu đối với đặc tính tín hiệu đầu ra và các chỉ số chất lượng để đảm bảo ổn định đã được xây dựng. Tuy nhiên ngoài ra cần xác định hướng hoàn thiện các đặc trưng tín hiệu ra và các chỉ số ổn định, chất lượng để tiêu chuẩn hóa các quá trình làm việc của hệ thống thủy lực điều khiển lái. 1. Để nâng cao hiệu suất dẫn động thủy lực của xe về tổng thể cần giảm áp suất trong hệ thống, để giảm sự rò rỉ dầu và làm giảm độ mòn của các chi tiết dẫn động thủy lực bằng cách chọn các tham số tiêu chuẩn của bộ phân phối thủy lực, nói cách khác điều kiện (1.2) cần được bổ sung thêm điều kiện sao: p → min (1.7) 2. Để đảm bảo độ dự trữ ổn định khi giải bài toán tổng hợp cần thỏa mãn điều kiện: M → min (1.8) 3. Để giảm giá trị vượt ngưỡng tín hiệu đầu ra cần thỏa mãn điều kiện: σ → min (1.9) 4. Để nâng cao tốc độ phản ứng nhanh của hệ thống thủy lực điều khiển lái cần giảm thời gian điều chỉnh lưu lượng tại đầu ra, tức là: (1.10) Như vậy các biểu thức (1.3…1.6) cho biết các biên độ mà các đặc trưng tín hiệu đầu ra, các chỉ số chất lượng của hệ thống phải nằm trong khoảng này để đảm bảo cho hệ thống có khả năng hoạt động tin cậy. Các biểu thức (1.7…1.10) cho biết hướng dịch chuyển giá trị tín hiệu đầu ra, cá chỉ số ổn định và chất lượng để tiêu chuẩn hóa quá trình hoạt động của hệ thống thủy lực điều khiển lái bằng cách tối ưu hóa các tham số kết cấu của cơ cấu thủy lực điều khiển lái. Xác định hướng ưu tiên, đồng thời xác định các phương pháp tối ưu được dùng để tiến hành phân tích tổng hợp. 2. Mô hình toán hệ thống điều khiển lái của máy công trình có khung bản lề khớp động. Việc tiến hành các nghiên cứu lý thuyết phương tiện kỹ thuật được tạo ra không thể thực hiện được nếu không có mô hình toán học của đối tượng cần nghiên cứu. Các mô hình toán học thường được thể hiện dưới dạng hệ thống các phương trình vi phân nào đó (hệ thống các phương trình vi phân tổng quát, các phương trình vi phân riêng biệt, các biểu thức đại số v.v), chúng phản ánh tương đối chính xác các tính chất của đối tượng nghiên cứu /19, 81/. Hệ thống điều khiển lái máy công trình là hệ thống động học phức tạp, chúng chịu tác dụng của các tín hiệu điều khiển và các tác động kích thích bên ngoài mang tính ngẫu nhiên. Để xây dựng mô hình toán của hệ thống điều khiển lái sử dụng các phân tích mang tính hệ thống, xuất phát từ các phân tích này việc điều khiển lái máy công trình được thực hiện giống như hệ thống phức tạp được cấu thành từ các hệ thống con riêng biệt có mối quan hệ tương tác qua lại với nhau: Hệ thống thủy lực điều khiển lái, quá trình quay vòng xe với khung nối và các tác động kích thích mang tính ngẫu nhiên tác động lên hệ thống điều khiển lái. Mỗi hệ thống thành phần có các tính chất và quy luật hoạt động xác định, được miêu tả bằng các mô hình toán học. Các mô hình toán học của các hệ thống con hợp thành mô hình toán học phức tạp của hệ thống. Việc xây dựng mô hình toán học của hệ thống điều khiển lái máy công trình dựa trên cơ sở các nghiên cứu lý thuyết, phương pháp luận phân tích một cách hệ thống. Mô hình toán học được đánh giá là không đầy đủ nếu không miêu tả hết các tính chất động học của xe cơ sở và các tác động ngẫu nhiên lên xe và hệ thống thủy lực điều khiển lái."
    },
    {
      "id": "2.1",
      "title": "Mô hình toán học hệ thống thủy lực điều khiển lái.",
      "content": "2.1 Mô hình toán học hệ thống thủy lực điều khiển lái. Các phần tử cơ sở của dẫn động thủy lực được miêu tả bằng các hệ thống phương trình vi phân phi tuyến có tính đến các hệ số thay đổi, các điều kiện ban đầu và các điều kiện biên, các phương trình phi tuyến, các phương trình liên hệ đại số chúng hợp thành hệ phương trình miêu tả tính chất của hệ thống /37/. Các phương trình được xây dựng sao cho kết sau khi giải thu được các giá trị tín hiệu thay đổi (áp suất, lưu lượng, vận tốc và các giá trị thay đổi khác …) tại đầu vào và đầu ra của hệ thống /81/. Các tham số đầu vào thường được quy ước ký hiệu là “1” còn các tham số đầu ra là “2”. Cần thiết lập mô hình toán học đối với từng phần tử khi xây dựng mô hình toán dẫn động thủy lực, bởi vì hệ thống nghiên cứu là phi tuyến chứa các phần tử phi tuyến (van và ống vỏ bộ phân phối thủy lực). Ngoài ra hàm truyền miêu tả một khâu tác động có tính định hướng, tức là phần tử có một tham số đầu vào và một tham số đầu ra. Các phần tử của dẫn động thủy lực có ít nhất hai tham số đầu vào và hai tham số đầu ra: lưu lượng chất lỏng công tác và áp suất tại đầu vào và đầu ra, ngoài ra có thể còn có các tác động điều khiển và các tác động kích thích. Ngoài ra các cụm dẫn và trích công suất có thể được xem như đóng vai trò là các tham số đầu và đầu ra bổ sung (bơm, động cơ thủy lực). Ngoài ra hệ còn có các hệ số thay đổi của các phương trình vi phân, chúng thay đổi theo thời gian một cách ngẫu nhiên hoặc theo một quy luật nào đó. Như vậy hướng mô hình toán học đã chọn cho phép tính tới số lượng cần thiết các tham số góp phần nâng cao độ chính xác của mô hình. Quá trình xây dựng mô hình toán học của hệ thống thủy lực điều khiển lái thực hiện theo các giai đoạn sau /31, 32, 55/: Thu thập giả thiết; Tổng hợp sơ đồ tính toán hệ thống thủy lực điều khiển lái; Xây dựng sơ đồ khối hệ thống thủy lực điều khiển lá trên cơ sở sơ đồ tính toán; Chia hệ thống thành các hệ thống con và các phần tử; Thiết lập mô hình toán học cho từng phần tử ứng với các giả thiết ban đầu; Liên kết các mô hình toán học của từng phần tử và các hệ thống con thành mô hình toán học thống nhất của hệ."
    },
    {
      "id": "2.1.1",
      "title": "Sơ đồ tính toán hệ thống thủy lực điều khiển lái.",
      "content": "2.1.1 Sơ đồ tính toán hệ thống thủy lực điều khiển lái. Để thiết lập sơ đồ tính toán hệ thống thủy lực điều khiển lái cần có sơ đồ thủy lực trình bày trên hình 2.1 /89/. Hình 2.1 Sơ nguyên lý hệ thống thủy lực điều khiển lái. Hệ thống thủy lực điều khiển lái cấu tạo gồm bộ phân phối 1 liên kết động học với tay lái 2, động cơ thủy lực tín hiệu ngược 3 và liên kết với các ống thứ nhất và thứ 3, các xi lanh thủy lực chấp hành 4, tuyến ống 2 và thùng dầu 6, tuyến ống thứ 5 và bơm 5, tuyến ống thứ 4, thứ 6 và động cơ thủy lực tín hiệu ngược 3. Các van chống chân không 10, 11 và các van chống va đập 12, 13 lắp trên các tuyến ống thứ nhất và thứ 6 của của bộ phân phối 1. Khi bộ phân phối ở vị trí trung gian dòng chất lỏng công tác từ bơm 5 đi đến tuyến ống 5 của bộ phân phối thủy lực 1 và toàn bộ dòng chất lỏng đi qua tuyến ống thứ 2 của bộ phân phối 1 chảy đến thùng dầu 6. Khi quay tay lái 2 sẽ làm phát sinh tín hiệu hoạt động trong bộ phân phối 1 (ví dụ, xảy ra hiện tượng dịch chuyển van trượt sang phải). Khi đó tuyến ống thứ hai và thứ 5 của bộ phân phối 1 sẽ tách liên kết, dòng chất lỏng từ bơm 5 chảy qua tuyến ống thứ tư và thứ 5 của bộ phân phối 1 đến động cơ thủy lực tín hiệu ngược và từ đó chảy qua tuyến ống thứ 6 và thứ nhất của bộ phân phối 1 rồi đến khoang bên trái của xi lanh chấp hành 4 để thắng tải trọng bên ngoài. Pistong của xi lanh chấp hành dịch chuyển sang bên phải. Dòng chất lỏng công tác từ khoang xả của xi lanh chấp hành 5 chảy qua tuyến ống thứ tư và thứ ba của bộ phân phối 1 đến thùng dầu 5. Trên cơ sở sơ đồ hệ thống thủy lực đã trình bày chúng ta thiết lập sơ đồ tính toán như trên hình 2.2. Hình"
    },
    {
      "id": "2.2",
      "title": "Mô hình toán các tác động kích thích ngẫu nhiên tác động lên hệ thống điều khiển lái.",
      "content": "2.2 Sơ đồ tính toán hệ thống thủy lực điều khiển lái. Trong đó Q PIT lưu lượng chất lỏng tại đầu ra của bơm và tại đầu vào của tuyến ống dẫn nối bơm với hệ cơ cấu thủy lực điều khiển lá; Q GL1 – lưu lượng chất lỏng công tác tại đầu ra của tuyến ống thủy lực và tại đầu vào bộ phân phối thủy lực; Q R – lưu lượng chất lỏng tại đầu ra của bộ phân phối thủy lực và tại đầu vào động cơ thủy lực tín hiệu ngược; Q SL – lưu lượng chất lỏng đi vào tuyến ống xả tải; Q OS lưu lượng chất lỏng công tác tại đầu ra của động cơ thủy lực tín hiệu ngược và tại đầu vào tuyến ống thủy lực nối cơ cấu thủy lực điều khiển lái với các xi lanh chấp hành; Q GL2 – lưu lượng chất lỏng tại đầu ra của tuyến ống thủy lực và đi vào xi lanh chấp hành; R SIL – lực đặt tại cán xi lanh chấp hành, hình thành lên lực cản quay vòng và tương tác bánh xe với mặt đất; p CIL – áp suất tại đầu vào xi lanh chấp hành và tại đầu ra của tuyến ống thủy lực; p GL2 – áp suất tại đầu vào tuyến ống thủy lực và tại đầu ra của động cơ thủy lực tín hiệu ngược; p OS – áp suất tại đầu vào động cơ thủy lực tín hiệu ngược và tại đầu ra của bộ phân phối thủy lực; p R – áp suất tại đầu vào bộ phân phối thủy lực và tại đầu ra của tuyến ống thủy lực; p GL1 – áp suất của bơm α( t) = góc quay vòng tay lái (van trượt); α OS (t) – góc quay vòng của rô to động cơ thủy lực tín hiệu ngược; x (t) – dịch chuyển cán pistong của xi lanh chấp hành. 2.1.2. Sơ đồ khối hệ thống thủy lực điều khiển lái. Trên cơ sở sơ đồ tính toán chúng ta xây dựng sơ đồ khối của hệ thống. Sơ đồ khối là toàn bộ các khối và các tín hiệu, chúng thể hiện tương ứng với các phần tử và các mối liên hệ của sơ đồ tính toán. Mỗi khối của sơ đồ khối là một hệ thống con hoặc một phần tử của hệ thống thủy lực điều khiển lái, nó chứa sơ đồ cấu trúc của phần tử được thể hiện trên sơ sở các phương trình vi phân mô tả phần tử đó /31, 32/. Trong sơ đồ khối đề xuất mỗi phần tử là một đối tượng thủy lực đa cực hoặc là đối tượng thủy lực đa chiều, vì vậy các khối sẽ có một số thuộc tính thể hiện tương ứng với các tác động đầu vào, đầu ra, các tác động điều khiển và các tác động kích thích. Sơ đồ khối của hệ thống thủy lực điều khiển lái trình bày trên hình 2.3, trong đó f – diện tích thiết diện các rãnh trong bộ phân phối thủy lực quy định góc xoay của van trượt; f OS – diện tích thiết diện các rãnh thủy lực xác định góc xoay của vỏ; Δ f diện tích thiết diện điều chỉnh. Hình"
    },
    {
      "id": "2.3",
      "title": ". Mô hình mô phỏng quay vòng xe với khung nối – khớp động.",
      "content": "2.3 Sơ đồ khối hệ thống thủy lực điều khiển lái Khi mô tả toán học hệ thống thủy lực điều khiển lái sử dụng các giả thiết sau /19, 31, 32, 53, 54, 56, 58, 81, 95/: Không kể tới sự ảnh hưởng của các quá trình sóng lên chất lượng động học dẫn động điều khiển lái; Nhiệt độ và độ nhớt chất lỏng công tác cũng như số lượng không khí không hòa tan không thay đổi trong suốt quá trình chuyển tiếp; Hệ số lưu lượng van điều khiển là giá trị ổn định; Không kể tới độ khổng ổn định lưu lượng của bơm; Các tham số tập chung của các phần tử thủy lực; Không tính tới độ lệch tâm của van trượt – vỏ. 2.1.3. Mô tả toán học các phần tử của hệ thống thủy lực điều khiển lái. Mô hình toán học bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái. Bộ phân phối thủy lực cùng với động cơ thủy lực tín hiệu ngược kết hợp thành bộ điều khiển của cơ cấu thủy lực điều khiển lái. Nhiệm vụ của nó không chỉ là khởi động, dừng hoặc phân phối lại các dòng chất lỏng công tác trong hệ thống, về tổng thể cùng với động cơ thủy lực tín hiệu ngược nó làm thay đổi lưu lượng tại đầu ra của hệ thống nhờ sự thay đổi diện tích các thiết diện thông qua phụ thuộc vào vận tốc quay tay lái. Bộ phân phối thủy lực có kết cấu kiểu van cấu tạo gồm van trượt và vỏ. Khi quay tay lái van trượt dịch chuyển một góc α (t), mở thông các thiết diện thông qua của dãy thủy lực bộ phân phối thủy lực, dòng chất lỏng công tác chảy qua động cơ thủy lực tín hiệu ngược đến xi lanh chấp hành, động cơ thủy lực tín hiệu ngược tạo tín hiệu ngược lại nhờ sự dịch chuyển của vỏ van trượt so với vị trí ban đầu một góc α OS (t) để điều chỉnh diện tích thiết diện thông qua của các rãnh trong bộ phân phối thủy lực Δ f ( t ) và dó đó điều chỉnh lưu lượng chất lỏng công tác Q(t) tại đầu ra của cơ cấu thủy lực điều khiển lái /31, 32, 33/. Bộ phân phối thủy lực tạo cản cục bộ, ngoài ra nó còn là phần tử phi tuyến của hệ thống, vì vậy nó thể hiện các đặc tính tĩnh của vỏ và van bộ phân phối dưới dạng các mối quan hệ phi tuyến, còn bản thân bộ phân phối thể hiện các đặc tính của van điều chỉnh. Khi quay tay lái, tại cặp lắp ghép van trượt – vỏ phát sinh mô men ma sát, quy định tốc độ quay tương đối của van trượt và của vỏ. Mô men ma sát cũng thể hiện đặc tính phi tuyến tĩnh. Sơ đồ khối của bộ phân phối thủy lực trình bày trên hình 2.4. Sơ đồ tính toán điều chỉnh các rãnh dãy thủy lực của bộ phân phối thủy lực trình bày trên hình 2.5. Mô hình toán học của bộ phân phối thủy lực cấu tạo gồm mô hình toán học của van trượt và của vỏ, thể hiện dưới dạng các đặc tính phi tuyến tĩnh, mô hình toán học của van điều chỉnh và mô hình ma sát trong bộ phân phối tại cặp lắp ghép van trượt – vỏ. Đặc tính tĩnh của van trượt bộ phân phối thủy lực miêu tả bằng phương tình sau /31/: (2.1) Trong đó f UT – diện tích thiết diện các rãnh chảy; f MAX – diện tích cực đại các thiết diện dòng chảy; z – số lượng các lỗ của dãy thủy lực; r 0 – bán kính các lỗ của dãy thủy lực; r z – bán kính van trượt. Hình 2.4 Sơ đồ khối của bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái. Hình 2.5. Sơ đồ tính toán các thiết diện điều chỉnh của dãy thủy lực Đặc tính tĩnh của vỏ bộ phân phối thủy lực miểu tả bằng phương trình sau /31/: (2.2) Mối quan hệ phi tuyến (2.1) trình bày trên hình 2.6, trong đó α 1 ….+ α 2 – vùng không nhạy của bộ phân phối thủy lực; | α 1 … α 2 | vùng công tác của bộ phân phối thủy lực; | α 2 … ∞ | vùng bão hòa. Hình 2.6 Mối quan hệ diện tích thiết diện thông qua của dãy thủy lực bộ phân phối thủy lực và góc quay van trượt tương đối với vỏ. Bộ phân phối thủy lực được miêu tả bằng các phương trình lưu lượng thông qua van điều chỉnh có kể đến sự rò rỉ của chất lỏng công tác qua khe thiết diện /19, 31, 32, 34, 53, 54, 55, 56, 58/: QR 2 = QR 1 – QSL – QUT; (2.3) (2.4) (2.5) (2.6) Trong đó Q R1 và Q R2 – lưu lượng chất lỏng công tác tại dầu vào và đầu ra của bộ phân phối thủy lực; Q SL – lưu lượng chất lỏng công tác chảy đến cửa xả; p R1 và p R2 – áp suất tương ứng tại đầu vào và đầu ra của bộ phân phối thủy lực; B – hệ số tính tới quán tính của cột chất lỏng; μ – hệ số lưu lượng; ρ Ж – khối lượng riêng của chất lỏng công tác; r G – bán kính vỏ; v – độ nhớt động học của chất lỏng công tác; L – độ dài cặp lắp ghép; ɛ hệ số đặc tính lệch tâm của thiết diện hình nón. Mô hình toán học ma sát trong bộ phân phối thủy lực . Mô hình toán học ma sát miêu tả lực ma sát trong cặp lắp ghép van trượt – vỏ. Mô men ma sát M R được mô hình hóa bằng hàm vận tốc tương đối Δ ω và là tổng mô men ma sát tĩnh M C , mô men ma sát Coulomb M K và mô men ma sát nhớt M B , như trình bày trên hình 2.7. Hình 2.7 Mối quan hệ mô men ma sát trong bộ phân phối thủy lực với góc quay tương đối. Ma sát tĩnh – có đặc tính giảm dần, phát sinh ở các giá trị vận tốc góc nhỏ. Ma sát coulomb làm cho mô men ma sát ổn định ở mọi giá trị vận tốc góc. Ma sát nhớt ngăn cản khả năng quay nhờ mô men vận tốc tương đối. Trong mô hình đề xuất đưa ra ngưỡng vận tốc góc ω 0 nhỏ, trong khoảng này mô men ma sát gia tăng tỉ lệ thuật với vận tốc góc với hệ số tỉ lệ k пр = М С + М K /ω 0 . Tham số này được đưa vào mô hình nhằm nâng cao hiệu suất tính khi các giá trị vận tốc góc chuyển tiếp từ vùng âm sang vùng dương và ngược lại, do mô men ma sát phát sinh khi vật thể tiếp xúc cơ học với khối lượng phân bố tại thời điểm khi Δ ω = 0 không thể thay đổi giá trị của nó từ ( МС + МК ) đến – ( МС + МК ). Bằng thực nghiệm đã chứng minh rằng giá trị ngưỡng vận tốc nằm trong giải từ 10 -3 – 10 -5 rad/ giây – là khoảng giá trị tốt nhất đảm bảo độ chính xác, độ tin cậy và hiệu suất hoạt động. Cần nhấn mạnh rằng, tần số vòng quay tương đối khi mà mô men giảm xuống dưới mức ma sát tối thiểu không ảnh hưởng đến giá trị mô men xoắn ma sát xác định với các giả thiết này. Các vật thể sẽ quay tương đối với nhau với vận tốc rất nhỏ, tỉ lệ thuận với tác động của mô men xoắn /31/. Lực ma sát trong bộ phân phối thủy lực được miểu tả bằng các phương trình /31/: (2.7) (2.8) (2.9) Trong đó ω Z , ω G – tương ứng với các giá trị vận tốc góc tuyệt đối của van trượt và vỏ của bộ phân phối thủy lực; Δω – vận tốc góc tương đối; M – mô men ma sát; M C – mô men ma sát tĩnh; M k – mô men ma sát Coulomb; c V – hệ số chuyển tiếp giữa ma sát tĩnh và ma sát Coulomb; h R – hệ số ma sát nhớt của bộ phân phối; ω 0 – ngưỡng vận tốc tương đối. Hệ số c V dùng cho giai đoạn chuyển tiếp giữa ma sát tĩnh và ma sát Coulomb. Giá trị của nó được xác định xuất phát từ các kiến giải: thành phần ma sát tĩnh đạt khoảng 95% so với giá trị quy định ở vận tốc 3/c V và 98% ở vận tốc 4/c V , giá trị này cho phép xác định giá trị tương đối cV ≈ 4/ ω MIN , trong đó ω MIN – vận tốc tương đối, ở giá trị này mô men xoắn ma sát nhận giá trị nhỏ nhất /31/. Các biểu thức (2.1)… (2.9) có tính tới các giả thiết đã nêu cho phép biểu diễn bộ phân phối thủy dưới dạng sơ đồ cấu trúc như trên hình 2.8. Hình 2.8. Sơ đồ cấu trúc bộ phân phối thủy lực k R11 = h R ; k R12 = c V ; k R13 = M C ; Mô hình toán học động cơ thủy lực tín hiệu ngược . Dòng chất lỏng công tác từ bộ phân phối thủy lực chảy qua động cơ thủy lực tín hiệu ngược đến xi lanh công tác. Động cơ thủy lực tín hiệu ngược cấp tín hiệu ngược nhờ dịch chuyển vỏ van trượt của bộ phân phối đi một góc α os (t) , để điều chỉnh diện tích thiết diện thông qua của các rãnh trong bộ phân phối thủy lực /53, 58/. Lưu lượng và áp suất chất lỏng công tác tại đầu vào và mô men trên ro to động cơ thủy lực quyết định lực ma sát là các tham số đầu vào của động cơ thủy lực tín hiệu ngược, lưu lượng và áp suất tại đầu ra, cũng như góc quay hoặc vận tốc góc của rô to động cơ thủy lực là các tham số đầu ra. Sơ đồ tính toán và sơ đồ khối của động cơ thủy lực tín hiệu ngược trình bày trên hình 2.9 và 2.10. Hình 2.9 Sơ đồ tính toán động cơ thủy lực tín hiệu ngược Hình 2.10 Sơ đồ khối của động cơ thủy lực tín hiệu ngược Động cơ thủy lực tín hiệu ngược được miêu tả bằng các phương tình lưu lượng có kể tới sự rò rỉ và sự nén chất lỏng công tác, phương trình chuyển động của ro tô động cơ thủy lực và phương trình mô men trên trục động cơ thủy lực /16, 81/: Q OS2 = Q OS1 – Q УТ – Q СЖ ; (2.10) (2.11) Trong đó Q OS1 lưu lượng chất lỏng công tác tại đầu vào làm quay rô to động cơ thủy lực; Q OS2 – lưu lượng tại đầu ra; Q УТ lưu lượng đi vào động cơ thủy lực bị hao hụt; Q СЖ lưu lượng chất lỏng công tác bị nén do quán tính của động cơ thủy lực; α OS – góc quay rô to động cơ thủy lực; I ГМ – mô men quán tính phần quay dẫn tới rô to động cơ thủy lực; q – thể tích công tác của động cơ thủy lực tín hiệu ngược; p OS2 – áp suất chất lỏng công tác tại đầu ra của động cơ thủy lực; M ГМ – mô men cản trên trục động cơ thủy lực; b P – hệ số tổn thất thủy – cơ; b – tổn thất thủy cơ ổn định. Mô men cản trên trục động cơ thủy lực do mô men ma sát trong cặp lắp ghép “van trượt – vỏ” tạo nên, do rô to của động cơ thủy lực liên kết động với vỏ của bộ phân phối thủy lực và mô men ma sát của rô to chính bản thân động cơ thủy lực. М ГМ = М R + М РОТ , (2.12) Trong đó М РОТ – mô men ma sát của rô to động cơ thủy lực. Do sự tiếp xúc của rô to với stator là tuyến tính, đồng thời có tính tới việc không có các ổ đỡ và các vòng găng trong mối ghép với rô to nên ma sát tĩnh và ma sát Coulomb co thể bỏ qua, chỉ còn ma sát nhớt, vì vậy mô men của rô to xác định theo công thức /16/: (2.13) Trong đó h ГМ hệ số mâ sát nhớt trong động cơ thủy lực tín hiệu ngược. Lưu lượng trong động cơ thủy lực xác định từ các biểu thức sau /16, 34, 53, 58/: ; (2.14) (2.15) (2.16) (2.17) Trong đó hiệu suất của động cơ thủy lực; k СЖ – hệ số nén của chất lỏng công tác, k УТ – hệ số tổn hao; p НОР. áp suất tiêu chuẩn của động cơ thủy lực tín hiệu ngược. Mô hình toán học van an toàn . Trong các dẫn động thủy lực van an toàn đảm bảo bảo vệ hệ thống thủy lực khỏi bị quá tải do áp suất trong hệ thống vượt quá giá trị tiêu chuẩn. Van bảo vệ hoạt động theo nguyên lý xả chất lỏng công tác ra cửa xả. Trong các cơ cấu thủy lực điều khiển lái có sử dụng van an toàn tác dụng trực tiếp bằng cách giảm vận tốc dịch chuyển của phần tử khóa điều chỉnh có dạng hình nón. Trên hình 2.11 và 2.12 trình bày sơ đồ tính toán và sơ đồ khối van an toàn, trong đó z K – dịch chuyển phần tử khóa điều chỉnh hình nón; Q K – lưu lượng chất lỏng công tác đi qua van; p K1 – áp suất trong van an toàn; p K2 – áp suất tại cửa xả. Hình 2.11. Sơ đồ tính toán van an toàn Hình 2.12 Sơ đồ khối van an toàn Khi xây dựng mô hình toán học van an toàn sử dụng các giả thiết bổ sung sau /37/: Khối lượng phần tử khóa – điều chỉnh có dạng hình nón và khối lượng quy dẫn của lò so tập chung tại tâm của phần tử khóa – điều chỉnh; Điều tiết dòng chất lỏng công tác nhờ mặt phẳng khe hở điều chỉnh, khe hở này xác định bằng khoảng cách từ mép của đế van đến bề mặt phần tử khóa – điều chỉnh; Độ nén của chất lỏng trong khoang giảm áp không được tính đến; Độ cứng của lò so phụ thuộc tuyến tính vào giá trị độ biến dạng dọc trục. Van an toàn được mô tả bằng phương trình chuyển động của phần tử khóa – điều chỉnh và phương trình lưu lượng chất lỏng công tác thông qua khe điều chỉnh /37, 81/: (2.18) (2.19) Trong đó m K – khối lượng phần di động của van; F K1 , F K2 – các diện tích công tác của van ứng với tại vị trí phía áp suất cao và vị trí xả tải; h K – hệ số ma sát nhớt của van; R TPK – lực ma sát khô; c – độ cứng của lò so; c 0 – giá trị độ nén sơ bộ của lò so; f K – diện tích khe điều chỉnh của van. Mô hình toán học của tuyến ống thủy lực . Tuyến ống thủy lực – phần tử của hệ thống thủy lực điều khiển lái, dùng để truyền năng lượng động học chất lỏng của dòng chất lỏng công tác từ thiết bị thủy lực này đến thiết bị thủy lực khác /37/. Mô hình hóa các quá trình chuyển tiếp trong các tuyến ống thủy lực của dẫn động thủy lực thường gặp không ít khó khăn, đòi hỏi cần miểu tả toán học các quá trình động trong dòng chất lỏng công tác đang lưu chảy khi thay đổi các tham số thủy động theo thời gian cũng như không gian choán chỗ của dòng chất lỏng /37/. Các dẫn động thủy lực điều khiển lái của máy công trình đặc trưng bởi chiều dài ống ngắn, hiếm khi đạt tới 4 m, vì vậy để miêu tả động học tuyến ống thủy lực cần xây dựng mô hình toán học với các tham số tập chung tại đầu vào và đầu ra. Giả thiết coi tuyến ống thủy lực như hệ thống với các tham số tập chung trong các cụm tính toán. Khi đó các phần tử đàn hồi, quán tính và các tính chất tiêu tán của chất lỏng công tác và các tham số cơ – lý của tuyến ống dẫn được quy vào các cụm tập chung riêng, còn các quá trình chuyển tiếp được miêu tả bằng các phương trình vi phân thông thường /37/. Sơ đồ tính toán và sơ đồ khối tuyến ống thủy lực với các tham số tập chung trình bày trên các hình 2.13, 2.14. Hình 2.13 Sơ đồ tính toán tuyến ống thủy lực Hình 2.14 Sơ đồ khối tuyến ống thủy lực Các tuyến ống thủy lực liên kết hệ thống thủy lực điều khiển lái với xi lanh chấp hành, bơm và thùng chất lỏng được miêu tả bằng các phương trình lưu lượng chảy qua tuyến ống thủy lực có tính tới độ nén của chất lỏng công tác và phương trình tổn hao áp suất /19, 32, 58, 80, 81/: Q GL2 = Q GL1 – Q C Ж. TP ; (2.20) (2.21) (2.22) Trong đó Q GL1 và Q GL2 – lưu lượng chất lỏng công tác tại đầu vào và đầu ra của tuyến ống thủy lực; Q C Ж. TP – lưu lượng xác định bởi độ biến dạng của thành ống và chất lỏng công tác; p GL1 và p GL2 – áp suất chất lỏng công tác tại đầu vào và đầu ra của tuyến ống thủy lực; γ – trọng lượng riêng của chất lỏng công tác; L GL – chiều dài tuyến ống thủy lực; d GL – đường kính tuyến ống thủy lực; k УПР. – hệ số đàn hồi của tuyến ống thủy lực /19, 58, 81/: (2.23) Trong đó E ПР. – mô đun đàn hồi quy dẫn của ống dẫn /58, 81/: (2.24) E Ж – mô đun đàn hồi của chất lỏng công tác; E CT – mô đun đàn hồi của thành ống dẫn; δ GL độ dày của thành ống dẫn; λ – hệ số tổn hao áp suất theo chiều dài ống /58, 81/: (2.25) Trong đó R E – trị số Raynol (58, 81): (2.26) Trong đó v Ж – hệ số độ nhớt động học chất lỏng công tác. Mô hình toán học xi lanh chấp hành . Xi lanh thủy lực là phần tử của dẫn động thủy lực, dùng để biến đổi năng lượng thủy lực của dòng chất lỏng công tác thành cơ năng chuyển động tương đối của khâu ra và của thân. Khi xây dựng mô hình toán học sử dụng các giả thiết bổ sung sau /37/: Khối lượng của khâu ra và của chất lỏng công tác trong các khoang pistong và trong cán xi lanh thủy lực tập chung tại tâm của khối lượng quy dẫn tại pistong; Các phần tử kết cấu của xi lanh thủy lực tuyệt đối cứng, ngoại trừ vỏ xi lanh; khi áp suất chất lỏng công tác tăng, vỏ sẽ biến dạng xuyên tâm, hiệu suất vùng ngoại biên không tính tới; Tổn hao năng lượng thủy động của dòng chất lỏng xác định bằng hao hụt ra bên ngòai và sự lưu chảy bên trong từ khoang công tác của xi lanh thủy lực qua các vùng tiếp xúc giữa pistong và cán; Chât lỏng công tác điền đầy khoang xi lanh thủy lực được xem như môi trường nén với các tham số tập chung ổn định về thể tích, tập chung tại các cụm tính toán; Không tính tới ảnh hưởng của độ nghiêng, độ dơ, khe hở đối với khả năng hoạt động của xi lanh thủy lực. Hình 2.15. Sơ đồ tính toán xi lanh chấp hành Hình 2.16. Sơ đồ khối xi lanh chấp hành Lưu lượng tại đầu vào xi lanh thủy lực, áp suất tại cửa xả và lực trên cán pistong là các tham số đầu vào của xi lanh thủy lực. Các tham số áp suất trong dòng hcaast lỏng, lưu lượng xả, độ dịch chuyển và vận tốc của khâu ra là các tham số đầu ra. Hệ các phương trình của mô hình toán xi lanh thủy lực bao gồm các phương trình dòng chảy liên tục thiết lập cho các khoang công tác của xi lanh thủy lực với thể tích thay đổi theo thời gian có tính tới sự hao hụt và lưu chảy chất lỏng, phương tình chuyển động của khâu ra dưới tác dụng của áp suất phụ thuộc vào tải trọng bên ngoài, ma sát khô và ma sát nhớt /37, 81/: ; (2.27) (2.28) (2.29) Trong đó x – dịch chuyển cán pistong của xi lanh thủy lực; Q CIL1 , Q CIL2 – lưu lượng chất lỏng công tác tại đầu vào và đầu ra đến xi lanh thủy lực; p CIL1 , p CIL2 – áp suất trong khaong công tác của xi lanh thủy lực và áp suất tại cửa xả; F 1 và F 2 – các diện tích công tác của khoang pistong và cán pistong; k УПР1 và k УПР1 – các hệ số đàn hồi của khoang pistong và cán pistong có chứa chất lỏng, m – khối lượng phần chuyển động quy dẫn tại cán pistong; h CIL – hệ số ma sát nhớt; R TP lực ma sát khô; R CIL – lực tại cán pistong xi lanh thủy lực. (2.30) (2.31) Trong đó Δ V 1 và Δ V 2 – các thể tích “chết” của khoang pistong và cán pistong; E ПР – mô đul thể tích đàn hồi quy dẫn của khoang chứa chất lỏng /31, 81/: (2.32) Trong đó E Ж – mô đul thể tích đàn hồi của chất lỏng công tác; D – đường kính của xi lanh thủy lực; δ CT độ dày thành xi lanh thủy lực; E CT – mô đul đàn hồi của vật liệu chế tạo thành xi lanh thủy lực. Giá trị của hệ số chảy tràn k ПЕР xác định đảm bảo độ kín pistong đối với các trường hợp chất lỏng công tác chảy tràn. Trường hợp thứ nhất khi chất lỏng công tác chảy từ khaong áp suất cao đến khoang áp suất thấp. Quá trình nghiên cứu được mô tả bằng định luật Fic. Hệ số chảy tràn chất lỏng công tác xác định như sau /31, 80/: (2.33) (2.34) Trong đó k σ – hệ số thấm; k 0 = 10 -8 – 10 -9 (đối với dầu mỏ); t – nhiệt độ chất lỏng công tác; ВУП, H УП, L УП các kích thước hình học đệm làm kín. Khi đệm làm kín bị mòn, lắp ráp không đúng hoặc bị hỏng xảy ra trường hợp khác – chảy tràn theo ống mao dẫn và xác định theo công thức /31, 80/: (2.35) hệ số tính tới đặc điểm hình dạng hình học của ống mao dẫn; độ cao ống mao dẫn; ξ Ж hệ số độ nhớt động học chất lỏng công tác. Hệ số chảy tràn k УТ – chỉ có ý nghĩa khi khoang cán pistong là khoang công tác. Xuất phát từ các giả thiết về sự phát sinh ma sát nhớt, hệ quả của chuyển động của khâu ra tương đối với môi trường chất lỏng công tác, hệ số ma sát nhớt có thể xác định bằng mối quan hệ /31, 37/: (2.36) Trong đó D ПШ , D ШТ , D Г , D К – các đường kính của pistong, cán pistong, vỏ và thân xi lanh; L ПШ , L ШТ – chiều rộng bề mặt tiếp xúc của đệm làm kín pistong và cán pistong; ρ Ж1 , ρ Ж2 , ρ 0 – khối lượng riêng của chất lỏng công tác trong khoang pistong và cán pistong của xi lanh thủy lực và khối lượng riêng của môi trường bên ngoài, v ж1 , v ж2 , v 0 – độ nhớt chất lỏng công tác trong khoang pistong và cán pistong của xi lanh thủy lực và độ nhớt của môi trường bên ngoài. Ma sát khô sinh ra tại các chi tiết tiếp xúc trực tiếp khi có sự chuyển động tịnh tiến tương đối của cán pistong với thân xi lanh thủy lực, trong trường hợp tổng quát xác định bằng hàm phức tạp liên quan tới tốc độ dịch chuyển và các lực tương đối đặt tại khâu ra /37, 80/: (2.37) Trong đó R P – lực cân bằng của áp suất chất lỏng công tác tại pistong: (2.38) Xuất phát từ giả thiết rằng trong cụm ma sát pistong sử ảnh hưởng không đáng kể của đệm làm kín bố trí phía khoang xả được bỏ qua, lực cân bằng của các lực ma sát khô phát sinh tại các đệm làm kín của pistong và cán pistong được xác định trên cơ sở nguyên lý lực chồng chất /31, 37/: (2.39) Trong đó lực ma sát trong cụm pistong; lực ma sát trong đệm làm kín. (2.40) (2.41) Trong đó f ПШ , f ШТ – hệ số ma sát của pistong và cán pistong; áp suất tiếp suất phát sinh do tác động của áp suất chất lỏng công tác lên đệm làm kín."
    },
    {
      "id": "2.4.1",
      "title": "Mô hình toán tổng quát hệ thống thủy lực điều khiển lái.",
      "content": "2.4.1 Mô hình toán tổng quát hệ thống thủy lực điều khiển lái. Ở giai đoạn này cần tiến hành bố cục tổng hợp lại hệ thống, tức là liên kết các mô hình toán của các phần tử và các hệ thống con của hệ thống thủy lực điều khiển lái thành một mô hình toán thống nhất. Việc liên kết các mô hình toán của các phần tử riêng biệt và các hệ thống con thành mô hình toán thống nhất của hệ thống được thực hiện theo các nguyên tắc sau: Đối với các phần tử / hệ thống con liên kết nối tiếp các tham số đầu ra của phần tử trước nó là các tham số đầu vào của phần tử tiếp theo, vì vậy các khối phần tử liên kết thành các cụm mà tại đó các tín hiệu đầu vào và đầu ra giống nhau; Đối với các phần tử và các hệ thống con mắc song song thì các tín hiệu tại đầu vào được chia ra, còn tại đầu ra thì cộng lại. Trên cơ sở sơ đồ khối của hệ thống thủy lực điều khiển lái trình bày trên hình 2.3 và các biểu thức (2.1…2.41) mô tả các phần tử của hệ thống này, theo nguyên tắc tổ hợp mô hình toán chúng ta xây dựng được sơ đồ cấu trúc hệ thống thủy lực điều khiển lái trình bày trên hình 2.17, các kí hiệu trên hình vẽ ứng với các kí hiệu trước kia đã sử dụng. Các hệ số truyền của các khâu của sơ đồ cấu trúc: Hình 2.17. Sơ đồ cấu trúc hệ thống thủy lực điều khiển lái 2.2 Mô hình toán các tác động kích thích ngẫu nhiên tác động lên hệ thống điều khiển lái. Trong quá trình quay vòng xe phần vận hành sẽ tương tác với nền đất và gây ra các tác động kích thích ngẫu nhiên, tác dụng lên hệ thống điều khiển lái cũng như toàn xe. Chính vì vậy cần phải tiến hành phân tích và xây dựng mô hình toán đặc điểm nền đất nơi xe hoạt động."
    },
    {
      "id": "2.2.1",
      "title": "Mô hình toán nền đất.",
      "content": "2.2.1 Mô hình toán nền đất. Để đánh giá được cấu trúc nền đất с ần tiến hành cào bằng khu vực chu vi với bán kính quay vòng xe, tiến hành đo đạc đánh giá ở từng khoảng 0,1 m. Tiến hành phân tích thống kê chọn ra các giá trị y( Θ) – sự phụ thuộc ngẫu nhiên tọa độ ngang của nền đất so với góc quay vòng. Để loại trừ các sai số lớn về sự phụ thuộc nhẫu nhiên tọa độ ngang của nền đất у 1 ≤ у 2 ≤ … ≤ у n trong kết quả thực nghiệm cần tiến hành tính toán kỳ vọng toán học theo công thức /15, 38, 40, 95/: (2.42) và độ tản mát theo công thức /15, 38, 40, 95/: (2.43) Trong đó x i – giá trị quan sát thứ i; n – số lượng quan sát. Các giá trị sai số lớn là các giá trị thỏa mãn bất đẳng thức /15, 38, 40, 95/: (2.44) Trong đó các giá trị của tham số phân bố Stiudent tra theo bảng với số bậc tự do là k = n-1 và xác suất tin cậy р д = 1 – α y ; α y – mức ý nghĩa; độ lệch bình phương trung bình. Với giả thiết rằng các số liệu đo được tuân theo quy luật phân bố của các đại lượng ngẫu nhiên. Giá trị thực của kỳ vọng toán học với xác suất р д xác định theo công thức /15, 38, 40, 43, 95/: (2.45) Trong đó giá trị đặc trưng cho quy luật phân bố chuẩn, số lượng độ lệch bình phương trung bình lệch khỏi tâm tản mát từ hai phía sao cho xác suất rơi vào vùng thu được bằng р д . Độ lệch bình phương trung bình xác định theo công thức /15, 38, 40, 95/: (2.46) Số lượng thử nghiệm cần thiết xác định trên cơ sở sai số đo tương đối kỳ vọng toán học và độ lệch bình phương trung bình, công thức xác định: (2.47) (2.47) Trong đó và sai số tương đối của kỳ vọng toán học và độ lệch bình phương trung bình; hệ số biến đổi giá trị đo. Thời gian mô hình hóa (thực hiện các phép đo) T xác định từ điều kiện đảm bảo độ chính xác cần thiết và xác xuất độ tin cậy đánh giá các giá trị thống kê trung bình: kỳ vọng toán học, độ lệch bình phương trung bình và và sai số bình phương trung bình tương đối xác định hàm tương quan /19, 58/. Thời gian ghi chép thỏa mãn các điều kiện xem xét đối với quá trình ergodic dừng và được xác định theo công thức /19, 58/: (2.49) (2.50) (2.51) , , thời gian cần thiết để mô hình hóa từ điều kiện đảm bảo sai số kỳ vọng toán học tương đối cho phép , độ lệch bình phương trung bình , và hàm tương quan ; hệ số phân bố chuẩn xác định theo độ tin cậy cho trước (xác xuất độ tin cậy); hệ số biến thiên của tham số đo; thời gian suy giảm của hàm tương quan. Để xác định thời gian suy giảm của hàm , dùng hàm tương quan tiêu chuẩn thu được (hình 2.18) để đo tọa độ ngang của cấu trúc địa hình trong quá trình nghiên cứu. Xác định hàm tương quan tiêu chuẩn đối với các lựa chọn rời rạc theo công thức /19, 58/: r KR = R KR /D R (2.52) Trong đó R KR – hàm tương quan phi tiêu chuẩn của tham số phân tích; D R – độ phân tán của tham số phân tích. (2.53) Trong đó n – số tung độ số hóa trên độ dài thực hiện; m – số tung độ đánh giá hàm tương quan đặc trưng cho khoảng tương quan của quá trình ngẫu nhiên; M R – kỳ vọng toán học của tham số phân tích; R(t i ) – giá trị hiện tại lựa chọn của quá trình ngẫu nhiên. (2.54) (2.55) Trong đó thời gian số hóa (lấy mẫu) giá trị lựa chọn quá trình ngẫu nhiên. Hình 2.18. Hàm tương quan tiêu chuẩn tọa độ địa hình Thời gian suy giảm tương quan xác định là thời gian cực đại mà các giá trị hàm tương quan tiêu chuẩn nằm trong khoảng ± 0,05 /19, 58/: (2.56) Theo giá trị lớn nhất Т σ = 24,5 s đối với tham số y, độ dài mô hình có tính tới khoảng ban đầu không ổn định . Phương trình lặp lại đối với hàm tương quan có dạng: (2.57) Biểu diễn như sau: (2.58) Trên hình 2.19 trình bày hàm xấp xỉ tọa độ địa hình у( Θ) . Hình 2.19. Hàm tương quan tọa độ địa hình thực nghiệm và xấp xỉ Độ lệch khi xấp xỉ mối quan hệ không quá 20%. Trên hình 2.20 trình bày một đoạn mô hình ngẫu nhiên tác động kích thích do địa hình tạo ra theo hàm tương quan dạng (2.57). Các tham số hà tương quan: σ = 0,083 m; α = 0,112 s -1 ; β = 0,133 s -1 . Hình 2.20. Một đoạn mô hình ngẫu nhiên tác động kích thích do địa hình tạo ra. 2.3. Mô hình mô phỏng quay vòng xe với khung bản lề – khớp động. Quay vòng xe có khớp nối động thực hiện nhờ sự kết hợp hai bán khung – khớp nối động. Mỗi bán khung liên kết động học với các xi lanh chấp hành, chúng phối hợp và điều khiển các khung di chuyển tương đối với khớp nối thẳng đứng. Như vậy khi quay vòng xe độ dịch chuyển và vận tốc dịch chuyển cán xi lanh chấp hành, lực và mô men cản quy dẫn về các bánh lốp là các tham số đầu vào, còn góc kết hợp và vận tốc góc của bán khung cũng như lực cản quay vòng quy dẫn về cán xi lanh chấp hành là các tham số đầu ra. Chúng ta đã xây dựng các tham số của máy xúc một gầu TO 30 để tính toán mô hình quay vòng của xe, tuy nhiên mô hình đã trình bày có thể sử dụng để nghiên cứu các quá trình động học khi quay vòng mọi loại máy có khớp nối động bằng cách đưa thêm các tham số cụ thể của các khối SimMechanics. Các tọa độ cấu trúc nền đất đóng vai trò là các tác động kích thích, phát sinh trong quá trình tương tác phần vận hành của bánh lốp với môi trường bên ngoài. Mô hình toán học quá trình quay vòng xe được xây dựng trong thư viện SimMechanics. SimMechanics – là một thư viện riêng của gói Simulink trong môi trường MATLAP dùng để mô hình hóa chuyển động cơ học của vật rắn. Công dụng chính của nó – mô hình hóa các chuyển động của các phần tử, các cơ cấu và của toàn xe trong không gian ở giai đoạn tính toán thiết kế, dựa trên các định luật của lý thuyết cơ học /94/. Khi sử dụng thư viện SimMechanics tích hợp trong Simulink, có thể sử dụng tất cả các khả năng của hệ thống MATLAB, nói cách khác có thể bổ sung vào các mô hình của hệ cơ học các phần tử từ các thư viện khác của Simulink và của hệ mở rộng. Ưu điểm của việc mô hình hóa các hệ cơ khi sử dụng SimMechanics trong Simulink là có thể tiến hành quá trình mô hình hóa đơn giản, người dùng không cần phải đào tạo nhiều, tốc độ tính toán nhanh khi mô hình hóa các chuyển động của nhiều khâu đối tượng với số bậc tự do lớn, di chuyển trong không gian rộng. Hệ cơ học được biểu diễn bằng biểu đồ liên kết khối, tương tự như các mô hình khác của Simulink, có sử dụng các khối trong thư viện SimMechanics. Các tính chất khối lượng – quán tính của các vật thể (các khâu, các hệ thống và cơ cấu), tọa độ các điểm đặc trưng của các vật thể (như tâm khối, điểm đặt các tác động kích thích và điều khiển bên ngoài, các điểm liên kết các khớp, bản lề) đóng vai trò là tham số đầu vào cho trước của các khối cơ học. Khác với các khối khác của Simulink thực hiện các phép toán hoặc xử lý các tín hiệu, các khối cơ của SimMechanics biểu diễn trực tiếp các vật thể hoặc các mối liên hệ giữa chúng. Các hệ cơ được mô hình hóa có thể là số lượng bất kỳ các vật rắn liên kết với khớp nối, có nhiều bậc tự do. Có thể giả thiết các giới hạn động học, các lực và mô men quay liên quan chặt chẽ tới quỹ đạo chuyển động của các vật thể /94/."
    },
    {
      "id": "2.3.1",
      "title": "Chọn và tổng hợp sơ đồ tính toán.",
      "content": "2.3.1 Chọn và tổng hợp sơ đồ tính toán. Mô hình mô phỏng quá trình quay vòng dựa trên cơ sở các giả thiết sau /25/: Xe được biểu diễn dưới dạng hai vật thể nối động có thể dịch chuyển trong mặt phẳng mà các cụm, cơ cấu của máy liên kết cứng với nhau dưới dạng vật thể Focht; Các bán khung là vật thể cứng tuyệt đối có khối lượng phân bố đều; Quay vòng xe diễn ra sao cho điểm tiếp xúc của một bách lốp của bán khung trước là tâm quay; Độ dơ và các lực ma sát khô trong các bản lề là rất nhỏ, coi như bằng không; Dao động của các bán khung trong mặt phẳng là rất nhỏ. Trên hình 2.21 trình bày sơ đồ tính toán xe có khớp nối động – bản lề. Các phần tử của nó gồm có: Bán khung phía trước của xe có tâm khối đặt tại điểm A; Bán khung sau của xe có tâm khối đặt tại điểm B. Xe được xét trong hệ tọa độ quán tính O 0 X 0 Z 0 , gốc tọa độ trùng với tâm tiếp xúc của bánh lốp bán khung phía trước, sẽ đứng yên khi quay vòng xe. Vị trí các bán khung trong hệ tọa độ quán tính xác định bằng vị trí của các hệ tọa độ cục bộ liên kết tương ứng: O 1 X 1 Z 1 – với bán khung phía trước; O 2 X 2 Z 2 – với bán khung phía sau. Sự dịch chuyển của các bán khung là nhỏ xác định bởi sự tương tác của bánh lốp với cấu trúc nền đất và được đặc trưng bởi các hệ số độ cứng c 1 …c 5 và các hệ số nhớt d 1 …d 5 . Các lực R i , S i và các mô men M Si cản quay vòng có điểm đặt tại các bản lề và các điểm tiếp xúc của bánh lốp với nền đất được mô hình hóa trong môi trường Simulink. Trên hình 2.22 trình bày sơ đồ nguyên lý các liên kết dùng để xây dựng các mô hình của các quá trình quay vòng xe với khung bản lề khớp nối động. Bán khung trước và sau, cũng như thân và cán pistong của xi lanh chấp hành được thể hiện trong SimMechanics bằng khối “Body” là vật thể cứng (khâu riêng biệt của cơ cấu, chuyển động của nó được mô hình hóa) với các tham số xác định. Hình 2.21 Sơ đồ tính toán quay vòng xe với khung bản lề khớp nối động. Hình 2.22. Sơ đồ nguyên lý các liên kết dùng để xây dựng mô hình – Simulink quá trình quay vòng xe có khung bản lề khớp nối động."
    },
    {
      "id": "2.3.2",
      "title": "Mô tả các phần tử của xe.",
      "content": "2.3.2 Mô tả các phần tử của xe. Các tham số đầu vào gồm có: Khối lượng vật thể có thể biểu diễn bằng nhiều đơn vị khác nhau; Tenxơ quán tính của vật thể tương đối với trọng tâm của nó thể hiện dưới dạng ma trận cơ 3x3: (2.59) Trong đó J ix , J iy , J iz – các mô men quán tính hướng trục của vật thể tương đối với các trục hệ tọa độ con gắn với tâm khối của nó; Các tọa độ đề các của các điểm đặc trưng gắn với vật thể. Trong một số trường hợp cần chỉ rõ các tọa độ tâm khối của vật thể và các tọa độ các điểm đặc trưng khác như tâm các bản lề gắn với vật thể hoặc các điểm đặt của các lực và mô men ngoại lực; Chỉ ra tên của hệ tọa độ (điểm đặc trưng), từ điểm gốc hệ tọa độ là tọa độ của các điểm đặc trưng; Thường thì ít nhất có một điểm đặc trưng (điểm bất kỳ trong đó có thể là tâm khối của vật thể) là điểm cho trước trong hệ tọa độ WORLD, hoặc trong hệ tọa độ ADJOINING để gắn vật thể đó với vật thể cố định hoặc di động bên cạnh. Hệ tọa độ WORLD – đây là hệ tọa độ quán tính cố định gắn với trái đất, còn hệ tọa độ ADJOINING gắn với bản lề liên kết với vật thể; Véc tơ các góc quay của các hệ tọa độ (các điều kiện ban đầu). Các trục tọa độ của hệ tọa độ bất kỳ trong SimMechanics ứng với hệ tọa độ Euler bên phải. Các điểm đặc trưng của bán khung trước: O 0 , O 1 – các điểm gắn với bánh lốp của bán khung phía trước, bánh lốp sẽ đứng yên và đóng vai trò tâm quay khi xe quay vòng. Điểm này cũng là điểm góc hệ tọa độ quán tính và hệ tọa độ con gắn với bán khung phía trước của xe; D 1 – điểm gắn với bánh di động của bán khung phía trước, liên kết qua bản lề “Planar” với đất, A – trọng tâm của bán khung phía trước, O 3 – điểm cố định thân xi lanh thủy lực qua bản lề “Revolute” với bán khung; O 2 – bản lề khớp động của bán khung phía trước và phía sau và là gốc tọa độ của hệ tọa độ con gắn với bán khung phía sau. Các điểm đặc trưng của bán khung phía sau: D 2 , D 3 – các điểm tiếp xúc của bánh lốp sau với đất, B – tâm khối của bán khung phía sau, O 2 – bản lề khớp động của bán khung phía trước và phía sau, O 4 – điểm cố định cán xi lanh thủy lực qua bản lề “Revolute” với bán khung. Các điểm đặc trưng của xi lanh thủy lực: O 3 , O 4 – các điểm cố định xi lanh thủy lực với bán khung phía trước và phía sau. Đối với khối «Ground» (trụ đỡ) cần biểu diễn véc tơ tọa độ [X,Y,Z] của một điểm cố định của cơ cấu tương đối với hệ tọa độ quán tính gắn với trái đất, véc tơ lực trọng trường dạng [X,Y,Z]; kích thước của cơ cấu; phương pháp pháp phân tích; kiểu thiết bị giới hạn; dung sai tuyến tính; thiết lập / hủy theo dõi /94/. Đối với bản lề cần biểu diễn các trục, mà dọc theo các trục đó diễn ra chuyển động tịnh tiến của các phần tử và các trục mà xung quanh nó xảy ra chuyển động quay, cũng như số lượng các phần tử bổ sung để liên kết «Joint Actuator», «Joint Sensor» và phần tử nhớt – đàn hồi /94/. Đối với khối “Joint Actuator” cần biểu diễn kiểu tương tác kích thích: lực tương tác hoặc chuyển động. Đối với chuyển động kích thích tại đầu vào của khối «Joint Actuator» chuyển động của các phần tử phải được biểu diễn dưới dạng tín hiệu véc tơ kiểu Simulink [độ dịch chuyển; vận tốc; gia tốc]. Đối với khối “Joint Sensor” cần biểu diễn kiểu tín hiệu đầu ra, tín hiệu này có thể là góc quay vòng một phần của đối tượng quay liên kết nối tiếp với vật thể tiếp theo; vận tốc góc tương đối; gia tốc góc tương đối; tổng mô men của các lực gây ra gia tốc góc tương đối; vận tốc tương đối; gia tốc tương đối; hợp lực gây ra gia tốc tương đối; quaternion – véc tơ cấu thành từ bốn phần tử miêu tả vị trí góc tức thời các phần tử vật thể hình cầu; mô men phản lực tương đối với trục của vật thể; phản lực dọc trục vật thể /94/. Đối với khối “Joint Spring & Damper” cần biểu diễn giá trị hệ số đàn hồi c , hệ số ma sát nhớt d và khoảng cân bằng tuyến tính/góc giữa các phần của vật thể chuyển động /94/."
    },
    {
      "id": "2.3.3",
      "title": "Mô hình toán học lực cản trong vùng tiếp xúc của bánh lốp với mặt phẳng sinh ra trong quá trình quay vòng xe.",
      "content": "2.3.3 Mô hình toán học lực cản trong vùng tiếp xúc của bánh lốp với mặt phẳng sinh ra trong quá trình quay vòng xe. Sự ảnh hưởng của môi trường bên ngoài đến quá trình quay vòng xe thể hiện bởi các lực và các mô men bên ngoài tác động lên bán khung của xe, các lực này đặt tại điểm tiếp xúc của bánh lốp với mặt đất. Trong mô hình mô phỏng quay vòng đã trình bà, tương tác của các bánh lốp với mặt đất được mô hình hóa nhờ bản lề “Planar” có hai chuyển động tịnh tiến và một chuyển động quay. Vì vậy để tính toán lực quay vòng tác dụng lên cán pistong của xi lanh chấp hành cần biểu diễn các phản lực của mặt đường tác dụng lên bánh lốp theo chiều dọc và ngang để khảo sát chuyển động tịnh tiến, và biểu diễn các mô men cản bánh lốp để khảo sát chuyển động quay. Để tính toán các lực kích thích trên cán xi lanh cần biểu diễn các tọa độ nền đất trong vùng làm việc của Matlap đã được tạo ra trước (2.22). Phản lực dọc của mặt đất tác dụng lên bánh lốp được xác định theo công thức /97/: (2.60) Trong đó G i – tải trọng đặt tại bánh lốp; hệ số sử dụng trọng lượng bám. Các đường cong hệ số sử dụng trọng lượng bám phụ thuộc vào độ trượt của bánh lốp máy coong trình có thể biểu diễn bằng cách tính toán lại từ mối quan hệ độ trượt do lực kéo tạo ra. Các đường cong này có thể xấp xỉ bằng các đoạn thẳng /97/. Phản lực ngang tác dụng lên bánh lốp theo giả thuyết Rocar là đúng đối với trường hợp, khi mà các trục của bánh lốp song song với mặt đường và được tính theo công thức: S i = K У i .G i (2.61) Trong đó K У i – hệ số cản riêng độ lệch ngang của bánh lốp đàn hồi. Giá trị hệ số cản độ lệch ngang của bánh lốp phụ thuộc vào góc lệch của các bánh lốp cặp thứ i và hệ số trượt, cũng như mối quan hệ chất lượng bám của bánh lốp theo chiều dọc và ngang. Mô men cản quay vòng bánh lốp xác định theo công thức /79/: M Si = M 1 +M 2 (2.62) Trong đó M 1 – mô men cản phát sinh do ma sát giữa bề mặt tựa của các bánh lốp và mặt đất; M 2 – mô men cản phát sinh bởi sự dịch chuyển của đất do lực ngang tác dụng vào bánh lốp và độ bám đất. Mô men cản phát sinh do ma sát giữa bề mặt tựa của bánh lốp và mặt đất xác định theo công thức /97/: (2.63) Trong đó hệ số ma sát của bánh lốp với đất; a – độ dài phần bánh lốp tiếp xúc với đất; b – chiều rộng phần bánh lốp tiếp xúc với đất; áp suất trong vùng tiếp xúc của bánh lốp với bề mặt tựa. (2.64) (2.65) P Ш – áp suất trong bánh lốp; z – chỉ số bậc tự do; A – chỉ số độ cứng. Mô men cản phát sinh bởi sự dịch chuyển của đất do lực ngang tác dụng vào bánh lốp và độ bám của đất xác định theo công thức thực nghiệm /97/: M 2 = k.r K .h 2 (0,32 +0,5.h 0,35 ) (2.66) Trong đó k – hệ số phụ thuộc vào độ đàn hồi bánh lốp; r K – bán kính tự do của bánh lốp; h – độ lún của bánh lốp. Như vậy các biểu thức (2.60…2.66) cho phép mô tả các lực và mô men cản phát sinh trong vùng tiếp xúc của bánh lốp với mặt đất, chúng được dùng với vai trò là các tín hiệu đầu vào khi xây dựng mô hình mô phỏng quá trình quay vòng xe. Các hệ số thay đổi trong các biểu thức (2.60…2.66) trong môi trường Simulink được mô hình hóa bằng cách ra tín hiệu đo theo quy luật đã biết hoặc theo quy luật ngẫu nhiên. 2.3.4. Mô hình tổng quát mô phỏng và quan sát quá trình quay vòng. Sau khi nhập tất cả các tham số cần thiết của các khối SimMechanics và liên kết chúng ứng với sơ đồ nguyên lý các mối liên hệ (xem hình 2.22) chúng ta thu được mô hình tổng quát quay vòng xe trong môi trường SimMechanics trình bày trên hình 2.23. Mô hình hoạt động theo nguyên lý sau đây: Tín hiệu dịch chuyển cán pistong từ mô hình dẫn động thủy lực (tham số ra của xi lanh thủy lực x ) truyền đi nhờ khối Joint Actuator liên kết với bản lề, đảm bảo bậc tự do chuyển động tịnh tiến của cán pistong và thân xi lanh thủy lực tương đối với trục xi lanh thủy lực. Chuyển động của cán pistong và thân xi lanh thủy lực truyền qua các bản lề quay O 3 và O 4 đến các bán khung và xe chuyển hướng chuyển động tương đối với các bản lề quay O 1 và O 2 . Tuy nhiên trong quá trình quay vòng xe tại các vùng tiếp của bánh lốp với bề mặt đất làm phát sinh các lực và mô men cản do ma sát, độ lệch ngang, áp suất trong các bánh lốp v.v., sinh ra. Vì vậy các phản lực ngang của đất tác dụng lên bánh lốp phải được biểu diễn thể hiện hai chuyển động tịnh tiến của bản lề “Planar” liên kết các điểm đặc trưng của xe D 1 …D 3 với đất thông qua các khối “Joint Actuator”, và thêm mô men cản quay vòng của các bánh lốp để biểu diễn chuyển động quay. Tương tác nhớt đàn hồi của các bánh lốp với cấu trúc nền đất được mô hình hóa bằng các vật thể Focht. Tín hiệu tạo ra các tọa độ của cấu trúc nền đất từ mô hình các tương tác ngẫu nhiên được đưa vào để thể hiện dạng chuyển động tịnh tiến của các bản lề “Planar” thông qua các khối “Joint Actuator”. Các vật thể Focht biến đổi tín hiệu này thành các lực kích thích bổ sung trong các bản lề “Planar”. Hình 2.23 Mô hình quá trình quay vòng xe có bản lề khớp động trong môi trường SimMechanics Như vậy các lực phát sinh trên cán các xi lanh chấp hành trong quá trình quay vòng xe có kể tới yếu tố động học của xe có bản lề khớp nối động được mô phỏng. Các lực này cố định bởi các khối “Joint Sensor” liên kết với các bản lề mô hình hóa chuyển động tương đối với nhau giữa cán và thân xi lanh thủy lực. Khối “Joint Sensor” chuyển đổi tín hiệu dạng cơ SimMechanics thành tín hiệu thông thường Simulink, tín hiệu thông thường này đi vào mô hình dẫn động thủy lực đến đầu vào xi lanh thủy lực và đóng vai trò là tham số đầu vào R CIL . Nhờ khối “Joint Sensor” liên kết với bản lề của khớp nối động của bán khung, có thể thể hiện góc quay vòng của bán khung tương đối với nhau Θ 2 . Một trong các ưu điểm của gói SimMechanics là có thể quan sát chuyển động của xe và các cơ cấu được mô phỏng. Chuyển động của các cơ cấu có thể có thể quan sát trong quá trình mô hình hóa trong một cửa sổ đặc biệt của SimMechanics. Ưu điểm của phương án này là người dùng không mất nhiều thời gian để tạo ra một mô hình thực tế ảo, mô tả đặc điểm hình học của vật thể và các mối liên kết của chúng, tạo các kịch bản hình ảnh động khác nhau v.v. Tất cả các khả năng này đã được thiết kế và tích hợp sẵn trong SimMechanics /94/. Các vật thể của cơ cấu trong cử sổ quan sát có thể được biểu diễn bằng hai cách: 1) dưới dạng các mặt phẳng liên kết các điểm đặc trưng của vật thể; 2) dưới dạng hình elip, vị trí và kích thước của chúng phụ thuộc vào vị trí của các tâm khối của vật thể và các tính chất khối lượng – quán tính của chúng /94/. Ngoài ra để lấy các điểm đặc trưng của một dạng hình ảnh xác định có thể sử dụng các kí hiệu đặc biệt. Dấu “ dấu cộng trong đường tròn” dùng để kí hiệu tâm khối của vật thể. Dấu “gốc tọa độ” dùng để thể hiện tất cả các điểm đặc trưng còn lại CS, vị trí của chúng được cho trước trong cửa sổ xây dựng khối Body /94/. Các đoạn trực quan quá trình quay vòng xe tại điểm đầu và điểm cuối, tức là góc kết hợp của các bán khung bằng không hay cực đại được thể hiện trên hình 2.24. Hình 2.24 Các đoạn thể hiện trực quan quá trình quay vòng xe. Như vậy mô hình tổng quát quay vòng xe thể hiện các dấu hiệu cơ bản của các xe công trình bánh lốp có khung bản lề khớp động và có thể dùng để mô hình hóa các xe khác nhau dạng này bằng cách thay các số liệu ban đầu: tọa độ các điểm đặc trưng, giá trị khối lượng và mô men quán tính của bán khung, các lực và các mô men cản phát sinh trong vùng tiếp xúc của các bánh lốp với bề mặt đường trong quá trình quay vòng xe. Kết luận chương: 1. Trên cơ sở sơ đồ thủy lực và sơ đồ tính toán ta đã xây dựng sơ đồ khối của hệ thống thủy lực điều khiển lái, mỗi khối của sơ đồ ứng với một phần tử cùng tên và là phần tử thủy lực đa cực. 2. Trên cơ sở sơ đồ khối xây dựng theo nguyên lý cấu trúc mô hình toán và các phương trình vi phân miêu tả các phần tử của hệ thống ta thiết lập sơ đồ cấu trúc của dẫn động thủy lực điều khiển lái và thể hiện trong môi trường Matlab – Simulink. 3. Chuyển động của vỏ và van trượt của bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái được miêu tả bằng các đặc trưng tĩnh phi tuyến. 4. Các phần tử của dẫn động thủy lực được mô hình hóa bằng cách thiết lập sơ đồ cấu trúc từ các khối Simulink và bằng các phương trình vi phân miêu tả chuyển động của chúng. Ưu điểm của phương pháp này là độ chính xác cao và khả năng thay đổi mọi tham số của phần tử. 5. Xây dựng mô hình các tác động kích thích ngẫu nhiên thể hiện sự ảnh hưởng của môi trường bên ngoài tác động lên hệ thống điều khiển lái trong môi trường Matlab. 6. Thiết lập sơ đồ tính toán quay vòng xe có khung bản lề khớp nối động, cũng như sơ đồ nguyên lý các mối liên hệ của các phần tử của xe để xây dựng mô hình mô phỏng. Mô hình quay vòng cho phép mô hình hóa cụ thể các lực quy dẫn về cán xi lanh chấp hành, các lực này phát sinh trong quá trình quay vòng xe, các lực này phát sinh từ lực cản trong vùng tiếp xúc của bánh xe với mặt đường và các quá trình ngẫu nhiên khi các bánh lốp tương tác với nền đất. 7. Động lực học quay vòng xe được mô hình hóa trong thư viện SimMechanics dùng để mô hình hóa chuyển động của các vật rắn. Mô hình quay vòng xe là công cụ mô phỏng cho phép mô hình hóa quá trình quay vòng các xe công trình bánh lốp khác nhau có khung bản lề khớp nối động bằng cách thay các số liệu đầu vào của khối SimMechanics. 3. Các nghiên cứu lý thuyết hệ thống thủy lực điều khiển lái. Mục đích của các nghiên cứu lý thuyết là phân tích và tổng hợp hệ thống thủy lực điều khiển lái trên cơ sở mô hình toán học điều khiển lái máy xây dựng bao gồm mô hình tác động kích thích ngẫu nhiên và mô hình mô phỏng quá trình quay vòng xe có khung bản lề khớp nối động."
    },
    {
      "id": "3.1",
      "title": "Phân tích hệ thống thủy lực điều khiển lái.",
      "content": "3.1 Phân tích hệ thống thủy lực điều khiển lái. Các tác động kích thích và điều khiển tác động đến hệ thống thủy lực điều khiển lái làm cho hệ thống mất cân bằng và phát sinh các quá trình thủy lực chuyển tiếp. Để giải quyết các bài toán đặt ra cần làm rõ các yếu tố ảnh hưởng đến việc hình thành các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái, xác định mức độ ảnh hưởng của chúng và xác định sự phụ thuộc giữa các tham số của các quá trình thủy lực chuyển tiếp bằng các chỉ số chất lượng đặc trưng, các tham số kết cấu của đối tượng nghiên cứu. Việc phân tích hệ thống thủy lực điều khiển lái được thực hiện theo các giai đoạn sau: Phân tích các yếu tố ảnh hưởng đến việc hình thành các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái; Xác định các tham số thay đổi của các phần tử của cơ cấu thủy lực điều khiển lái; Đưa ra các giá trị số của các tham số cố định; Đưa ra các biên độ và các khoảng thay đổi của các tham số phân tích; Giải mô hình toán trên máy tính; Phân tích ảnh hưởng của các tham số phân tích lên các đặc trưng đầu ra của hệ thống."
    },
    {
      "id": "3.1.1",
      "title": "Các yếu tố ảnh hưởng đến việc hình thành các quá trình chuyển tiếp trong hệ thống và mức ảnh hưởng của chúng.",
      "content": "3.1.1 Các yếu tố ảnh hưởng đến việc hình thành các quá trình chuyển tiếp trong hệ thống và mức ảnh hưởng của chúng. Chúng ta đã biết, các phân tích động lực học các hệ thống thủy lực chỉ ra rằng các yếu tố cơ bản ảnh hưởng đến việc hình thành các quá trình thủy lực chuyển tiếp chính là các tác động kích thích và các yếu tố quy định các tính chất của hệ thống “người – xe – môi trường xung quanh” /37/. Các tác động kích thích có thể là các tác động bên trong hoặc bên ngoài. Các tác động bên ngoài có thể là tình trạng của mặt đất mà xe di chuyển trên đó (Ф1), yếu tố này gây ra ảnh hưởng đáng kể đến việc hình thành các quá trình chuyển tiếp trong hệ thống thủy lực khi phần vận hành tương tác với mặt đường không bằng phẳng. Các tác động bên trong có thể nói đến là toàn bộ các hiện tượng thủy cơ diễn ra bên trong hệ thống hình thành và phát triển theo thời gian và theo không gian, do sự di chuyển không ổn định của dòng chất lỏng công tác /37/. Các yếu tố chính có thể kể ra dưới đây: Cấu trúc của hệ thống thủy lực (Ф 2 ); Các tham số của các tác động kích thích: phần tử của hệ thống dẫn động thủy lực hình thành lên quá trình chuyển tiếp (điểm đặt tác động kích thích) (Ф 3 ), cương độ (Ф 4 ) và kiểu kích thích (Ф 5 ); Các tính chất cơ lý của các phần tử dẫn động thủy lực (Ф 6 ); Các tính chất vật lý của chất lỏng công tác (Ф 7 ); Sự hình thành các yếu tố của quá trình chuyển tiếp được quy định bởi các tính chất của hệ thống “người – xe – môi trường xung quanh”. Với phương pháp tiếp cận nghiên cứu một cách hệ thống chúng ta nêu ra một số tính chất sau đây có ảnh hưởng đáng kể đến việc hình thành quá trình chuyển tiếp: Các tính chất ảnh hưởng từ phía người lái – trình độ chuyên môn và các kỹ năng tự nhiên (Ф 8 ), tình trạng tâm sinh lý và sức khỏe trong quá trình làm việc (Ф 9 ); Các tính chất của hệ thống thủy lực điều khiển lái và các phần tử của nó các đặc điểm sơ đồ và cấu trúc của dẫn động thủy lực và các phần tử của nó (Ф 10 ), các tham số năng lượng và các đặc điểm kết cấu của phần động lực (Ф 11 ), tình trạng kỹ thuật các phần tử của xe trong quá trình khai thác (Ф 12 ); Các tính chất của đối tượng lao động và môi trường xung quanh – các đặc điểm về vấn đề tổ chức và công nghệ tiến hành công việc (Ф 13 ), các điều kiện khí hậu và thời tiết (Ф 14 ). Cơ sở để thiết lập mô hình toán là mô hình các tham số của quá trình chuyển tiếp có thể được biểu diễn bởi mô hình liên kết các yếu tố phản ánh mối liên hệ giữa chúng đến việc hình thành quá trình chuyển tiếp (hình 3.1). Hình 3.1 Mô hình liên kết các yếu tố hình thành quá trình chuyển tiếp trong các hệ thống thủy lực điều khiển lái. Trên cơ sở phân tích các mối liên hệ nhân quả cho thấy sự phức tạp của chúng, sự phụ thuộc lẫn nhau, không có các quy luật tác động rõ ràng, từ đó gây khó khăn cho việc phân loại mức ảnh hưởng của chúng. Vì vậy việc giải quyết bài toán phân tích các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái xét một cách tổng quát là rất khó khăn. Vấn đề chính ở đây là số lượng tương đối lớn các yếu tố gây ảnh hưởng đến quá trình hoạt động của máy công trình. Việc phân tích mô hình liên kết các tham số đã trình bày cho thấy rằng ảnh hưởng lớn nhất đến việc hình thành các quá trình chuyển tiếp là các đặc điểm kết cấu của hệ thống thủy lực, do sự ảnh hưởng trực tiếp của nhiều yếu tố đến quá trình chuyển tiếp lại thông qua các yếu tố khác. Các yếu tố ảnh hưởng khác có thể kể đến là các tác động điều của người lái, các tính chất cơ – lý của đối tượng lao động, các điều kiện khai thác, các điều kiện khí hậu thời tiết. Như vậy cần làm rõ các quy luật cơ bản của các quá trình diễn ra trong hệ thống thủy lực điều khiển lái với các giá trị tham số kết cấu khác nhau của cơ cấu thủy lực điều khiển lái."
    },
    {
      "id": "3.1.2",
      "title": "Phân tích các tham số kết cấu của cơ cấu thủy lực điều khiển lái.",
      "content": "3.1.2 Phân tích các tham số kết cấu của cơ cấu thủy lực điều khiển lái. Cần nhấn mạnh rằng hệ thống con cơ bản điều khiển lái của máy công trình là hệ thống thủy lực điều khiển lái, cấu tạo gồm: cụm cơ cấu thủy lực điều khiển lái và các hệ thống con của bộ phân phối thủy lực và động cơ thủy lực tín hiệu ngược, vì vậy đầu tiên cần đánh giá đầy đủ sự ảnh hưởng của các tham số kết cấu của các phần tử này đến các tham số ra đặc trưng của hệ thống thủy lực điều khiển lái. Phân tích sơ đồ kết cấu và các biểu thức mô tả bộ phân phối thủy lực cho phép xác định rõ các tham số thay đổi sau đây: các đường kính lỗ của dãy động cơ thủy lực của bộ phân phối thủy lực d 0 , các góc vùng không nhạy của bộ phân phối thủy lực γ , diện tích thiết diện thông qua các rãnh giảm tải của bơm trong bộ phân phối thủy lực f SL . Các tham số kể trên ảnh hưởng lớn đến việc hình thành các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái, bởi vì chúng tham gia vào quá trình điều chỉnh các tham số ra của cơ cấu thủy lực điều khiển lái, tức là chúng chi phối tín hiệu ngược. Các tham số kết cấu còn lại của bộ phân phối trình bày trong mục 1.4 chỉ có ý nghĩa điều tiết chất lỏng công tác. Phân tích các biểu thức mô tả động cơ thủy lực tín hiệu ngược cho phép làm rõ tham số biến đổi thể tích công tác q ."
    },
    {
      "id": "3.1.3",
      "title": "Dự kiến thực nghiệm tính toán.",
      "content": "3.1.3 Dự kiến thực nghiệm tính toán. Lựa chọn các tác động điều khiển. Xác định các giới hạn biến đổi đối với từng tham số phân tích, xác định bước biến thiên. Xác định các giới hạn ổn định đối với các tham số biến đổi tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Xây dựng các đặc trưng chuyển tiếp của giá trị đầu ra tại các giá trị khác nhau của góc nghiêng vùng không nhạy của bộ phân phối thủy lực. Xây dựng mối quan hệ của các chỉ số chất lượng các quá trình chuyển tiếp với giá trị góc vùng không nhạy cảm tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Xây dựng các đặc trưng chuyển tiếp của giá trị tham số đầu ra tại các giá trị diện tích thiết diện khác nhau của các rãnh giảm tải trong bộ phân phối thủy lực. Xây dựng mối quan hệ giữa các chỉ số chất lượng của các quá trình chuyển tiếp với giá trị diện tích thiết diện thông qua của các rãnh giảm tải tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Đưa ra cá kết luận chính và đề xuất sử dụng các tham số kết cấu."
    },
    {
      "id": "3.1.4",
      "title": "Tác động điều khiển.",
      "content": "3.1.4 Tác động điều khiển. Hệ thống thủy lực điều khiển lái là hệ thống tự động điều chỉnh đặc biệt có mạch tín hiệu ngược. Vì vậy việc phân tích toàn diện các quá trình diễn ra trong hệ thống cả khi mở dẫn động thủy lực, tức là khi hệ thống hoạt động ở chế độ làm việc thông thường và khi tắt dẫn động thủy lực, tức là khi ngừng tác động điều khiển lên tay lái. Chính vì vậy phải cần đến hai tác động điều khiển: một là tín hiệu vận tốc quay tay lái (hình 3.2), cho phép xác định được các quá trình chuyển tiếp khi mở dẫn động thủy lực và đánh giá các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái khi coi động cơ thủy lực tín hiệu ngược như khâu điều chỉnh. Tín hiệu thứ hai là tín hiệu quay vòng tay lái (hình 3.3) cho phép xác định các quá trình chuyển tiếp khi tắt dẫn động thủy lực, tức là khi động cơ thủy lực tín hiệu ngược tác dụng lên vỏ bộ phân phối thủy lực để đóng các rãnh của dãy động cơ thủy lực khi thôi tác động điều khiển. Hình 3.2. Các tác động điều khiển dùng để phân tích các quá trình chuyển tiếp khi mở dẫn động thủy lực. Hình 3.3. Tác động điều khiển dùng để phân tích các quá trình chuyển tiếp khi tắt dẫn động thủy lực."
    },
    {
      "id": "3.1.5",
      "title": "Các giới hạn và khoảng biến thiên các tham số phân tích.",
      "content": "3.1.5 Các giới hạn và khoảng biến thiên các tham số phân tích. Phân tích bộ phân phối thủy lực được sản xuất trong nước và nhập khẩu cho thấy rằng, giá trị đường kính các lỗ của dãy động cơ thủy lực nằm trong khoảng từ 2,8 đến 3,6 mm, vì vậy để thể hiện đầy đủ các quá trình thủy cơ diễn ra trong hệ thống, chúng ta tiến hành phân tích các quá trình chuyển tiếp của giá trị đầu ra tại các giá đường kính các lỗ của dãy động cơ thủy lực như sau: d 1 = 2,6 mm; d 1 = 2,8 mm; d 1 = 3 mm; d 1 = 3,3 mm; d 1 = 3,6 mm; d 1 = 3,8 mm. Giá trị các góc nghiêng vùng không nhạy của bộ phân phối thủy lực nằm trong khoảng từ 0,035 đến 0,07 rad, trong công trình nghiên cứu sẽ tiến hành phân tích các quá trình chuyển tiếp giá trị đầu ra tại cá giá trị sau: γ 1 = 0,01 rad; γ 1 = 0,02 rad; γ 3 = 0,035 rad; γ 4 = 0,05 rad; γ 5 = 0,07 rad; γ 6 = 0,085 rad. Giá trị diện tích thiết diện thông qua của các rãnh giảm tải nằm trong khoảng từ 0,6.10 -4 và lớn hơn. Để phân tích chúng ta lựa chọn các giá trị diện tích thiết diện các rãnh giảm tải hư sau: f SL1 = 0,5∙10 -4 m 2 ; f SL2 = 0,75∙10 -4 m 2 ; f SL3 = 10 -4 m 2 ; f SL4 = 1,25∙10-4 10 -4 ; f SL5 = 1,5∙10 -4 m 2 . Các loại bơm nhông bánh răng trong của cơ cấu thủy lực điều khiển lái được chế tạo theo loạt với các thể tích công tác cơ bản: q 1 = 80∙10 -6 m 3 ; q 1 = 125∙10 -6 m 3 ; q 1 = 160∙10 -6 m 3 ; q 1 = 200∙10 -6 m 3 ; q 1 = 250∙10 -6 m 3 . Vì vậy các giá trị thể tích công tác kể trên là các giá trị đầu vào dùng để phân tích hệ thống thủy lực điều khiển lái."
    },
    {
      "id": "3.1.6",
      "title": "Tính ổn định hệ thống thủy lực điều khiển lái.",
      "content": "3.1.6 Tính ổn định hệ thống thủy lực điều khiển lái. Vì hệ thống thủy lực điều khiển lái là hệ thống điều chỉnh tự động, trong đó có mạch tín hiệu ngược, nó đáp ứng đầy đủ các yêu cầu đặt ra đối với các hệ thống tự động điều chỉnh, trong số đó yêu cầu về đảm bảo tính ổn định của hệ thống. Trong nhiều công trình nghiên cứu về dẫn động thủy lực điều khiển lái đã công bố /36, 57, 58/ đã trình bày các nghiên cứu hiện tượng tự dao động trong hệ thống ở chế độ làm việc xác định. Các nghiên cứu chỉ ra rằng giá trị góc nghiêng vùng không nhạy cảm của bộ phân phối thủy lực ảnh hưởng đến sự phát sinh hiện tượng tự dao động, vùng này được gọi là “vùng chết”, vùng này càng nhỏ hệ thống càng có xu hướng phát sinh tự dao động. Tuy nhiên nếu chỉ xem xét hiện tượng tự dao động trong nghiên cứu về tính ổn định của hệ thống là không đủ, bởi vì quá trình này mang tính ngẫu nhiên và có nhiều yếu tố ảnh hưởng đến nó mà trong phạm vi công trình này không đề cập đến. Trong công trình nghiên cứu này chỉ tiến hành đánh giá tính ổn định khi mở (hệ thống hoạt động ở chế độ xác định) và khi đóng dẫn động thủy lực (khi ngừng tác động lên tay lái), đồng thời làm rõ vùng ổn định của hệ thống. Khi đóng dẫn động thủy lực các yếu tố sau đây ảnh hưởng đến tính ổn định của hệ thống /36, 58/: Dạng đặc tính tĩnh phi tuyến của bộ phân phối thủy lực; Độ cứng của tuyến ống dẫn; Lượng khí không hòa tan trong chất lỏng công tác; Khối lượng quy dẫn về cán xi lanh chấp hành. Sự ảnh hưởng độ cứng của tuyến ống dẫn đến tính ổn định của hệ thống không được xem xét ở đây, vì độ dài các đoạn ống mềm của tuyến ống dẫn lắp trên xe không đáng kể, làm cho độ dịch chuyển của xi lanh chấp hành không nhiều. Khối lượng quy dẫn về cán xi lanh thủy lực được tính đến trong mô hình mô phỏng quay vòng xe. Cơ cấu thủy lực điều khiển lái có các phần tử phi tuyến như vỏ và van trượt của bộ phân phối thủy lực, vì vậy nó có thể gọi là hệ thống phi tuyến và dạng đặc tính phi tuyến tính của bộ phân phối thủy lực ảnh hưởng đáng kể đến tính ổn định của hệ thống thủy lực điều khiển lái. Dạng đặc tính phi tuyến tĩnh quy định các tham số sau của bộ phân phối thủy lực: các góc của vùng không nhạy cảm và đường kính các thiết diện thông qua của các rãnh của dãy động cơ thủy lực. Các nghiên cứu chỉ ra rằng khi đóng hệ thống dẫn động thủy lực điều khiển lái giá trị đường kính các lỗ của dãy thủy lực ảnh hưởng đến tính ổn định của hệ thống thủy lực điều khiển lái, còn khi tắt – các góc đậy dương của bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái. Trên hình"
    },
    {
      "id": "3.4",
      "title": "Phần mềm tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái.",
      "content": "3.4 trình bày các quá trình chuyển tiếp vận tốc dịch chuyển cán xi lanh chấp hành khi đóng dẫn động thủy lực tại các giá trị đường kính khác nhau của các lỗ dãy động cơ thủy lực. Từ đồ thị cho thấy rõ sự ảnh hưởng của giá trị đường kính của các lỗ dãy động cơ thủy lực đến tính ổn định của hệ thống. Vì vậy việc nghiên cứu tính ổn định của hệ thống tại các giá trị đường kính d 1 …d 6 là rất ý nghĩa. Không có phương pháp vạn năng nào có thể dùng để nghiên cứu tất cả các hệ thống phi tuyến. Chỉ có các phương pháp phù hợp hay hợp lý dùng để nghiên cứu một dạng bài toán xác định. Hình 3.4. Các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái khi mở dẫn động tại giá trị đường kính các lỗ khác nhau của dãy động cơ thủy lực. Đánh giá tính ổn định của hệ thống phi tuyến được tiến hành bằng phương pháp quỹ đạo pha. Phương pháp quỹ đạo pha dựa trên việc xây dựng và nghiên cứu bức tranh chung của pha (toàn bộ quỹ đạo pha), vì đánh giá tính ổn định của hệ thống thông qua bức tranh này. Việc xây dựng và thể hiện trực quan quỹ đạo pha có thể tiến hành trên mặt phẳng pha, là hệ tọa độ phẳng, trong đó trục hoành là giá trị biến thiên nào đó xác định trạng thái của hệ, còn trục tung là giá trị bất kỳ /36, 58, 65/. Quỹ đạo pha dịch chuyển cán xi lanh chấp hành hệ thống thủy lực điều khiển lái khi mở dẫn động với thể tích công tác của động cơ thủy lực tín hiệu ngược ví dụ q 1 = 80.10 -6 m 3 và đường kính các lỗ của dãy động cơ thủy lực d 4 = 3,3 mm và d 6 = 3,8 mm được trình bày trên hình 3.5 và 3.6. Quỹ đạo pha dịch chuyển cán xi lanh chấp hành hệ thống thủy lực điều khiển lái khi mở dẫn động với thể tích công tác của động cơ thủy lực tín hiệu ngược ví dụ q 3 = 160.10 -6 m 3 và đường kính các lỗ của dãy động cơ thủy lực d 1 = 2,6 mm và d 6 = 3,8 mm được trình bày trên hình 3.7 và 3.8. Hình 3.5. Ví dụ quỹ đạo pha của hệ thống thủy lực điều khiển lái khi mở dẫn động tại giá trị đường kính lỗ dãy động cơ thủy lực d 4 = 3,3 mm và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.6. Ví dụ quỹ đạo pha của hệ thống thủy lực điều khiển lái khi mở dẫn động tại giá trị đường kính lỗ dãy động cơ thủy lực d 4 = 3,8 mm và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.7 Ví dụ quỹ đạo pha của hệ thống thủy lực điều khiển lái khi mở dẫn động tại giá trị đường kính lỗ dãy động cơ thủy lực d 4 = 2,6 mm và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 160.10 -6 m 3 . Hình 3.8 Ví dụ quỹ đạo pha của hệ thống thủy lực điều khiển lái khi mở dẫn động tại giá trị đường kính lỗ dãy động cơ thủy lực d 4 = 3,8 mm và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 160.10 -6 m 3 . Dựa trên các quỹ đạo pha nhận được có thể đánh giá tính ổn định của hệ thống. Yếu tố là điều kiện đủ để đảm bảo tính ổn định là quỹ đạo pha tại điểm có tọa độ [V; O], tức là tại chế độ hoạt động ổn định đạo hàm giá trị nghiên cứu bằng không. Trong trường hợp nếu hệ thống không ổn định điểm đặc trưng sẽ nằm xa so với điểm có tọa độ [V; 0] và bức tranh pha hệ phi tuyến sẽ tản mát. Phân tích quỹ đạo pha chỉ ra rằng tại các giá trị đường kính lỗ dãy động cơ thủy lực d 6 = 3,8 mm thì với mọi thể tích công tác của động cơ thủy lực tín hiệu ngược hệ thống sẽ mất tính ổn định. Đánh giá các đặc tính ổn định về lượng theo đồ thị pha là rất khó khăn. Trong công trình này đánh giá tính ổn định hệ thống thủy lực điều khiển lái về lượng nhờ hệ số dao động. (3.1) Trong đó V max1 và V max2 – các giá trị độ lệch cực đại liên tiếp của đặc trưng chuyển tiếp so với giá trị thiết lập xác định khi . Như vậy nếu hệ thống ổn định thì hệ số dao động M sẽ nằm trong khoảng từ 0 đến 99%, hệ số dao động sẽ dần tiến tới 0 nếu quá trình chuyển tiếp không tuần hoàn và ứng với nó là hệ thống sẽ tuyệt đối ổn định. Vì vậy cần đánh giá sự ảnh hưởng giá trị đường kính lỗ dãy động cơ thủy lực đến hệ số dao động và xác định và xác định vùng ổn định của hệ thống đối với từng giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược. Trên hình 3.9 trình bày sự phụ thuộc hệ số dao động và giá trị đường kính lỗ dãy động cơ thủy tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược q 1 …q 5 . Phân tích mối quan hệ trình bày ở trên chỉ ra rằng, khi tăng đường kính lỗ dãy động cơ thủy lực hệ số dao động sẽ tăng lên tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược và dẫn tới giảm hệ số dự trữ ổn định, thêm vào đó khi giảm thể tích công tác động cơ thủy lực tín hiệu ngược giới hạn ổn định sẽ đạt được ở các giá trị đường kính lớn. Ở thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 hệ thống là ổn định với các giá trị đường kính lỗ của dãy động cơ thủy lực dưới 37,88.10 -4 mm, tại giá trị q 2 – dưới 37.56.10 -4 mm, tại giá trị q 3 – dưới 37,28.10 -4 mm, tại giá trị q 4 – dưới 36,92.10 -4 mm, tại giá trị q 5 – dưới 36,34.10 -4 mm. Hình 3.9. Mối quan hệ hệ số dao động với giá trị đường kính lỗ dãy động cơ thủy lực tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược q 1 ...q 5 . Như vậy khi tiếp tục phân tích sự ảnh hưởng các đường kính lỗ của dãy động cơ thủy lực lên đặc tính của hệ thống thủy lực điều khiển lái giá trị với d 5 = 3,6 mm sẽ là giới hạn biến thiên trên, bởi vì tại các giá trị d 5 lớn, hệ thống mất ổn định khi đóng dẫn động thủy lực. Tuy nhiên hệ thống có thể mất trạng thái ổn định nếu tắt dẫn động thủy lực. Trên hình 3.10 trình bày các quá trình chuyển tiếp vận tốc dịch chuyển cán xi lanh chấp hành khi tắt dẫn động thủy lực với các giá trị khác nhau của góc vùng không nhạy cảm của bộ phân phối thủy lực và tại giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Đánh giá đặc tính chuyển tiếp đã trình bày, các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực ảnh hưởng đáng kể đến tính ổn định của hệ thống, đặc biệt tại các giá trị thể tích lớn của động cơ thủy lực tín hiệu ngược, vì vậy mà phải nghiên cứu tính ổn định của hệ thống tại các giá trị góc vùng không nhạy cảm khác nhau và hiệu chỉnh vùng biến thiên của tham số này. Hình 3.10 Các quá trình chuyển tiếp của động cơ thủy lực điều khiển lái khi tắt dẫn động thủy lực, với các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 . Các quỹ đạo pha dịch chuyển cán xi lanh chấp hành của hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực, tại giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 và các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực ví dụ với γ 1 = 0,01 rad và γ 4 = 0,05 rad trình bày trên hình 3.11 và 3.12. Với thể tích công tác của động cơ thủy lực tín hiệu ngược q 3 = 160.10 -6 m 3 và cũng với giá trị các góc vùng nhạy cảm bộ phân phối thủy lực ở trên γ 1 và γ 3 ta thu được các đồ thị hình 3.13 và 3.14. Phân tích các quỹ đạo pha cho thấy rằng hệ thống là không ổn định tại các giá trị góc vùng không nhạy cảm nhỏ hơn γ 2 = 0,02 rad với thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 90.10 -6 m 3 , khi tăng thể tích công tác vùng không ổn định giảm xuống. Sự ảnh hưởng vùng không nhạy cảm bộ phân phối thủy lực đến tính ổn định khi tắt dẫn động thủy lực giải thích bằng khả năng vùng không nhạy làm phẳng lỗi điều chỉnh, vùng này càng lớn thì hệ thống càng ổn định. Sự ảnh hưởng của giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược đến tính ổn định được giải thích rằng khi thay đổi thể tích công tác khối ro to thay đổi và lực ma sát trong bơm cũng thay đổi do sự thay đổi độ dài vùng tiếp xúc, và khi tăng thể tích công tác thì rô to của động cơ thủy lực sẽ ít chịu tác động kích thích hơn vì vậy lỗi điều chỉnh sẽ nhỏ hơn và ứng với nó là đòi hỏi vùng không nhạy cảm nhỏ. Hình 3.11 Ví dụ quỹ đạo pha hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với giá trị góc vùng không nhạy cảm γ 1 = 0,01 rad và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.12 Ví dụ quỹ đạo pha hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với giá trị góc vùng không nhạy cảm γ 4 = 0,05 rad và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.13 Ví dụ quỹ đạo pha hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với giá trị góc vùng không nhạy cảm γ 1 = 0,01 rad và thể tích công tác của động cơ thủy lực tín hiệu ngược q 3 = 160.10 -6 m 3 . Hình 3.14. Ví dụ quỹ đạo pha hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với giá trị góc vùng không nhạy cảm γ 4 = 0,05 rad và thể tích công tác của động cơ thủy lực tín hiệu ngược q 3 = 160.10 -6 m 3 . Để đánh giá về lượng tính ổn định của hệ thống thủy lực điều khiển lái và tách ra vùng ổn định ổn định cần xem xét mối quan hệ giữa hệ số dao động và giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược khác nhau q 1 …q 5 (hình 3.15). Hình 3.15 Sự phụ thuộc hệ số dao động vào giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược q 1 …q 5 . Phân tích các mối quan hệ đã trình bày cho thất rằng khi giảm góc vùng không nhạy cảm hệ số dao động sẽ tăng lên, dẫn tới giảm độ dự trữ ổn định, tại các giá trị thể tích công tác động cơ thủy lực tín hiệu ngược lớn vùng không ổn định giảm xuống. Như vậy đối với động cơ thủy lực có thể tích công tác q 1 hệ thống sẽ ổn định tại các giá trị góc vùng không nhạy cảm lớn hơn 1,75.10 -2 rad; với thể tích công tác q 2 – góc vùng không nhạy cảm lớn hơn 0,9.10 -2 rad; với q 3 – 0,5.10 -2 rad; với q 4 – 0,1.10 -2 rad. Với thể tích công tác q 5 hệ thống sẽ ổn định với giá trị góc bất kỳ vùng không nhạy cảm bộ phân phối thủy lực. Như vậy các mối quan hệ đã nghiên cứu cho phép lấy ra vùng ổn định của hệ thống thủy lực điều khiển lái: giá trị góc vùng không ổn định của bộ phân phối thủy lực phải không dưới 1,75.10 -2 rad, do đó giới hạn dưới độ biến thiên tham số này khi phân tích hệ thống sẽ lấy giá trị γ 2 = 0,02 rad, vì với các giá trị góc nhỏ hơn hệ thống sẽ không ổn định khi tắt dẫn động thủy lực. Với các phân tích tính ổn định của hệ thống đã trình bày cho phép đánh giá sự ảnh hưởng đến tính ổn định của hệ thống thủy lực điều khiển lái là các tham số kết cấu của bộ phân phối thủy lực như đường kính các lỗ dãy động cơ thủy lực và góc vùng không nhạy cảm của bộ phân phối thủy lực. Các mối quan hệ của chỉ số tính ổn định về lượng đã trình bày: hệ số độ dao động với giá trị các tham số kết cấu, các tham số tách vùng ổn định của hệ thống trong phạm vi các giá trị nghiên cứu dùng để hiệu chỉnh các giới hạn biến thiên các tham số với mục tiêu đảm bảo độ ổn định của hệ thống."
    },
    {
      "id": "3.1.7",
      "title": "Sự ảnh hưởng các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái đến các chỉ số chất lượng của hệ thống thủy lực điều khiển lái.",
      "content": "3.1.7 Sự ảnh hưởng các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái đến các chỉ số chất lượng của hệ thống thủy lực điều khiển lái. Phân tích sự ảnh hưởng của giá trị đường kính lỗ dãy động cơ thủy lực lên các chỉ số chất lượng và các đặc tính đầu ra của cơ cấu thủy lực điều khiển lái. Để xác định mức ảnh hưởng giá trị đường kính lỗ dãy động cơ thủy lực đến chất lượng tham số ra khi đóng dẫn động thủy lực ta sử dụng các tương tác điều khiển trình bày trên hình 3.2. Các quá trình chuyển tiếp ra tăng lưu lượng chất lỏng công tác tại đầu ra của cơ cấu thủy lực điều khiển lái tại các giá trị đường kính lỗ của dãy động cơ thủy lực d 1 = 2,6 mm; d 2 = 2,8 mm; d 3 = 3 mm; d 4 = 3,3 mm; d 5 = 3,6 mm, nằm trong vùng ổn định của hệ thống với các thể tích công tác của động cơ thủy lực tín hiệu ngược lấy làm ví dụ q 1 = 80∙10 -6 m 3 và q 5 = 250∙10 -6 m 3 trình bày trên hình 3.16 và 3.17. Từ các đồ thị hình 3.16 và 3.17 dễ thấy rằng, các quá trình chuyển tiếp khi đóng dẫn động thủy lực có đặc tính dao động tương đối phức tạp, tuy nhiên cần thu được các mối quan hệ của các chỉ số chất lượng của hệ thống với các giá trị của tham số nghiên cứu tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Sau đây sẽ tiến hành đánh giá các chỉ số chất lượng của hệ thống như sau: Điều chỉnh lại giá trị đầu ra; Thời gian điều chỉnh hoặc thời gian của quá trình chuyển tiếp. Hình 3.16 Các quá trình chuyển tiếp khi đóng dẫn động thủy lực với các giá trị đường kính các lỗ của dãy động cơ thủy lực d 1 …d 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80. 10 -6 m 3 . Hình 3.17. Các quá trình chuyển tiếp khi đóng dẫn động thủy lực với các giá trị đường kính các lỗ của dãy động cơ thủy lực d 1 …d 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 5 = 250.10 -6 m 3 . Sự phụ thuộc thời gian điều chỉnh tín hiệu ra với giá trị đường kính các lỗ của dãy động cơ thủy lực với các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược được trình bày trên hình 3.18. Hình 3.18 Sự phụ thuộc của thời gian điều chỉnh lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái với giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Mối quan hệ trình bày trên hìn 3.18 cho thấy rằng thời gian điều chỉnh tăng lên khi tăng đường kính các lỗ của dãy động cơ thủy lực, điều này giải thích khoảng hẹp giới hạn biên điều chỉnh khi tăng đường kích các lỗ. Ngoài ra thể tích công tác của động cơ tín hiệu ngược ảnh hưởng đáng kể đến thời gian điều chỉnh: với thể tích công tác lớn thời gian quá trình chuyển tiếp tăng lên, nhưng chính tại giai đoạn này sự ảnh hưởng giá trị đường kính các lỗ dãy động cơ thủy lực đến chỉ số chất lượng này giảm đi đáng kể. Điều này được giải thích là bởi tính dễ nén của rô to động cơ thủy lực do sự tăng khối lượng và lực ma sát trong bơm khi tăng thể tích công tác. Trên hình 3.19 trình bày mối quan hệ mức lưu lượng vượt quá ngưỡng cho phép tại đầu ra của cơ cấu thủy lực điều khiển lái với giá trị đường kính các lỗ của dãy động cơ thủy lực tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược. Từ đồ thị hình 3.19 dễ thấy cùng với sự tăng đường kính các lỗ của dãy động cơ thủy lực là mức lưu lượng vượt ngưỡng tăng lên với các giá trị khác nhau của thể tích công tác động cơ tín hiệu ngược, điều này được giải thích tương tự như tình huống trước, tức là dải biên độ điều chỉnh bị thu hẹp lại. Cần nhấn mạnh rằng khi tăng thể tích công tác của động cơ thủy lực, thì sự ảnh hưởng tham số nghiên cứu đến giá trị lưu lượng vượt ngưỡng tham số đầu ra giảm xuống. Hình 3.19. Sự phụ thuộc giá trị lưu lượng vượt ngưỡng và giá trị đường kính các lỗ của dãy động cơ thủy lực tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. Như vậy, xem xét các mối quan hệ đã trình bày trên hình 3.18, 3.19 để nâng cao độ nhạy phản ứng của hệ thống và giảm giá trị vượt ngưỡng khi đóng dẫn động thủy lực có tính tới độ dự trữ ổn định (hình 3.9), tốt nhất là lấy các giá trị nhở đường kính các lỗ của dãy động cơ thủy d 1 …d 3 . Tuy nhiên dễ thấy là các lỗ của dãy động cơ thủy lực gây ảnh hưởng đáng kể đến lực cản cục bộ và khi giảm kích thước hình học của chúng áp suất chất lỏng công tác trước khi vào bộ phân phối thủy lực, tức là áp suất trong bơm tăng lên. Vì vậy cần đánh giá một cách hợp lý các quá trình chuyển tiếp ra tăng áp suất chất lỏng trước khi đi vào bộ phân phối thủy lực, áp suất trong vùng ổn định của hệ thống tại giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược q 3 = 160.10 -6 m 3 (hình 3.20). Hình 3.20. Các quá trình chuyển tiếp ra tăng áp suất trước bộ phân phối thủy lực tại các giá trị đường kính d 1 …d 5 khác nhau với thể tích công tác của động cơ tín hiệu ngược là q 3 = 160.10 -6 m 3 . Từ đồ thị dễ thấy khi dùng các lỗ của dãy động cơ thủy lực là d 1 = 2,6 mm áp suất trước bộ phân phối thủy lực cao hơn áp suất do van an toàn thiết lập, vì vậy cần phân tích sự ảnh hưởng giá trị đường kính các lỗ đến giá trị áp suất chất lỏng công tác đã thiết lập trước tại đầu vào bộ phân phối thủy lực với các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược q 1 …q 5 (hình 3.21). Nghiên cứu các mối quan hệ đã chỉ ra cho thấy rằng khi giảm đường kính các lỗ của dãy động cơ thủy lực áp suất trước bộ phân phối thủy lực tăng lên với mọi giá trị thể tích công tác của động cơ thủy lực do sự tăng độ chênh áp trong bộ phân phối thủy lực. Hình 3.21 Sự phụ thuộc giá trị áp suất trước bộ phân phối thủy lực vào giá trị đường kính lỗ dãy động cơ thủy lực tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược. Như vậy hợp lý nhất là sử dụng các đường kính lỗ nhỏ hơn 2,6 mm với động cơ thủy lực tín hiệu ngược có thể tích công tác là q 1 = 80.10 -6 m 3 và q 2 là 125.10 -6 m 3 ; nhỏ hơn 2,67 mm với q 3 = 160.10 -6 m 3 ; dưới 2,8 mm đối với q 4 = 200.10 -6 m 3 ; dưới 2,93 mm đối với q 5 = 250.10 -6 mm. Khuyến cáo về sử dụng đường kính các lỗ của dãy động cơ thủy lực bộ phân phối thủy lực như sau: Để đảm bảo độ ổn định của hệ thống thủy lực khi đóng dẫn động thủy lực nên sử dụng đường kính các lỗ không lớn hơn 3,6 mm; Để giảm thiểu độ chênh áp trong bộ phân phối thủy lực nên sử dụng đường kính không dưới 2,5 mm; Việc đánh giá các giá trị đường kính lỗ của dãy động cơ thủy lực cho phù hợp với các đặc tính đầu ra, các chỉ số ổn định, chất lượng các tiêu chí hiệu quả và các biện pháp đảm bảo độ tin cậy hoạt động của hệ thống thủy lực điều khiển lái là nhiệm vụ tổng hợp cần thiết ở giai đoạn thiết kế cơ cấu thủy lực điều khiển lái. Các góc vùng không nhạy cảm của bộ phân phối thủy lực ảnh hưởng đến quá trình chuyển tiếp cả khi đóng và tắt dẫn động thủy lực điều khiển lái. Vì vậy tín hiệu vận tốc quay tay lái đóng vai trò tín hiệu đầu vào (hình 3.2). Cho phép đánh giá sự ảnh hưởng đối với các chỉ số chất lượng tham số cần nghiên cứu khi đóng hệ thống thủy lực điều khiển lái. Việc nghiên cứu hệ thống thủy lực khi tắt dẫn động điều khiển chỉ thực hiện thông qua tín hiệu góc quay vòng tay lái (hình 3.3). Trên hình 3.22 và 3.23 trình bày ví dụ các quá trình chuyển tiếp ra tăng lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái khi đóng dẫn động điều khiển với các giá trị góc vùng không nhạy cảm khác nhau: γ 1 = 0,02 rad; γ 2 = 0,035 rad; γ 3 = 0,05 rad; γ 4 = 0,07 rad; γ 5 = 0,085 rad nằm trong vùng ổn định của hệ thống tại các giá trị thể tích công tác của động cơ thủy lực nhỏ nhất q 1 = 80.10 -6 m 3 và lớn nhất q 5 = 250.10 -6 m 3 . Hình 3.22. Các quá trình chuyển tiếp khi đóng dẫn động thủy lực với các giá trị góc vùng không nhạy của bộ phân phối thủy lực γ 1 … γ 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.23. Các quá trình chuyển tiếp khi đóng dẫn động thủy lực với các giá trị góc vùng không nhạy của bộ phân phối thủy lực γ 1 … γ 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 =250.10 -6 m 3 . Phân tích các mối quan hệ trình bày trên hình 3.22 và 3.23 cho thấy rằng, vùng không nhạy cảm ảnh hưởng đáng kể đến giá trị vượt ngưỡng lưu lượng trong hệ thống thủy lực điều khiển lái tại giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược là nhỏ nhất, vùng không nhạy cảm ảnh hưởng đến thời gian chễ thực tế của hệ thống, không phụ thuộc vào thể tích công tác. Để đánh giá về lượng các chỉ số chất lượng này chúng ta xây dựng các mối quan hệ giá trị vượt ngưỡng và thời gian chễ thực với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực trình bày trên hình 3.24 và 3.25. Trên hình 3.26 và 3.27 trình bày ví dụ về quá trình chuyển tiếp giảm lưu lượng trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực γ 1 = 0,02 rad; γ 2 = 0,035 rad; γ 3 = 0,05 rad; γ 4 = 0,07 rad; γ 5 = 0,085 rad nằm trong vùng ổn định của hệ thống, thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 và q 5 = 250.10 -6 m 3 . Hình 3.24. Mối quan hệ giữa giá trị lưu lượng vượt ngưỡng khi đóng dẫn động thủy lực với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược q 1 …q 5 . Hình 3.25. Mối quan hệ giữa thời gian chễ thực ra tăng lưu lượng khi đóng dẫn động thủy lực với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực. Từ mối quan hệ trình bày trên hình 3.24 cho thấy rằng giá trị lưu lượng vượt ngưỡng trong hệ thống khi đóng giảm xuống cùng với sự ra tăng giá trị vùng không nhạy cảm tới 0,05-0,06 rad khi sử dụng động cơ thủy lực tín hiệu ngược với thể tích công tác q 1 …q 3 , ở thể tích q 4 giá trị vượt ngưỡng thay đổi không đáng kể, còn với thể tích q 5 – giá trị vượt ngưỡng không phụ thuộc vào giá trị góc vùng không nhạy cảm. Điều này liên quan tới sự tăng khối lượng rô to của động cơ thủy lực và hệ quả là độ nén lưu lượng giảm khi mở các rãnh thông qua của dãy động cơ thủy lực bộ phân phối thủy lực. Cần nhấn mạnh rằng các giá trị lưu lượng vượt ngưỡng không vượt quá 20%, vì vậy có thể khuyến cáo sử dụng các giá trị góc vùng không nhạy cảm lớn của bộ phân phối thủy lực với mục tiêu giảm giá trị lưu lượng vượt ngưỡng tại đầu ra của hệ thống khi đóng dẫn động thủy lực. Từ mối quan hệ phụ thuộc trình bày trên hình 3.25 cho thấy rằng, thời gian chễ phụ thuộc trực tiếp vào giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực, không phụ thuộc vào thể tích công tác của động cơ thủy lực tín hiệu ngược. Nếu xét theo khía cạnh này khuyến cáo sử dụng các góc vùng không nhạy cảm bộ phân phối thủy lực nhỏ để giảm thời gian chễ thực tế. Hình 3.26. Các quá trình chuyển tiếp khi tắt dẫn động thủy lực với các giá trị góc đóng các rãnh của bộ phân phối thủy lực γ 1 … γ 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.27. Các quá trình chuyển tiếp khi tắt dẫn động thủy lực với các giá trị góc đóng các rãnh của bộ phân phối thủy lực γ 1 … γ 5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 250.10 -6 m 3 . Từ phân tích các quá trình chuyển tiếp trình bày trên hình 3.26, 3.27, dễ thấy, vùng không nhạy của bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái ảnh hưởng đáng kể đến chất lượng của hệ thống khi tắt dẫn động thủy lực. Chỉ số chất lượng quan trọng nhất trong trường hợp này là giá trị lưu lượng chất lỏng công tác vượt ngưỡng quy định mà về thực tế kỳ vọng giá trị này phải không tồn tại khi ngừng các tác động lên tay lái. Sự phụ thuộc (mối quan hệ) giá trị lưu lượng vượt ngưỡng với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược được trình bày trên hình 3.28. Dễ thấy từ đồ thị hình 3.28 giá trị lưu lượng chất lỏng công tác vượt ngưỡng tăng lên khi giảm góc vùng không nhạy cảm, ngoài ra khi giảm thể tích công tác động cơ thủy lực tín hiệu ngược đường đặc tính có hình dạng càng dốc hơn, đặc tính này liên quan tới sự thay đổi thể tích công tác. Như vậy với thể tích công tác q 1 = 80.10 -6 m 3 lượng chất lỏng công tác vượt ngưỡng đạt giá trị cho phép ở các góc vùng không nhạy γ 1 = 3,46.10 -2 rad; với q 2 = 125.10 -6 m 3 – γ 2 = 3,13.10 -2 rad; với q 3 = 160.10 -6 m 3 ; γ 3 = 2,75 .10 -2 ; với q 4 = 200.10 -2 m 3 ; q 5 = 250.10 -6 m 3 – các giá trị lưu lượng vượt ngưỡng không vượt quá giá trị cho phép. Hình 3.28. Sự phụ thuộc lưu lượng chất lỏng công tác vượt ngưỡng quy định khi tắt dẫn động thủy lực vào giá trị góc vùng không nhạy cảm bộ phân phối thủy lực tại các giá trị thể tích công tác động cơ thủy lực tín hiệu ngược khác nhau q 1 …q 5 . Để hệ thống có các chỉ số chất lượng đảm bảo hoạt động ổn định khuyến cáo sử dụng góc đóng các rãnh bộ phân phối thủy lực không nhỏ hơn γ 2 = 0,035 rad, còn để đạt được mục tiêu giảm tối đa lượng chất lỏng công tác vượt ngưỡng, tức là tránh hiện tượng tiêu cực xảy ra nên sử dụng γ 3 = 0,05 rad. Chỉ số chất lượng có ý nghĩa quan trọng nữa chính là thời gian điều chỉnh giảm lưu lượng chất lỏng công tác tại đầu ra của cơ cấu thủy lực điều khiển lái khi tắt dẫn động thủy lực. Sự phụ thuộc thời gian điều chỉnh lưu lượng vaofo góc vùng không nhạy của bộ phân phối thủy lực tại các giá trị thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược được trình bày trên hình 3.29. Khi tăng góc vùng không nhạy cảm thời gian điều chỉnh tín hiệu đầu ra tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược sẽ giảm xuống, khi giảm giá trị thể tích công tác đường đặc tính có hình dạng dốc hơn, điều này giải thích do cấp nhạy cảm của rô to khác nhau khi thay đổi thể tích công tác. Để tăng độ nhạy phản ứng của hệ thống khi tắt dẫn động thủy lực khuyến cáo sử dụng góc vùng không nhạy cảm bộ phân phối thủy lực lớn. Hình 3.29 Sự phụ thuộc thời gian điều chỉnh lưu lượng chất lỏng công tác khi tắt dẫn động thủy lực vào giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược q 1 …q 5 . Như vậy có thể đưa ra các khuyến cáo về sử dụng các góc vùng không nhạy cảm như sau: Để đảm bảo độ ổn định của hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực nên sử dụng các góc vùng không nhạy cảm không lớn hơn 0,02 rad; Khuyến cáo nên sử dụng các góc vùng không nhạy cảm không lớn hơn 0,035 rad để đảm bảo giá trị lưu lượng vượt ngưỡng nằm trong khoảng giá trị giới hạn cho phép. Việc luận giải giá trị các góc vùng không nhạy cảm trong giải thu được với mục tiêu đảm bảo các chỉ số ổn định, chất lượng tiêu chí hiệu suất và các biện pháp nâng cao các chỉ số chất lượng của các quá trình công tác này của hệ thống thủy lực điều khiển lái ở giai đoạn thiết kế là nhiệm vụ của hoạt động phân tích tổng hợp cơ cấu thủy lực điều khiển lái. Diện tích các thiết diện thông qua của các rãnh giảm tải ảnh hưởng đến việc hình thành các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái, vì vậy để đánh giá sự ảnh hưởng của tham số này đến các chỉ số chất lượng của hệ thống chúng ta đã xây dựng biểu đồ các quá trình chuyển tiếp ra tăng lưu lượng chất lỏng công tác tại đầu ra của cơ cấu thủy lực điều khiển lái. Trên hình 3.30 và 3.31 trình bày các ví dụ về các quá trình chuyển tiếp tín hiệu (giá trị) đầu ra tại các giá trị diện tích thiết diện thông qua của các rãnh giảm tải f SL1 = 0,5∙10 -4 m 2 ; f SL2 = 0,75∙10 -4 m 2 ; f SL3 = 10 -4 m 2 ; f SL4 = =1,25∙10 -4 m 2 ; f SL5 = 1,5.10 -4 m 2 với các thể tích công tác động cơ thủy lực tín hiệu ngược cực tiểu q 1 = 80.10 -6 m 3 và cực đại q 5 = 250.10 -6 m 3 . Từ các mối quan hệ trình bày trên hình 3.30, 3.31 cho thấy rằng, diện tích thiết diện thông qua của các rãnh giảm tải ảnh hưởng đến chất lượng của các quá trình chuyển tiếp phát sinh trong hệ thống thủy lực điều khiển lái. Để đánh giá sự ảnh hưởng của tham số phân tích đến chất lượng của các quá trình phát sinh trong hệ thống cần xây dựng mối quan hệ giá trị lưu lượng chất lỏng công tác vượt ngưỡng tại đầu ra với giá trị diện tích thiết diện thông qua của các rãnh giảm tải tại các giá trị thể tích động cơ thủy lực tín hiệu ngược khác nhau (hình 3.32). Xuất phát từ phân tích các mối quan hệ đã trình bày trên hình (3.32) có thể đưa ra kết luận rằng, khi giảm giá trị diện tích thiết diện thông qua của các rãnh giảm tải dẫn tới lưu lượng chất lỏng vượt ngưỡng ở các thể tích công tác nhỏ của động cơ thủy lực tăng đột ngột, còn khi giảm giá trị diện tích thiết diện các rãnh giảm tải – lưu lượng chất lỏng công tác ngượt ngưỡng tại mọi giá trị thể tích công tác giảm dần, điều này giải thích bởi sự giảm độ nhạy rô to động cơ thủy lực, hệ quả của sự tăng khối lượng rô to và lực ma sát trong bơm. Hình 3.30. Các quá trình chuyển tiếp trong hệ thống thủy lực điều khiển lái khi bật dẫn động thủy lực với các giá trị diện tích thiết diện thông qua của các rãnh giảm tải f SL1 … f SL5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 1 = 80.10 -6 m 3 . Hình 3.31. Các quá trình chuyển tiếp khi đóng dẫn động thủy lực với các giá trị diện tích thiết diện thông qua của các rãnh giảm tải f SL1 …f SL5 và thể tích công tác của động cơ thủy lực tín hiệu ngược q 5 = 250.10 -6 . Hình 3.32. Sự phụ thuộc giá trị lưu lượng chất lỏng công tác vượt ngưỡng vào giá trị diện tích thiết diện các rãnh giảm tải với các giá trị khác nhau của thể tích công tác của động cơ tín hiệu ngược q 1 …q 5 . Trên hình 3.33 trình bày sự phụ thuộc thời gian điều chỉnh giá trị đầu ra vào tham số biến thiên tại các giá trị khác nhau của thể tích công tác động cơ thủy lực tín hiệu ngược. Thời gian của quá trình chuyển tiếp giảm khi tăng diện tích thiết diện thông qua của các rãnh giảm tải của bộ phân phối thủy lực với mọi giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược. Hình 3.33 Sự phụ thuộc thời gian điều chỉnh lưu lượng chất lỏng công tác vào giá trị diện tích thiết diện thông qua của các rãnh giảm tải với các giá trị thể tích chất lỏng công tác của động cơ thủy lực tín hiệu ngược q 1 …q 5 . Như vậy có thể đưa ra các khuyến cáo sau về việc lựa chọn giá trị diện tích thiết diện của các rãnh xả của bộ phân phối thủy lực: Để giảm giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống khuyến cáo sử dụng các rãnh giảm tải có diện tích thiết diện lớn; Để giảm thời gian điều chỉnh khuyến cáo nên tăng diện tích thiết diện các rãnh giảm tải; Việc luận giải giá trị diện tích thiết diện thông qua của các rãnh giảm tải trong giải thu được với mục tiêu đảm bảo các chỉ số ổn định, chất lượng tiêu chí hiệu suất và các biện pháp nâng cao các chỉ số chất lượng của các quá trình công tác của hệ thống thủy lực điều khiển lái ở giai đoạn thiết kế là nhiệm vụ của nội dung phân tích tổng hợp cơ cấu thủy lực điều khiển lái."
    },
    {
      "id": "3.2",
      "title": "Phương pháp tổng hợp cơ cấu thủy lực điều khiển lái.",
      "content": "3.2 Phương pháp tổng hợp cơ cấu thủy lực điều khiển lái. Bản chất của phương pháp tổng hợp là xây dựng phương pháp tối ưu hóa, tức là lựa chọn phương án đáp ứng các tiêu chí hiệu suất và các biện pháp đảm bảo cho các quá trình hoạt động của hệ thống thủy lực điều khiển lái diễn ra tin cậy dựa trên cơ sở so sánh các phương án đảm bảo tiêu chí hiệu suất. Dễ thấy cách so sánh này có ý nghĩa khi xác định vùng giải pháp pháp phù hợp bằng cách đưa ra các phương án trái ngược nhau với thứ tự tính toán hiệu suất trong từng trường hợp. Trong trường hợp sử dụng mô hình lập trình toán việc so sánh có thể thực hiện ngay trong quá trình tính toán, kết quả tính toán là đáp án tối ưu duy nhất theo tiêu chí hiệu suất đã chọn /9, 10/. Thuật toán tổng hợp tối ưu hóa cơ cấu thủy lực điều khiển lái (hình 3.34): 1. Đề ra nhiệm vụ tối ưu hóa: Chọn hàm mục tiêu; Chọn các giới hạn. 2. Xấp xỉ các mối quan hệ của các đặc tính đầu ra, các chỉ số chất lượng của hệ thống với các tham số kết cấu để xây dựng hàm mục tiêu: Biện giải phương pháp xấp xỉ; Xác định hàm nội suy. 3. Giải bài toán tối ưu hóa quy ước: Tổng quan các phương pháp giải các bài toán tối ưu hóa quy ước; Thuật toán chuyển tiếp bài toán tối ưu hóa vô điều kiện. 4. Giải bài toán tối ưu hóa vô điều kiện: Mô tả phương pháp đã lựa chọn tìm kiếm lời giải cho bài toán tối ưu hóa; Nhận các giá trị hợp lý của các tham số là kết quả lời giải bài toán tối ưu hóa. 5. Tìm kiếm điều chỉnh đáp án tối ưu theo véc tơ tiêu chí hiệu suất. Hình 3.34. Thuật toán tổng hợp tối ưu các cơ cấu thủy lực điều khiển lái"
    },
    {
      "id": "3.2.1",
      "title": "Nhiệm vụ bài toán tối ưu.",
      "content": "3.2.1 Nhiệm vụ bài toán tối ưu. Theo quan điểm phương pháp giải, các bài toán tối ưu tuyến tính được chia ra thành hai loại /4, 24, 45/: Các bài toán tối ưu vô điều kiện; Các bài toán tối ưu có điều kiện. Bài toán tối ưu vô điều kiện là tìm kiếm giá trị tối ưu của hàm mục tiêu không tính tới bất kỳ điều kiện bổ xung nào, bài toán này được miêu tả dưới dạng /45/: f(x) → min (max), (3.2) Các bài toán dạng này trên thực tế thường rất ít gặp, nhưng phương pháp giải chúng được áp dụng rất phổ biến để giải các bài toán tối ưu hóa. Bài toán tối ưu hóa quy ước trong trường hợp tổng quát được mô tả dưới dạng sau /45, 52/: (3.3) Hệ phương trình (3.3) gồm có ba thành phần: 1. Hàm mục tiêu cho biết nghiệm cần tối ưu có ý nghĩa như thế nào, tức là nghiệm tốt nhất, khi đó có thể có ba dạng công dụng của hàm mục tiêu: cực đại hóa, cực tiểu hóa, quy định giá trị cho trước. 2. Các giới hạn quy định mối quan hệ giữa các biến; 3. Các điều kiện biên cho biết giá trị các biến cần tìm trong đáp án tối ưu có thể nằm trong các giới hạn nào. Các hàm mục tiêu của các tham số đầu ra và các chỉ số chất lượng hệ thống với giá trị các đường kính lỗ dãy động cơ thủy lực và các điều kiện biên phải thỏa mãn: Cần thỏa mãn yêu cầu tăng độ dự trữ ổn định bằng cách cực tiểu hóa hệ số dao động giá trị đầu ra: (3.4) Cần thỏa mãn yêu cầu giảm lưu lượng chất lỏng vượt ngưỡng tại đầu ra của hệ thống: (3.5) Cần đảm bảo quay vòng xe với giá trị áp suất của bơm cao áp nhỏ nhất: (3.6) Cần thỏa mãn yêu cầu giảm thời gian điều chỉnh giá trị đầu ra: (3.7) Các hàm mục tiêu của các chỉ số chất lượng hệ thống với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực và các điều kiện biên khi đóng dẫn động thủy lực cần thỏa mãn: Cần thỏa mãn yêu cầu giảm lưu lượng chất lỏng công tác vượt ngưỡng tại đầu ra của hệ thống: (3.8) Cần giảm thời gian chễ thực tế khi đóng dẫn động thủy lực: (3.9) Các hàm mục tiêu của các chỉ số chất lượng của hệ thống với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực và các điều kiện biên khi tắt dẫn động thủy lực cần thỏa mãn: (3.10) Cần thỏa mãn yêu cầu giảm thời gian điều chỉnh giá trị tham số ra khi tắt dẫn động thủy lực: (3.11) Cần thỏa mãn yêu cầu giảm lưu lượng chất lỏng vượt ngưỡng tại đầu ra trong hệ thống khi tắt dẫn động thủy lực: (3.12) Các hàm mục tiêu của các chỉ số chất lượng của hệ thống với giá trị diện tích các thiết diện thông qua của các rãnh giảm tải trong bộ phân phối thủy lực và các điều kiện biên: Cần thỏa mãn yêu cầu giảm lưu lượng chất lỏng công tác vượt ngưỡng tại đầu ra của hệ thống: (3.13) Cần thỏa mãn yêu cầu giảm thời gian điều chỉnh tham số ra: (3.14) Như vậy đã thiết lập được bài toán tối ưu đặt ra nhờ đưa ra các hàm mục tiêu và các điều kiện biên."
    },
    {
      "id": "3.2.2",
      "title": "Xấp xỉ các mối quan hệ.",
      "content": "3.2.2 Xấp xỉ các mối quan hệ. Để thu được các hàm mục tiêu và giải bài toán tối ưu cần xấp xỉ các mối quan hệ của các đặc tính đầu ra, các chỉ số ổn định và chất lượng hệ thống thủy lực điều khiển lái bằng các phương trình phi tuyến với các giá trị sau: Giá trị đường kính các lỗ của dãy động cơ thủy lực của bộ phân phối thủy lực và thể tích công tác của động cơ thủy lực tín hiệu ngược khi đóng dẫn động thủy lực: р( d 0 , q) (xem trên hình 3.21); М( d 0 , q) (xem trên hình 3.9); σ( d 0 , q) (xem trên hình 3.19) и t ПП (d 0 , q) (xem trên hình 3.18); Giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực và thể tích công tác của động cơ thủy lực tín hiệu ngược khi đóng dẫn động thủy lực σ(γ, q) (xem hình 3.24); τ(γ, q) (xem hình 3.25) và khi tắt dẫn động thủy lực М( γ, q) (xem hình 3.15); σ(γ, q) (xem hình 3.28); t ПП (γ, q) (xem hình 3.29); Giá trị diện tích thiết diện thông qua của các rãnh giảm tải và thể tích công tác của động cơ thủy lực tín hiệu ngược khi đóng dẫn động σ( f SL , q) (xem hình 3.32); t ПП (f SL , q) (xem hình 3.33). Biện giải phương pháp xấp xỉ . Trong công trình này để xấp xỉ các mối quan hệ đã trình bày ở trên chúng ta sử dụng phương pháp bình phương nhỏ nhất, bởi vì nó đảm bảo độ chính xác cần thiết và được sử dụng trong các phần mềm phổ biến như MatCAD hay MS EXCEL. Đối với phương pháp này các tham số a 1 , a 2 …a m trong mối quan hệ thực nghiệm được coi là các tham số tốt nhất nếu tổng bình phương độ lệch trung bình là nhỏ nhất /30, 73/: (3.15) Điều kiện cực trị hàm nhiều biến là đạo hàm riêng của hàm này theo các tham số biến thiên giảm dần về 0. (3.16) Đạo hàm riêng của hàm số F(a 1 , a 2 …a m ) theo các tham số biến thiên: (3.17) Đối với các tham số còn lại a 2 , a 3 …a m đạo hàm riêng có dạng. (3.18) Nghiệm của hệ tương đối với a 1 , a 2 …a m cho biết các giá trị của những tham số tốt nhất cần tìm. Đặc tính rất quan trọng của mối quan hệ phụ thuộc hồi quy là giá trị và độ tin cậy được đánh giá bằng giá trị R 2 tìm được trong khoảng giới hạn /45/: 0 ≤ R 2 ≤ 1. (3.19) Với các giá trị R 2 = 0 là các giá trị độc lập, quy định các phương trình hồi quy; với R 2 = 1 có nghĩa là hàm phụ thuộc. Các giá trị cho phép là R 2 ≥ 0,7 /45/. Dễ thấy các hàm hai biến xấp xỉ ở dạng đồ thị biểu diễn bởi mặt phẳng, tuy nhiên kể cả nếu có công cụ toán học mạnh cũng khó có thể nhận được độ chính xác chấp nhận được vì việc xấp xỉ các bề mặt được thực hiện ở dạng người dùng và việc mô tả bề mặt ở dạng đa thức lớn hơn bậc hai thường gặp các khó khăn xác định. Vì vậy trong công trình này do một trong các biến mà cụ thể là biến thể tích công tác của động cơ thủy lực tín hiệu ngược thay đổi độ chính xác nên có thể chuyển từ phương trình hồi quy đa biến thành phương trình hồi quy đơm biến với từng giá trị thay đổi. Phần mềm MS Excel cho phép xác định phương trình hồi quy để xây dựng đồ thị y = f(x) . Quá trình này được thực hiện nhờ thuật toán tìm hàm hồi quy bằng phần mềm MS Exel /45/: 1. Nhập dữ liệu ban đầu. 2. Xây dựng mối quan hệ phụ thuộc. 3. Chỉ ra đường cong xấp xỉ và lồng đường cong xu hướng (hình 35). 4. Trên cơ sở dạng số liệu thống kê, chọn kiểu hồi quy và đối với hồi quy đa thức – chọn bậc. 5. Hiển thị phương trình nhận được. 6. Đánh giá độ chính xác xấp xỉ giá trị R 2 . Cấp đa thức xác định bằng giá trị độ chính xác lớn nhất R 2 . Xác định hồi quy phi tuyến F= f(d 0 , q): Sử dụng thuật toán trên chúng ta thu được phương trình hồi quy p = f(d 0 ) , các mối quan hệ xấp xỉ của các giá trị áp suất đã thiết lập trong bộ phân phối thủy lực với giá trị đường kính các lỗ của dãy động cơ thủ lực d 0 (hình 3.36): đối với q 1 = 80.10 -6 m 3 : p = − 0,0074 d 3 + 0,7868 d 2 – 27,9157 d + 336,703 (3.20) với giá trị độ tin cậy R 2 = 0,999. Hình 3.35 Hộp thoại xây dựng đường xu hướng đối với q 2 = 125.10 -6 m 3 : p = 9,0891∙10 -5 d 6 0,0171 d 5 + 1,3406 d 4 55,8626 d 3 + + 1306,6544 d 2 − 16271,283 d + 84320,23 (3.21) với giá trị độ tin cậy R 2 = 0,999. đối với q 3 = 160.10 -6 m 3 : p = − 0,01143. d 3 + 1,1948 d 2 − 41,814 d + 497,953 với giá trị độ tin cậy R 2 = 0,999. Hình 3.36 Xấp xỉ sự phụ thuộc áp suất tại đầu vào bộ phân phối thủy lực với giá trị đường kính các lỗ của dãy động cơ thủy lực tại các giá trị thể tích công tác của động cơ thủy lực khác nhau. Hình 3.37. Xấp xỉ sự phụ thuộc hệ số dao động tiêu hao chất lỏng công tác trong hệ thống thủy lực điều khiển lái với giá trị đường kính các lỗ của dãy động cơ thủy lực khi mở dẫn động với giá trị các đường kính lỗ dãy động cơ thủy lực tại các giá trị khác nhau của thể tích công tác. đối với q 4 = 200.10 -6 m 3 : p = 0,001694 .d 4 − 0,2261 d 3 + 11,3923 d 2 − 257,353 d + 2212,302 (3.23) với giá trị độ tin cậy R 2 = 0,9999. đối với q 5 = 250.10 -6 m 3 : p = 0,001144 d 5 − 0,1773 d 4 + 10,9406 d 3 – 335,4502 d 2 + 5107,258 d – 30828,702 (3.24) với giá độ chính xác R 2 = 0,999. Phương trình hồi quy M = f(d 0 ) , các mối quan hệ xấp xỉ hệ số dao động tiêu hao chất lỏng công tác trong hệ thống thủy lực điều khiển lái khi bật dẫn động thủy lực với giá trị đường kính các lỗ của dãy động cơ thủy lực d 0 (hình 3.37): đối với q 1 = 0,999. M = 0,02596 d 3 − 1,7717 d 2 + 39,4288 d − 284,0415 (3.26) với giá trị độ chính xác R 2 = 0,999. đối với q 2 = 125.10 -6 m 3 : M = 0,02451 d 3 − 1,592 d 2 + 33,08645 d − 215,0687 (3.26) với giá trị độ tin cậy R 2 = 0,999. đối với q 3 = 160.10 -6 m 3 : M = 0,002531 d 4 − 0,2888 d 3 + 12,9076 d 2 − 263,2135 d + 2038,48 (3.27) Với giá trị độ chính xác R 2 = 0,999. đối với q 4 = 200.10 -6 m 3 : M = 0,00221 d 4 − 0,2441 d 3 + 10,6085 d 2 − 211,4913 d + 1606,879 (3.28) với giá trị q 5 = 250.10 -6 m 3 : M = 0,003663 d 4 − 0,4096 d 3 + 17,722 d 2 − 347,685 d + 2585,47 (3.29) với giá trị độ chính xác R 2 = 0,999. Hàm hồi quy σ = f(d 0 ), sự phụ thuộc xấp xỉ giá trị lưu lượng vượt ngưỡng trong hệ thống thủy lực điều khiển lái khi bật dẫn động thủy lực vào giá trị đường kính các lỗ của dãy động cơ thủy lực d 0 (hình 3.38): đối với q 1 =80.10 -6 m 3 : σ = 0,00132 d 5 – 0,2057 d 4 + 12,6497 d 3 − 385,2586 d 2 + 5814,2917 d − 34807,574 (3.30) với giá trị độ tin cậy R 2 = 0,998 đối với q 2 = 125.10 -6 m 3 : σ = –6,318E-05 d 6 + 0,01094 d 5 − 0,7844 d 4 + 29,698 d 3 – 625,1638 d 2 + 6922,663 d − 31417,31 (3.31) với giá trị độ chính xác R 2 = 0,998. đối với q 3 = 160.10 -6 m 3 : σ = 0,0004869 d 5 – 0,07345 d 4 + 4,3929 d 3 – 130,2413 d 2 + 1916,225 d 11200,249 (3.32) với giá trị độ chính xác R ² = 0,999. đối với q 4 = 200.10 -6 m 3 : σ = –0,000388 d 5 + 0,0584 d 4 – 3,5068 d 3 + 104,8731 d 2 1561,8211 d + 9264,613 (3.33) với giá trị độ chính xác R ² = 0,999. đối với q 5 = 250.10 -6 m 3 : σ = – 0,002315 d 4 + 0,2776 d 3 – 12,4389 d 2 + 247,555 d – 1838,511 (3.34) với giá trị độ tin cậy R ² = 0,999. Hình 3.38. Xấp xỉ sự phụ thuộc giá trị lưu lượng vượt ngưỡng trong hệ thống thủy lực vào giá trị đường kính các lỗ của dãy động cơ thủy lực tại các giá trị thể tích công tác khác nhau của động cơ thủy lực. Hình 3.39. Xấp xỉ sự phụ thuộc thời gian điều chỉnh lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái vào giá trị đường kính các lỗ của dãy động cơ thủy lực tại các giá trị khác nhau của thể tích công tác của động cơ thủy lực. Các hàm hồi quy t ПП = f(d 0 ), xự phụ thuộc xấp xỉ thời gian điều chỉnh lưu lượng chất lỏng công tác khi bật dẫn động thủy lực vào giá trị đường kính các lỗ của dãy thủy lực d 0 (hình 3.39): đối với q 1 = 80.10 -6 m 3 : t ПП = –3,254E-06 d 6 + 0,0006 d 5 – 0,04687 d 4 + 1,9222 d 3 – 44,1164 d 2 + 537,1968 d – 2711,374 (3.35) với giá trị độ tin cậy R 2 = 0,999. đối với q 2 = 125.10 -6 m 3 : t ПП = –1,0049E-05 d 5 + 0,001567 d 4 – 0,09747 d 3 + 3,0205 d 2 – 46,621 d + 286,688 (3.36) với giá trị độ tin cậy R 2 = 0,999. đối với q 4 = 160.10 -6 m 3 : t ПП = – 0,0001978 d 3 + 0,01885 d 2 – 0,5727 d + 5,8518 (3.37) với giá trị tin cậy R 2 = 0,999. đối với q 4 = 200.10 -6 m 3 : t ПП = – 7,4981∙10 -5 d 3 + 0,00711 d 2 – 0,2115 d + 2,353 đối với q 5 = 250.10 -6 m 3 : t ПП = 3,4502∙10-6 d 5 – 0,0005292 d 4 + 0,03226 d 3 0,9765 d 3 + 14,6755 d – 87,2095 (3.39) với giá trị độ tin cậy R 2 = 0,999. Xác định hồi quy phi tuyến F = f( γ, q) . Chúng ta nhận được các hàm hồi quy M = f( γ) , phụ thuộc xấp xỉ hệ số dao động lưu lượng trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực điều khiển lái vào các góc vùng không nhạy cảm của bộ phân phối thủy lực (hình 3.40): đối với q 1 = 80.10 -6 m 3 : M = 0,3627 γ 4 – 8,9659 γ 3 + 81,107 γ 2 – 317,764 γ + 454,43 (3.40) với giá trị độ tin cậy R 2 = 0,997. đối với q 2 = 125.10 -6 m 3 : M = 0,0577 γ 5 +1,7614 γ 4 21,025 γ 3 +122,628 γ 2 348,851 γ + + 386,65 (3.41) với giá trị độ tin cậy R 2 = 0,996 đối với q 3 = 160.10 -6 m 3 : M = – 0,0575 γ 5 + 1,6961 γ 4 – 19,4812 γ 3 + 108,703 γ 4 – 293,955 γ + + 307,54 (3.42) với giá trị độ tin cậy R 2 = 0,996. đối với q 4 = 200.10 -6 m 3 : M = – 0,0506 γ 5 + 1,4887 γ 4 – 17,048 γ 3 + 94,787 γ 2 255,184 γ + 265,511 (3.43) với giá trị độ tin cậy R 2 = 0,995. đối với q 5 = 250.10 -6 . M = – 0,0466 γ 5 + 1,3691 γ 4 – 15,6606 γ 3 + 86,9521 γ 2 – 233,723 γ + + 242,739 (3.44) với giá trị độ tin cậy R 2 = 0,995. Chúng ta thu được các phương trình hồi quy σ = f( γ) , phụ thuộc xấp xỉ giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống thủy lực điều khiển lái khi bật dẫn động thủy lực vào góc vùng không nhạy cảm của bộ phân phối thủy lực trình bày trên hình 3.41: đối với q 1 = 80.10 -6 m 3 : σ = 0,005394 γ 5 – 0,2401 γ 4 + 3,6167 γ 3 – 23,5568 γ 2 +63,6584 γ – 41,8301 (3.45) với giá trị độ tin cậy R 2 = 0,983. Hình 3.40 Xấp xỉ sự phụ thuộc hệ số dao động tiêu hao chất lỏng công tác trong hệ thống điều khiển thủy lực khi tắt dẫn động thủy lực vào giá trị góc vùng không nhạy cảm tại các giá trị thể tích công tác khác nhau. Hình 3.41. Xấp xỉ phụ thuộc giá trị lưu lượng vượt ngưỡng trong hệ thống thủy lực điều khiển lái khi bật dẫn động thủy lực vào góc vùng không nhạy cảm tại các giá trị thể tích công tác của động cơ thủy lực. đối với q 2 = 125.10 -6 m 3 : σ = 0,009786 γ 5 – 0,3254 γ 4 + 4,0901 γ 3 – 23,6534 γ 2 + 59,1557 γ – 35,559 (3.46) với giá trị độ tin cậy R 2 = 0,990. đối với q 3 = 160.10 -6 m 3 : σ = – 0,00115 γ 5 – 0,0189 γ 4 + 0,7957 γ 3 6,9301 γ 2 20,381 γ – 4,135 (3.47) với giá trị tin cậy R 2 = 0,995. đối với q 4 = 200.10 -6 m 3 : σ = – 0,02215 γ 4 + 0,5072 γ 3 – 3,9605 γ 2 + 11,3993 γ + 2,6264 (3.48) với giá trị độ tin cậy R 2 = 0,996. đối với q 5 = 250.10 -6 m 3 : σ = – 0,07842 γ + 12,1107 (3.49) với giá trị độ tin cậy R 2 = 0,999. Chúng ta thu được các phương trình hồi quy σ = f( γ) , phụ thuộc xấp xỉ giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực vào góc vùng không nhạy cảm của bộ phân phối thủy lực trình bày trên hình 3.42: đối với q 1 = 80.10 -6 m 3 : σ = 0,0978 γ 4 – 2,4394 γ 3 + 23,0268 γ 2 – 99,7863 γ + 177,016 (3.50) với giá trị tin cậy R 2 = 0,998. đối với q 2 = 125.10 -6 m 3 : σ = 0,0581 γ 4 – 1,4927 γ 3 + 14,665 γ 2 – 66,65 γ + 125,28 (3.51) với giá trị tin cậy R 2 = 0,999. đối với q 3 = 160.10 -6 m 3 : σ = – 0,1395 γ 3 + 3,0742 γ 2 – 22,887 γ + 62,201 (3.52) với giá trị tin cậy R 2 = 0,999. đối với q 4 = 200.10 -6 m 3 : σ = – 0,0518 γ 3 + 1,1706 γ 2 – 9,2217 γ + 29,631 (3.53) với giá trị tin cậy R 2 = 0,998. đối với q 5 = 250.10 -6 m 3 : σ = 0,2024 γ 2 – 2,9853 γ + 14,9287 (3.54) với giá trị tin cậy R 2 = 0,996. Phương trình hồi quy τ = f( γ) , phụ thuộc xấp xỉ độ chễ thực tế khởi động hệ thống thủy lực điều khiển lái vào giá trị góc vùng không nhạy cảm bộ phân phối thủy lực được thể hiện dưới dạng sau đây: τ = γ . (3.55) Chúng ta thu được phương trình hồi quy t ПП = f( γ) , phụ thuộc xấp xỉ giá trị thời gian điều chỉnh lưu lượng trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực vào giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực trình bày trên hình 3.43: đối với q 1 = 80∙10 -6 m 3 : t ПП = 0,002447 γ 3 – 0,0432 γ 2 + 0,1712 γ + 0,4222 (3.56) với giá trị tin cậy R 2 = 0,999. đối với q 2 = 125∙10 -6 m 3 : t ПП = 0,002447 γ 3 – 0,0432 γ 2 + 0,1712 γ + 0,4222 (3.57) với giá trị tin cậy R 2 = 0,999. đối với q 3 = 160∙10 -6 m 3 : t ПП = – 0,0002638 γ 3 + 0,001622 γ 2 – 0,0384γ + 0,6436 (3.58) với giá trị tin cậy R 2 = 0,999. q 4 = 200∙10 -6 m 3 : t ПП = – 0,00171 γ 3 + 0,0258 γ 2 – 0,1537 γ + 0,7697 (3.59) với giá trị tin cậy R 2 = 0,999. Hình 3.42. Xấp xỉ quan hệ giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị khác nhau của thể tích công tác động cơ thủy lực. Hình 3.43. Xấp xỉ quan hệ thời gian điều chỉnh lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực với góc vùng không nhạy cảm của bộ phân phối thủy lực tại các giá trị khác nhau thể tích công tác của động cơ thủy lực. đối với q 5 = 250.10 -6 m 3 : t ПП = – 0,00236 γ 3 + 0,0369 γ 2 – 0,2059 γ + 0,8141 (3.60) với giá trị độ tin cậy R 2 = 0,999. Xác định hàm hồi quy tuyến tính F = f(f SL ) , phụ thuộc xấp xỉ lưu lượng chất lỏng vượt ngưỡng trong hệ thống thủy lực điều khiển lái vào giá trị diện tích thiết diện thông qua của các rãnh giảm tải trong bộ phân phối thủy lực trình bày trên hình 3.44: đối với q 1 = 80.10 -6 m 3 : σ = 0,1932 f SL 4 – 3,015 f SL 3 + 16,8254 f SL 2 – 41,172 f SL + 46,403 (3.62) với giá trị tin cậy R 2 = 0,999. đối với q 4 = 200.10 -6 m 3 : σ = 0,2338 f SL 3 + 2,1127 f SL 2 – 7,1647 f SL + 19,548 (3.64) với giá trị tin cậy R 2 = 0,999. đối với q 5 = 250.10 -6 m 3 : σ = -0,1602 f SL 3 + 1,0659 f SL 2 – 2,548 f SL + 14,315 (3.65) với giá trị tin cậy R 2 = 0,997. Chúng ta thu được các phương trình hồi quy t ПП = f(f SL ) , phụ thuộc xấp xỉ giá trị thời gian điều chỉnh lưu lượng trong hệ thống thủy lực điều khiển lái vào giá trị diện tích thiết diện các rãnh giảm tải trong bộ phân phối thủy lực trình bày trên hình 3.45: đối với q 1 = 80.10 -6 m 3 : t ПП = -0,001562 f SL 3 + 0,0219 f SL 2 – 0,1157 f SL + 0,3675 (3.66) với giá trị tin cậy R 2 = 0,999. đối với q 2 = 125.10 -6 m 3 : t ПП = 0,000754 f SL 3 0,00247 f SL 2 – 0,0393 f SL + 0,3233 (3.67) với giá trị tin cậy R 2 = 0,998. đối với q 3 = 160.10 -6 m 3 : t ПП = 0,0009826 f SL 2 0,0359 f SL + 0,3248 (3.68) với giá trị tin cậy R 2 = 0,998. đối với q 4 = 160.10 -6 m 3 : t ПП = 0,001723 f SL 3 +0,00837 f SL 2 -0,0278 f SL +0,3208 (3.69) vơi giá trị tin cậy R 2 = 0,999. Hình 3.44. Xấp xỉ phụ thuộc giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống thủy lực điều khiển lái vào giá trị diện tích thiết diện thông qua của các rãnh giảm tải tại các giá trị thể tích công tác khác nhau của động cơ thủy lực. Hình 3.45. Xấp xỉ phụ thuộc thời gian điều chỉnh lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái vào giá trị diện tích thiết diện thông qua của các rãnh giảm tải tại các giá trị thể tích công tác khác nhau của động cơ thủy lực."
    },
    {
      "id": "3.2.3",
      "title": "Giải bài toán tối ưu có điều kiện.",
      "content": "3.2.3 Giải bài toán tối ưu có điều kiện. Tổng quan các phương pháp tìm lời giải bài toán tối ưu có điều kiện. Việc sử dụng các phương pháp số đòi hỏi phải biết vùng thay đổi đáp án có thể xảy ra, và nếu các giới hạn càng lớn thì hiệu quả sử dụng các phương pháp số càng lớn. Trong trường hợp tiêu chí là hàm tuyến tính, các giới hạn là bộ bất đẳng thức tuyến tính, quy trình một bước, bài toán đồng dạng được giải bằng các phương pháp lập trình tuyến tính /9,10/. Nếu tiêu chí và các gi,ới hạn là các hàm phi tuyến lời giải và quá trình một bước, tức là bài toán đồng dạng sẽ được giải bằng các phương pháp lập trình phi tuyến. Lập trình hình học là phương pháp tối ưu hóa toán học, cho phép giải các bài toán tối ưu trong các trường hợp khi hàm mục tiêu và các giới hạn biểu diễn dưới dạng các hàm phi tuyến đặc biệt /9/. Các phương pháp tìm kiếm thông thường chỉ được xây dựng để tìm cực trị các hàm một biến, tức là các hàm có cực trị duy nhất trên khoảng giá trị xác định Phương pháp xác định ngẫu nhiên dùng để tìm kiếm cực trị các hàm đa biến với các giới hạn bất kỳ /9, 10/. Sử dụng các phương pháp phân tích thường là các phương pháp số tốt nhất, bởi vì các phương pháp phân tích cho phép thu được bức tranh chung và tương đối đầy đủ hàm nghiên cứu, xác định ảnh hưởng của các yếu tố khác nhau lên hàm này. Các phương pháp phân tích được sử dụng khi tiêu chí được thể hiện bằng các hàm mục tiêu, các hàm này phải ít nhất được lấy vi phân bậc hai và có số lượng giới hạn các điểm gián đoạn. Để sử dụng các phương pháp tối ưu hóa truyền thống – các phương pháp tính toán biến đổi và vi phân nhất định phải không tồn tại các giới hạn. Khi tồn tại các điều kiện giới hạn thì điều kiện cực trị được xác định, tức là giải được bài toán Lagrăng. Nguyên lý cực đại L.C Poltriagin được áp dụng trong điều kiện khi mà có các giới hạn và lời giải là hàm đối số, nhưng mô hình là bộ phụ thuộc giải tích /9, 10/. Thuật toán chuyển tiếp sang bài toán tối ưu vô điều kiện . Ở trên chúng ta đã trình bày các phương pháp giải bài toán tối ưu có điều kiện. Phương pháp nhân Lagrang được dùng trong Excel bản chất là biến đổi bài toán tối ưu hóa có điều kiện thành bài toán tối ưu hóa vô điều kiện. Việc này được thực hiện theo thuật toán chuyển từ bài toán tối ưu có điều kiện sang bài toán tối ơu vô điều kiện bằng phương pháp nhân Lagrang /4, 24, 45/: 1. Biến đổi các giới hạn – bất đẳng thức thành các phương trình: V i (x j ) = g i (x j ) – b j ; i = 1…m; j = 1…n. 2. Viết các điều kiện giới hạn dưới dạng: V i (x i )= 0; i = 1…m; j = 1…n Biến đổi các điều kiện biên. Bài toán tối ưu hóa có điều kiện có dạng: (3.71) 3. Bài toán (3.71) biểu diễn dưới dạng hàm Lagrang: (3.72) Trong đó hệ số Lagrang. 4. Xác định đạo hàm riêng và các thành phần của hệ phương trình: (3.73) 5. Giải hệ (3.73) xác định các giá trị . 6. Thay giá trị vào biểu thức (3.72). Khi đó (3.72) sẽ trở thành bài toán tối ưu vô điều kiện. 3.2.4. Giải các bài toán tối ưu vô điều kiện. Thuật toán phương pháp tối ưu vô điều kiện ở dạng tổng quát. Ý tưởng tìm cực trị như sau /4, 45, 68/: 1. Đầu tiên cần cho các tọa độ điểm đầu tìm kiếm x j 0 , j = 1…n. Tốt nhất là chọn điểm đầu x j 0 càng gần cực trị tìm kiếm để giảm thời gian tìm kiếm. 2. Tại điểm này xác định hướng di chuyển ở bước đầu tiên β 1 . 3. Lấy giá trị bước t 1 . 4. Xác định các tọa độ cuối bước 1 x j 1 . 5. Tính toán các giá trị dấu hiệu cực trị tại bước 1. 6. Kiểm tra thỏa mãn dấu hiệu cực trị. Nếu điều kiện dấu hiệu cực trị thỏa mãn thì kết luận rằng cực trị tại điểm x j 0 , nếu không thì thực hiện tiếp bước thứ hai và cứ như vậy cho đến khi thỏa mãn điều kiện đạt cực trị. Các phương pháp cơ bản tìm kiếm lời giải trong các bài toán tối ưu vô điều kiện và miêu tả phương pháp đã chọn. Trong thuật toán đã trình bày không cho biết việc chọn hướng và độ dài bước trên mỗi khoảng lặp lại. Đây là vấn đề quan trọng, bởi vì nó quyết định việc nhanh chóng tìm ra kết quả và độ chính xác các kết quả đạt được, tức là số lượng lặp lại mà nhờ đó tìm được cực trị. Có nhiều phương pháp chọn hướng và độ dài bước khác nhau, một số phương pháp được tích hợp trong Excel /45/. Các phương pháp tìm kiếm để xác định hướng β và giá trị bước t chỉ sử dụng giá trị hàm mục tiêu được gọi là các phương pháp bậc không /45, 68/. Các phương pháp gradien hay các phương pháp bậc 1 – là các phương pháp mà việc xác định hướng β hay bước t sử dụng các giá trị đạo hàm bậc 1 của hàm mục tiêu và xác định gradien của nó /45, 68/. Các phương pháp Newton hay các phương pháp bậc hai gọi là các phương pháp mà việc xác định hướng β và bước t sử dụng các giá trị đạo hàm bậc hai của hàm mục tiêu /45, 68/. Bậc của các phương pháp càng cao số lượng tính toán trong mỗi lần lặp lại càng lớn, nhưng số lần các lặp lại thì lại nhỏ, và ngược lại. Các phương pháp gradien không đòi hỏi số lượng tính toán trong mỗi lần lặp lại, bởi vì chỉ tính toán hàm mục tiêu và đạo hàm bậc 1 /45/. Bản chất của phương pháp Newton là xây dựng trình tự các điểm { x k }, k = 0,1,…, sao cho f(x k+1 )< f(x k ) . Các điểm liên tiếp được tính toán theo nguyên tắc /68/: x k+1 = x k + β k (3.74) trong đó x 0 – cho bởi người dùng, còn hướng suy giảm β k xác định đối với từng giá trị k theo công thức: β k = -H -1 (x k ) ∇ f(x k ), (3.75) trong đó H(x) – ma trận Hesse; ) ∇ f(x k ) – gradien hàm f(x), tính tại điểm x k . công thức (3.75) thu được từ các phân tích sau /68/: 1. Hàm f(x) xấp xỉ tại mỗi điểm liên tiếp {x k } bằng hàm bình phương: (3.76) 2. Hướng β k xác định từ điều kiện cần thiết cực trị bậc 1: . Như vậy khi thỏa mãn yêu cầu H(x k ) > 0 trình tự là các trình tự các điểm cực tiểu của hàm bậc hai G k , k = 0, 1, … Để đảm bảo thỏa mãn các yêu cầu f(x k+1 )< f(x k ) , thâm trí trong các trường hợp khi mà với giá trị nào đó của ma trận Hesse H(x k ) không xác định dương, khuyến cáo đối với giá trị k tương ứng tính toán điểm x k+1 theo phương pháp gradien suy giảm: x k+1 = x k t k ∇ f(x k ) , (3.77) trong đó t k – giá trị bước chọn theo điều kiện: (3.78) Việc xây dựng trình tự {x k } kết thúc tại điểm x k , với (3.79) Trong đó số dương nhỏ cho trước hay khi k≥ N, trong đó N – số lượng lần lặp lại xác định hay đồng thời thỏa mãn hai bất đẳng thức: (3.80) Trong đó là số dương rất nhỏ. Như vậy có thể trình bày thuật toán chính xác giải bài toán tối ưu vô điều kiện bằng phương pháp Newton /68/ trình bày trên hình 3. Hình 3.46. Thuật toán giải bài toán tối ưu vô điều kiện bằng phương pháp Newton. 3.2.5. Các giá trị tối ưu tham số kết cấu của cơ cấu thủy lực điều khiển lái. Mô hình chọn giá trị đường kính các lỗ dãy động cơ thủy lực của bộ phân phối thủy lực với mục tiêu làm cho các đặc tính, chỉ số ổn định và chất lượng hệ thống thủy lực điều khiển lái phù hợp với các tiêu chí hiệu suất và các biện pháp tiêu chuẩn hóa các quá trình công tác. 1. Nhập số liệu ban đầu (hình 3.47): Các giá trị ban đầu của các đường kính thay đổi d 0 và thể tích công tác q; Các điều kiện biên đối với d 0 ; Mối quan hệ xác định áp suất p. 2. Tại các ô thể hiện kết quả quy định số lượng ký hiệu sau dấu phẩy. 3. Gọi cửa hội thoại “Пойск решения” (hình 3.48). 4. Nhập bài toán tối ưu: Cho hàm mục tiêu, cực tiểu hóa; Cho các ô thay đổi phù hợp với biến lựa chọn; Cho các điều kiện biên. 5. Gọi cửa hội thoại “Параметры поиска решения” và giá trị các tham số tìm lời giải (hình 3.49). 6. Thực hiện tìm lời giải. Kết quả tối ưu trình bày trên hình 3.50. Hình 3.47. Cử sổ nhập dữ liệu ban đầu Hình 3.48 Cửa hội thoại tìm đáp án Hình 3.49 Cửa hội thoại tham số tìm lời giải “Параметры поиска решения” Hình 3.50. Kết quả tối ưu giá trị đường kính các lỗ dãy động cơ thủy lực với mục tiêu tạo áp suất hợp lý hàm mục tiêu trong bộ phân phối thủy lực Như vậy thay đổi hàm mục tiêu phụ thuộc vào thể tích công tác của động cơ thủy lực tín hiệu ngược giúp thu được các giá trị tham số kết cấu hợp lý đối với mỗi dạng kích thước của bơm. Các kết quả tối ưu giá trị đường kính các lỗ dãy động cơ thủy lực nhằm tạo áp suất tương thích trong bộ phân phối thủy lực hàm mục tiêu (3.4): với q 1 = 80.10 -6 m 3 ; q 2 = 125.10 -6 m 3 ; q 3 = 160.10 -6 m 3 ; q 4 = 200.10 -6 m 3 , giá trị đường kính lỗ tối ưu của dãy động cơ thủy lực lấy là d 0 * = 36.10 -4 m thì cho các giá trị hàm mục tiêu p 1 = 6,281 Mpa; p 2 = 7,021 Mpa; p 3 = 7,625 Mpa; p 4 = 8,044 Mpa; với q 5 = 250.10 -6 m 3 , d 0 * = 35,611.10 -4 m thì giá trị hàm mục tiêu p 5 = 8,694 Mpa. Các kết quả tối ưu giá trị đường kính các lỗ của dãy động cơ thủy lực nhằm tạo sự tương thích hệ số dao động hàm mục tiêu (3.5) với giá trị hàm mục tiêu M = 0%: khi q 1 = 80.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,264.10 -4 m; với q 2 = 125.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,211.10 -4 m; với q 3 = 160.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,05.10 -4 m; với q 4 = 200.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 26.10 -4 m; với q 5 = 250.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 26,017.10 -4 m. Các kết quả tối ưu giá trị đường kính các lỗ của dãy động cơ thủy lực nhằm tạo sự tương thích giá trị lưu lượng chất lỏng công tác vượt ngưỡng trong hệ thống thủy lực điều khiển lái của hàm mục tiêu (3.6) với giá trị hàm mục tiêu M = 0%: q 1 = 80.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,264.10 -4 m; q 2 = 125.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,211.10 -4 m; q 3 = 160.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 27,05.10 -4 m; q 4 = 200.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 26,118.10 -4 m; q 5 = 250.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 26,017.10 -4 m. Các kết quả tối ưu giá trị đường kính các lỗ của dãy động cơ thủy lực nhằm tạo sự tương thích thời gian điều chỉnh hàm mục tiêu (3.7): q 1 = 80.10 -6 m 3 q 2 = 125.10 -6 m 3 ; q 3 = 160.10 -6 m 3 ; q 4 = 200.10 -6 m 3 ; q 5 = 250.10 -6 m 3 lấy giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực d 0 * = 25.10 -4 m với các giá trị hàm mục tiêu t ПП 1 =0,072 s; t ПП 2 =0,145 s; t ПП 3 =0,226 s; t ПП 4 =0,338 s; t ПП 5 = =0,421 s. Từ các kết quả đã trình bày dễ thấy rằng đường kính các lỗ của dãy động cơ thủy lực có các giá trị khác nhau khi cho tương thích các đặc tính đầu ra và các chỉ số chất lượng với các bước hoàn chỉnh các quá trình công tác trong hệ thống thủy lực điều khiển lái, vì vậy đề xuất hướng lực chọn tham số tối ưu với việc tính toán giá trị hiệu chỉnh trên từng bước theo tiêu chí véc tơ hiệu suất. Các kết quả tối ưu tham số nghiên cứu được trình bày trong bảng 3 và thể hiện dưới dạng đồ thị hình 3.51. Bảng 3.1 Sự phụ thuộc các giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực vào thể tích công tác của động cơ thủy lưc tín hiệu ngược và các giá trị hàm mục tiêu. q.10 -6 , m 3 d * .10 -4 , m p.10 6 , Pa M, % σ % t ПП , s 80 28,501 8,95 2,14 7,08 0,114 125 28,417 10,75 2,23 9,22 0,21 160 28,263 12,31 2,55 10,86 0,264 200 28,453 14,88 4,05 12,15 0,364 250 29,907 14,18 11,8 14,91 0,437 Hình 3.51. Sự phụ thuộc các giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực vào thể tích công tác của động cơ thủy lực tín hiệu ngược. Từ đồ thị dễ thấy đường đặc trưng khi tiến gần tới vùng các giá trị không cho phép thay đổi hướng, điều này cho thấy việc tối ưu thành công. Tuy nhiên để chứng minh việc nâng cao hiệu suất hệ thống thủy lực điều khiển lái sau khi tối ưu các tham số kết cấu cần tiến hành so sánh các giá trị số của hàm mục tiêu tại các giá trị tối ưu đường kính các lỗ của dãy động cơ thủy lực và tại các giá trị tham số này của kết cấu thực. Để thực hiện việc này cần xây dựng sự phụ thuộc áp suất bơm, hệ số tiêu hao lưu lượng chất lỏng công tác tại đầu ra, giá trị lưu lượng chất lỏng công tác vượt ngưỡng và thời gian điều chỉnh với giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược đã được tối ưu kết cấu và loại nhập khẩu từ nước ngoài (hình 3.52). Hình 3.52. Sự phụ thuộc các giá trị số hàm mục tiêu vào thể tích công tác của động cơ thủy lực tín hiệu ngược. Từ kết quả thu được trên đồ thị cho thấy cần tối ưu các đường kính lỗ dãy động cơ thủy lực. Các kết quả tính toán cho thấy các giá trị số hàm mục tiêu của các giá trị đường kính lỗ của dãy động cơ thủy lực cơ cấu thủy lực điều khiển lái sản xuất trong nước hiện nay cao hơn các giá trị tôi ưu. Các giá trị hàm mục tiêu tại các đường kính lỗ của dãy động cơ thủy lực cơ cấu thủy lực điều khiển lái nhập khẩu và các tham số nghiên cứu tối ưu thực tế là bằng nhau. Sai lệch các giá trị số hàm mục tiêu của cơ cấu thủy lực điều khiển lái sản xuất trong nước và nhập khẩu so với hệ thống đã được tối ưu trình bày trong bảng 3.2. Tổng hợp các giá trị tối ưu góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích các chỉ số chất lượng của bộ phân phối thủy lực hệ thống thủy lực điều khiển lái với các bước hợp hoàn thiện các quá trình công tác. Các kết quả tối ưu giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích lưu lượng chất lỏng công tác vượt ngưỡng khi bật dẫn động thủy lực hàm mục tiêu (3.8): q 1 = 80.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 6,492.10 -2 rad với giá trị hàm mục tiêu σ VKL1 = 3,877%; q 2 = 125.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 6,505.10 -2 rad với giá trị hàm mục tiêu σ VKL2 = 3,877%; q 3 = 160.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 6,513.10 -2 rad với giá trị hàm mục tiêu σ VKL3 = 6,942%; q 4 = 200.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 6,757.10 -2 rad với giá trị hàm mục tiêu σ VKL4 = 9,174%; q 5 = 250.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 8,5.10 -2 rad với giá trị hàm mục tiêu σ VKL5 = 11,468%; Bảng 3.2 Sai lệch tối đa giá trị số hàm mục tiêu tại các giá trị đường kính các lỗ của dãy động cơ thủy lực so với các giá trị tối ưu Các hàm mục tiêu Hệ thống nước ngoài, % Hệ thống trong nước, % p.10 6 , Pa 2,36 6,78 M,% 3,17 20,71 σ, % 5,23 7,25 t ПП , s 2,11 4,86 Các kết quả tối ưu góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích thời gian chễ thực khi đóng dẫn động hàm mục tiêu (3.9): với tất cả các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược lấy các giá trị tối ưu góc vùng không nhạy cảm γ * = 2.10 -2 rad với giá trị hàm mục tiêu τ = 2.10 -2 s. Các kết quả tối ưu giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích lưu lượng chất lỏng công tác vượt ngưỡng khi tắt dẫn động thủy lực hàm mục tiêu (3.12): q 1 = 80.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 7,842.10 -2 rad với giá trị hàm mục tiêu σ VKL1 = 4,03%; q 2 = 125.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 7,991.10 -2 rad với giá trị hàm mục tiêu σ VKL2 = 4,02%; q 3 = 160.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 8,347.10 -2 rad với giá trị hàm mục tiêu σ VKL3 = 4,271%; q 4 = 200.10 -6 m 3 và q 5 = 250.10 -6 m 3 lấy các giá trị góc vùng không nhạy cảm γ * = 8,5.10 -2 rad với giá trị hàm mục tiêu σ VKL4 = 4,077% và σ VKL5 = 4,042%; Các kết quả tối ưu giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích thời gian điều chỉnh khi tắt dẫn động thủy lực hàm mục tiêu (3.11): tại tất cả các giá trị thể tích công tác động cơ thủy lực tín hiệu ngược lấy các giá trị tối ưu góc vùng không nhạy cảm γ * = 8,5.10 -2 rad với giá trị hàm mục tiêu t ПП1 = 0,252 s; t ПП2 = 0,259 s; t ПП3 = 0,27 s; t ПП4 = 0,286 s; t ПП5 = 0,281 s; Các kết quả tối ưu giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo tương thích hệ số dao động khi tắt dẫn động thủy lực hàm mục tiêu (3.10): q 1 = 80.10 -6 m 3 lấy các giá trị tối ưu góc vùng không nhạy cảm γ * = 3,971.10 -2 rad; q 2 = 125.10 -6 m 3 lấy giá trị γ * = 3,594.10 -2 rad; q 3 = 160.10 -6 m 3 lấy giá trị γ * = 3,594.10 -2 rad; q 4 = 200.10 -6 m 3 lấy giá trị γ * = 3,22.10 -2 rad; q 5 = 250.10 -6 m 3 lấy giá trị γ * = 3,203.10 -2 rad với các giá trị hàm mục tiêu M = 0%. Các kết quả tối ưu hóa giá trị các góc vùng không nhạy cảm trình bày trong bảng"
    },
    {
      "id": "3.3",
      "title": "Phương pháp tính toán lựa chọn các tham số cơ bản của cơ cấu thủy lực điều khiển lái.",
      "content": "3.3 và trình bày dưới dạng đồ thị 3.53. Bảng 3.3 Sự phụ thuộc các giá trị tối ưu góc vùng không nhạy cảm của bộ phân phối thủy lực vào thể tích công tác của bộ phân phối thủy lực tín hiệu ngược vào giá trị hàm mục tiêu. q.10 -6 , m 3 γ *.10 -2 rad σ VKL , % τ.10 -2 , s σ ОТК L , % t ПП , s M , % 80 5,761 4,272 5,761 7,588 0,441 0 125 5,718 5,969 5,718 6,545 0,432 0 160 5,717 7,129 5,717 6,031 0,427 0 200 5,795 9,495 5,795 5,355 0,417 0 250 6,141 11,598 6,141 2,257 0,398 0 Từ đồ thị thấy rằng đường đồ thị nằm trong vùng các giá trị cho phép và khi tăng thể tích công tác của động cơ thủy lực đường đồ thị tăng mạnh. Sự phụ thuộc giá trị chất lỏng công tác vượt ngưỡng khi bật và khi tắt, thời gian chễ thực tế khi đóng dẫn động thủy lực, thời gian quá trình chuyển tiếp khi tắt dẫn động thủy lực vào thể tích công tác của động cơ thủy lực tín hiệu ngược khi tối ưu hóa các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực và sản phẩm nhập khẩu trình bày trên hình 3.54. Hình 3.53. Sự phụ thuộc giá trị tối ưu góc vùng không nhạy cảm của bộ phân phối thủy lực vào thể tích công tác của động cơ thủy lực tín hiệu ngược. Hình 3.54. Sự phụ thuộc các giá trị số hàm mục tiêu vào giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược Từ đồ thị hình 3.54 dễ thấy với các giá trị góc vùng không nhạy cảm đã chọn khi tăng thể tích công tác của động cơ thủy lực tín hiệu ngược các giá trị chất lỏng công tác vượt ngưỡng tại đầu ra của cơ cấu thủy lực điều khiển lái và thời gian chễ thực tế khi bật dẫn động thủy lực tăng lên. Lượng chất lỏng công tác vượt ngưỡng và thời gian của quá trình chuyển tiếp khi tắt dẫn động thủy lực thì ngược lại, lại giảm xuống, còn hệ số dao động lấy giá trị bằng 0. Tất cả các yếu tố này nói lên rằng việc tối ưu hóa đã thành công. Sai lệch cực đại các giá trị số của hàm mục tiêu hệ thống thủy lực điều khiển lái sản xuất trong và ngoài nước so với hệ thống tối ưu hóa trình bày trong bảng 3.4. Bảng 3.4 Sai lệch tối đa các giá trị số hàm mục tiêu tại các giá trị góc vùng không nhạy cảm của bộ phân phối thủy lực hiện nay so với các giá trị tối ưu. Các hàm mục tiêu Hệ thống nước ngoài, % Hệ thống trong nước, % σ VKL , % 4,26 12,33 τ.10 -2 , s 0,16 0,92 σ ОТК L , % 7,95 5,71 t ПП , s 0,25 0,56 Tổng hợp các giá trị tối ưu góc vùng không nhạy cảm của bộ phân phối thủy lực với mục tiêu tạo sự tương thích các chỉ số chất lượng của hệ thống thủy lực điều khiển lái với các bước hoàn chỉnh các quá trình công tác. Các kết quả tối ưu giá trị diện tích thiết diện thông qua của các rãnh giảm tải với mục tiêu tạo tương thích giá trị chất lỏng công tác vượt ngưỡng trong hàm mục tiêu (3.13) như sau: tại tất cả các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược các giá trị tối ưu diện tích thiết diện thông qua của các rãnh giảm tải lấy giá trị f SL * = 1,5.10 -4 m 2 ứng với các giá trị hàm mục tiêu σ 1 = 3,676 %; σ 2 = 5,034 %; σ 3 = 6,032%; σ 4 =7,327%; σ 5 = 8,163%. Các kết quả tối ưu giá trị diện tích thiết diện thông qua của các rãnh giảm tải với mục tiêu tạo tương thích thời gian điều chỉnh hàm mục tiêu (3.14) như sau: tại tất cả các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược các giá trị tối ưu diện tích thiết diện thông qua của các rãnh giảm tải lấy giá trị f SL * = 1,5.10 -4 m 2 ứng với các giá trị hàm mục tiêu t ПП 1 = 0,144 s; t ПП 2 =0,158 s; t ПП 3 = 0,169 s; t ПП 4 =0,175 s; t ПП 5 =0,182 s. Để khẳng định sự cần thiết tối ưu hóa tham số nêu trên chúng ta biểu diễn mối quan hệ giữa giá trị các hàm mục tiêu với các giá trị khác nhau của thể tích công tác động cơ thủy lực tại các giá trị tối ưu của diện tích thiết diện rãnh xả của bộ phân phối thủy lực của các hệ thống sản xuất trong nước và nhập khẩu, mối quan hệ này thể hiện trên hình 3.55. Từ đồ thị dễ thấy rằng các giá trị chỉ số chất lượng tăng cùng với sự ra tăng thể tích công tác của động cơ thủy lực tại các giá trị diện tích thiết diện các rãnh giảm tải tối ưu. Bảng 3.5 Sự phụ thuộc các giá trị tối ưu diện tích thiết diện thông qua của các rãnh giảm tải với thể tích công tác của động cơ thủy lực tín hiệu ngược và các giá trị hàm mục tiêu. q.10 -6 , m 3 f SL * .10 -4 , m 2 σ % t ПП , s 80 1,5 3,676 0,144 125 1,5 5,034 0,158 160 1,5 6,032 0,169 200 1,5 7,327 0,175 250 1,5 8,163 0,182 Sai lệch tối đa các giá trị số của hàm mục tiêu của hệ thống thủy lực điều khiển lái trong nước và nhập khẩu so với hệ thống tối ưu trình bày trong bảng 3.6 Bảng 3.6 Sai lệch tối đa các giá trị số của hàm mục tiêu tại các giá trị diện tích thiết diện thông qua của các rãnh giảm tải hiện nay so với các giá trị tối ưu Các hàm mục tiêu Hệ thống nước ngoài, % Hệ thống trong nước, % σ, % 2,62 4,17 t ПП , s 0,31 1,43 Hình 3.55. Sự phụ thuộc các giá trị hàm mục tiêu vào các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược. Như vậy bằng cách so sánh các giá trị số hàm mục tiêu của hệ thống tối ưu với các giá trị số hàm mục tiêu của các hệ thóng nhập khẩu và sản xuất trong nước chúng ta đã khẳng xác định được hiệu suất tối ưu các tham số kết cấu cơ bản của bộ phân phối thủy lực cơ cấu thủy lực điều khiển lái. Sai lệch tối đa các chỉ số của hệ thống trong nước so với hệ thống tối ưu khoảng 27%, còn so với hệ thống nhập khẩu là khoảng 7,9 %. 3.2.6. Nghiên cứu quỹ đạo của xe với cơ cấu thủy lực điều khiển lái tối ưu và của cơ cấu lắp trên xe. Để hình dung xe trong quá trình quay vòng với xe có các tham số kết cấu của cơ cấu thủy lực điều khiển lái đã được tối ưu, chúng ta xây dựng quỹ đạo lý thuyết quay vòng của xe cẩu TO – 30 với các tham số tối ưu cơ cấu thủy lực điều khiển lái và cơ cấu thực lắp trên xe. Để làm rõ việc tối ưu hóa cơ cấu thủy lực điều khiển lái để đảm bảo cho xe hoạt động ở những chế độ nào là tốt nhất và chế độ làm việc ảnh hưởng đến chất lượng quay vòng như thế nào chúng ta nghiên cứu hai chế độ hoạt động: chế độ di chuyển và chế độ công tác (cẩu hàng). Chế độ bốc dỡ hàng hóa xác định tải trọng của thiết bị công tác, sự thay đổi tải trọng tải trọng dẫn đến sự thay đổi trọng tâm và các đặc trưng quán tính của xe. Trong quá trình nghiên cứu đối với xe cẩu TO – 30, khối lượng tải trọng trong gầu xúc thay đổi từ 0 đến 2,2 tấn. Các quỹ đạo chuyển động được tính toán tại các vận tốc chuyển động cực đại ở mỗi tay số (trừ số 1): ở tay số 2 là 3 m/s, tay số 3 là 6 m/s, tay số 4 là 10 m/s. Trên hình 3.56, 3.57 trình bày các quỹ đạo chuyển động quay vòng của xe cầu T-30 ở chế độ di chuyển và công tác với các chế độ vận tốc đã trình bày và với khối lượng hàng trong gàu xúc là 2,2 tấn. Trên biểu đồ đường liền là ký hiệu quỹ đạo quay vòng lý tưởng được tính toán có kể tới động học quay vòng của xe có khung bản lề khớp động. Quỹ đạo được tính toán khi tạo tác động điều khiển trình bày trên hình 3.2, tức là khi quay đều tay lái. Trên đồ thị quan sát thấy quỹ đạo lý tưởng và quỹ đạo tính toán không trùng nhau, chúng ta quan sát thấy quỹ đạo ngoằn ngoèo, cho thấy tính không hoàn hào của các quá trình chuyển tiếp tăng và giảm lưu lượng và áp suất chất lỏng công tác trong hệ thống thủy lực điều khiển lái. Hình 3.56. Các quỹ đạo quay vòng lý thuyết xe cẩu TO-30 có cơ cấu thủy lực điều khiển lái đã được tối ưu ở chế độ vận tải với các vận tốc di chuyển khác nhau. Hình 3.57. Các quỹ đạo quay vòng lý thuyết xe cẩu TO-30 có cơ cấu điều khiển lái bằng thủy lực nguyên bản và đã được tối ưu ở chế độ công tác với các vận tốc di chuyển khác nhau. Phân tích các quỹ đạo trên cho thấy rằng, ở các vận tốc chuyển động lớn chất lượng quỹ đạo giảm đáng kể: tăng độ ngoằn ngoèo, tăng thời gian xe trở về quỹ đạo đã giả định, giảm độ dự trữ ổn định khi quay vòng. Ở chế độ di chuyển quỹ đạo ngoằn ngoèo của xe thay đổi lớn, khi đầy tải độ ngoằn ngoèo giảm. Để chứng minh tính ổn định và chất lượng quỹ đạo quay vòng xe tăng lên chúng ta đã so sánh các giá trị số độ lệch quỹ đạo, độ dao động và thời gian quay trở về quỹ đạo giả định của xe cẩu TO – 30 với cơ cấu thủy lực điều khiển lái cơ sở và tối ưu tại các vận tốc chuyển động và chế độ hoạt động khác nhau. Sai lệch cực đại các chỉ số chất lượng và độ ổn định quỹ đạo của xe TO-30 với cơ cấu thủy lực điều khiển lái nguyên bản so với phương án đã được tối ưu trình bày trên hình 3.7 và 3.8. Các kết quả thu được cho thấy rằng tính hợp lý tối ưu các tham số kết cấu chính của cơ cấu thủy lực điều khiển lái. Độ lệch ngoằn ngoèo quỹ đạo di chuyển giảm xuống tối thiểu ở chế độ chuyển động. Giá trị sai lệch chỉ số quỹ đạo của xe đã được tối ưu và nguyên bản là 14,21% ở chế độ di chuyển và 4,56% ở chế độ gàu đầy, tức là hiệu suất đạt cực đại khi xe di chuyển với vận tốc cực đại. Bảng 3.7 Sai lệch cực đại các chỉ số ổn định và chất lượng quá trình quay vòng xe cẩu TO-30 với cơ cấu thủy lực điều khiển lái cơ sở và tối ưu ở chế độ di chuyển với vận tốc lớn nhất. Các chỉ số V 1 = 3 m/s V 2 = 6 m/s V 3 = 10 m/s M, % 2,17% 7,55% 14,21% σ , % 1,06% 3,34% 9,41% t ПП , s 0,75% 5,13% 6,36% Bảng 3.8 Sai lệch cực đại chỉ số ổn định và chất lượng quá trình quay vòng xe cẩu TO-30 với cơ cấu thủy lực điều khiển lái nguyên bản và tối ưu ở chế độ di chuyển với các vận tốc khác nhau. Các chỉ số V 1 = 3 m/s V 2 = 8 m/s M, % 0,95% 4,56% σ , % 1,03% 3,21% t ПП , s 0,07% 1,25% Phân tích quỹ đạo chuyển động cho thấy rằng ở chế độ di chuyển với cơ cấu thủy lực điều khiển lái nguyên bản xe không thể chạy với tốc độ tối đa do sự tăng biên độ ngoằn ngoèo (độ lệch biên độ) lên 5% so với quỹ đạo lỹ tưởng. Vận tốc xe đạt được là 7,8 m/s với giá trị độ lệch biên độ tối đa. Cơ cấu thủy lực điều khiển lái với các tham số tối ưu cho phép giảm độ lệch quỹ đạo của xe và từ đó làm tăng vận tốc di chuyển tối đa lên 9,6 m/s. 3.3 Phương pháp tính toán lựa chọn các tham số cơ bản của cơ cấu thủy lực điều khiển lái. Nghiên cứu lý thuyết đã trình bày cho phép tính toán lựa chọn các tham số kết cấu cơ bản của hệ thống thủy lực điều khiển lái theo hai giai đoạn: Chọn thể tích công tác của động cơ thủy lực tín hiệu ngược q ; Chọn các giá trị hợp lý đường kính các lỗ của dãy động cơ thủy lực d , góc vùng không nhạy cảm của bộ phân phối thủy lực γ và diện tích thiết diện thông qua của các rãnh giảm tải f SL . Thuật toán phương pháp tính toán lựa chọn các tham số kết cấu chính trình bày trên hình 3.58. Phương pháp tính toán lựa chọn như sau: 1. Lựa chọn thể tích công tác của động cơ thủy lực tín hiệu ngược: Trong phần 1.5 đã trình bày yêu cầu đối với việc quay vòng hoàn toàn xe sau 5 vòng quay tay lái. Vì vậy để tính toán cần: 1.1 Chỉ ra xe cơ sở lắp cơ cấu thủy lực điều khiển lái. 1.2 Làm rõ kiểu các xi lanh thủy lực quay vòng trên xe này. 1.3 Biết được các tham số của các xi lanh thủy lực, tính toán thể tích các xi lanh thủy lực và tính thể tích động cơ thủy lực tín hiệu ngược theo công thức (1.3): Nếu giá trị thể tích công tác tương ứng với các giá trị tiêu chuẩn thì chuyển sang mục 2.1; Nếu giá trị thể tích công tác không tương ứng với các giá trị tiêu chuẩn thì làm tròn đến giá trị tiêu chuẩn gần nhất và chuyển sang mục 2.1. Do nghiên cứu các giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược dưới 250.10 -6 m 3 , nên theo yêu cầu 1.3 các kết quả nghiên cứu lý thuyết và bản thân phương pháp có thể áp dụng cho các xe có thể tích công tác của các xi lanh thủy lực dưới 1,25.10 -3 m 3 . 2. Chọn các giá trị tham số kết cấu hợp lý: 2.1 Chọn số liệu ban đầu để giải các mô hình toán, tức là các giá trị của các tham số ổn định. Đối với mô hình dẫn động thủy lực chọn công suất bơm, các tham số chất lỏng công tác, các tham số ống thủy lực, các tham số của bộ phân phối thủy lực, các tham số của động cơ thủy lực tín hiệu ngược, các tham số của van an toàn và các tham số của xi alnh thủy lực. Đối với mô hình đất chọn độ lệch bình phương trung bình, hệ số chu kỳ và hệ số tắt dần. Đối với mô hình quay vòng xe chọn khối lượng vật thể, Ten xơ quán tính của vật thể tương đối với các trục của hệ tọa độ phụ gắn với tâm khối, hệ tọa độ đề các của các điểm đặc trưng gắn với vật thể, tọa độ tâm khối của của vật thể và nếu cần – tọa độ số lượng điểm bất kỳ của các điểm đặc trưng khác, ví dụ như các tâm bản lề gắn với vật thể hoặc các điểm đặt ngoại lực và mô men ngoại lực. Hình 3.58. Thuật toán tính toán chọn các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái. 2.2 Xác định các tham số kết cấu biến thiên và chọn các giá trị của chúng. 2.3 Giải mô hình toán trên máy tính. 2.4 Phân tích sự ảnh hưởng của các tham số kết cấu đã chọn đến các đặc tính đầu ra và các chỉ số chất lượng của hệ thống, tức là làm rõ quy luật của các quá trình. 2.5 Biểu diễn bài toán tối ưu theo biểu thức (3.3), tức là: xác định hàm mục tiêu, cho các giới hạn và các điều kiện. 2.6 Xấp xỉ các mối quan hệ của các đặc tính đầu ra và các chỉ số chất lượng với các tham số biến thiên nhận được khi thực hiện mục 2.4 bằng phương pháp bình phương nhỏ nhất. 2.7 Chuyển bài toán tối ưu có điều kiện sang bài toán tối ưu vô điều kiện bằng phương pháp hệ số Lagrange, loại bỏ các ràng buộc và điều kiện biên ra khỏi bài toán tối ưu. 2.8 Giải bài toán tối ưu vô điều kiện bằng phương pháp Newton. 2.9 Nhận các giá trị hợp lý các tham số kết cấu biến thiên phù hợp với từng hàm mục tiêu đối với mỗi giá trị thể tích công tác của động cơ thủy lực tín hiệu ngược. 2.10 Tính toán các giá trị hiệu chỉnh của các tham số kết cấu biến thiên đối với từng giá trị thể tích công tác động cơ thủy lực tín hiệu ngược. 3.4 Phần mềm tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái. Trên cơ sở đề xuất thuật toán tính toán lựa chọn các tham số kết cấu cơ bản và cơ sở dữ liệu với bộ dữ liệu bao hàm các kết quả giải mô hình toán, cũng như khối dữ liệu các mối quan hệ phụ thuộc đặc tính đầu ra, các chỉ số chất lượng và ổn định của hệ thống thủy lực điều khiển lái với các tham số kết cấu của cơ cấu thủy lực điều khiển lái tại các giá trị tham số không đổi khác nhau có thể xây dựng chương trình để tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái. Đề xuất xây dựng phần mềm để tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái trong môi trường tích hợp Borland Delphi 7, cho phép tạo ra ứng dụng Windows với việc sử dụng cơ sở dữ liệu dựa trên cơ sở lập trình hướng đối tượng. Phần mềm để tính toán với vai trò là công cụ tính toán gồm hai giai đoạn. Giai đoạn đầu tiên là thực hiện các thao tác tại cửa sổ thứ nhất (hình 3.59), trong đó giải bài toán lựa chọn động cơ thủy lực tín hiệu ngược. Việc lựa chọn động cơ thủy lực dễn ra như sau: Chọn kiểu xe cơ sở. Khi chọn xe cơ sở sử dụng thư viện dữ liệu về số xi lanh thủy lực, chiều dài và đường kính ống thủy lực để giải mô hình tóan dẫn động thủy lực và sử dụng thư viện dữ liệu về các tham số của xe: khối lượng bán khung, tọa độ các tâm khối và các điểm đặc trưng của xe, mô men quán tính v.v để giải mô hình toán quá trình quay vòng. Xác định rõ kiểu xi lanh thủy lực sử dụng. Sau khi chọn xi lanh thủy lực khởi động thư viện tham số xi lanh thủy lực để giải mô hình toán dẫn động thủy lực cũng như để xác định thể tích xi lanh thủy lực. Lấy các tham số cơ bản (đường kính cán và pistong, hành trình cán pistong, cũng như thể tích xi lanh) ra cửa sổ. Chọn kiểu động cơ thủy lực tín hiệu ngược: chọn kiểu bơm. Sau đó ấn nút “РАСЧЕТ”, tính toán thể tích công tác của động cơ thủy lực và khởi động thư viện các tham số của dẫn động thủy lực dùng để giải mô hình dẫn động thủy lực và để lựa chọn các giá trị tham số kết cấu một cách hợp lý: đó là thể tích công tác, kích thước bơm, đường kính các lỗ để cố định, thể tích và hiệu suất thủy cơ. Khi ấn nút “ДАЛЕЕ” chương trình tính sẽ chuyển sang cửa sổ thứ hai (hình 3.60), trong đó trên cơ sở của dữ liệu nhập vào tiến hành chọn các tham số kết cấu tối ưu. Việc chọn các tham số kết cấu thực hiện theo các bước sau đây: Chọn kiểu chất lỏng thủy lực sử dụng, sau đó chạy thư viện tham số chất lỏng công tác để giải mô hình toán dẫn động thủy lực. Nhập áp suất cực đại thiết lập bởi van an toàn, tức là nhập các điều kiện biên để giải bài toán tối ưu áp suất. Nhập giá trị hệ số dao động tối đa cho phép và lưu lượng chất lỏng công tác vượt ngưỡng tại đầu ra của cơ cấu thủy lực điều khiển lái, tức là nhập các điều kiện biên khi giải bài toán tối ưu. Hình 3.59. Cửa sổ chương trình tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái đối với cẩu TO – 30. Khi ấn nút “РАСЧЕТ” thực hiện giải bài toán tối ưu và giá trị các tham số kết cấu của bộ phân phối thủy lực phù hợp với đặc tính đầu ra và các chỉ số chất lượng được đưa ra màn hình. Từng giá trị tham số kết cấu được lấy ra để kiểm soát các tham số tối ưu. Như vậy phần mềm cho phép tính toán các tham số tối ưu của cơ cấu thủy lực điều khiển lái ở giai đoạn thiết kế và trong chế độ tự động. Hình 3.60. Cửa sổ chương trình tính các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái đối với cẩu TO -30. Kết luận chương: Việc nghiên cứu lý thuyết mô hình toán hệ thống thủy lực điều khiển lái đã giải quyết được các vấn đề sau: 1. Tổng hợp phân tích các tham số kết cấu: đường kính các lỗ dãy động cơ thủy lực trong xi lanh, góc vùng không nhạy cảm của bộ phân phối thủy lực, diện tích thiết diện thông qua của các rãnh giảm tải trong bơm nguồn của bộ phân phối thủy lực; xác định các giới hạn và khoảng các tham số biến thiên. 2. Trình bày các nghiên cứu ổn định hệ thống bằng phương pháp quỹ đạo pha; làm rõ các tham số ảnh hưởng đến tính ổn định của hệ thống thủy lực điều khiển lái: giá trị đường kính các lỗ của dãy động cơ thủy lực khi đóng dẫn động thủy lực; là rõ vùng ổn định của hệ thống theo các tham số kết cấu; xác định rõ giới hạn các tham số biến thiên ảnh hưởng đến tính ổn định. 3. Thu được các quá trình chuyển tiếp của hệ thống thủy lực điều khiển lái trong các dải rộng các tham số kết cấu của bộ phân phối thủy lực và động cơ thủy lực tín hiệu ngược; thu được mối quan hệ các chỉ số ổn định và các chỉ số chất lượng các đặc tính đầu ra với các tham số kết cấu cơ bản; đưa ra khuyến cáo chọn các giá trị các tham số kết cấu. 4. Thiết lập bài toán tối ưu trên cơ sở tạo tương thích các đặc tính đầu ra, các chỉ số chất lượng với các tiêu chí hiệu suất và các bước nâng cao chất lượng quá trình công tác của hệ thống thủy lực điều khiển lái. 5. Xấp xỉ các mối quan hệ giữa các đặc tính đầu ra, các chỉ số ổn định và chất lượng hệ thống thủy lực điều khiển lái với các tham số kết cấu của cơ cấu thủy lực điều khiển lái, các tham số này nhận được khi giải bài toán phân tích bằng phương pháp bình phương tối thiểu. 6. Phân tích thuật toán chuyển tiếp từ bài toán tối ưu hóa có điều kiện sang bài toán tối ưu hóa vô điều kiện bằng phương pháp hệ số Lagrang. 7. Giải bài toán tối ưu vô điều kiện các tham số kết cấu cơ bản bằng phương pháp Newton. 8. Tìm đáp án tối ưu theo véc tơ tiêu chí hiệu suất đối với các tham số kết cấu cơ bản của bộ phân phối thủy lực với các thể tích công tác khác nhau của động cơ thủy lực tín hiệu ngược. 9. Hiệu quả tối ưu đã được chứng minh bằng cách so sánh các giá trị số của hàm mục tiêu của hệ thống tối ưu với các giá trị hàm mục tiêu của các hệ thống sản xuất trong nước và nhập khẩu. Sai lệch cực đại các chỉ số của hệ thống sản xuất trong nước so với hệ thống tối ưu khoảng 20,71%, còn so với hệ thống nhập khẩu khoảng 7,95%. 10. Để có hình dung về chất lượng xe trong quá trình quay vòng chúng ta đã tính toán quỹ đạo quay vòng của xe TO-30 với cơ cấu thủy lực điều khiển lái cơ sở và cơ cấu thủy lực điều khiển lái có các tham số kết cấu đã được tối ưu, tiến hành các tính toán tại các vận tốc khác nhau trong chế độ chuyển động và chế độ công tác. Sai lệch cực đại các chỉ số ổn định và chất lượng quỹ đạo của xe với cơ cấu thủy lực điều khiển lái so với cơ cấu nguyên bản khoảng 14,2% ở chế độ di chuyển và 4,5% ở chế độ công tác. Kết quả là vận tốc di chuyển của xe TO-30 với độ lệch quỹ đạo lớn nhất tăng từ 7,8 m/s lên tới 9,6 m/s và ứng với vận tốc chuyển động cực đại của xe theo lý thuyết. 11. Xây dựng phương pháp tính toán chọn các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái gồm hai giai đoạn: chọn thể tích công tác của động cơ thủy lực tín hiệu ngược và tính toán các giá trị tối ưu các tham số kết cấu của bộ phân phối thủy lực với thể tích công tác đã chọn. 12. Xây dựng phần mềm tính toán các tham số kết cấu cơ bản của cơ cấu thủy lực điều khiển lái ở chế độ tự động, chế độ này có thể sử dụng ở giai đoạn thiết kế. 13. Các kết quả nghiên cứu lý thuyết có thể áp dụng với các xe công trình bánh lốp khác nhau có khung bản lề khớp động với thể tích xi lanh thủy lực quay vòng không quá 1,25.10 -3 m 3 . Để có thể ứng dụng cần thay đổi các số liệu ban đầu của mô hình hệ thống thủy lực điều khiển lái, các mô hình mô phỏng quá trình quay vòng xe và tính toán các tham số kết cấu tối ưu của cơ cấu thủy lực điều khiển lái của xe mới. Sử dụng phần mềm có thể nhanh chóng điều chỉnh và bổ sung các dữ liệu hàm chứa quy luật của các quá trình công tác diễn ra trong hệ thống thủy lực điều khiển lái của xe mới. 4. NGHIÊN CỨU THỰC NGHIỆM CƠ CẤU THỦY LỰC ĐIỀU KHIỂN LÁI. Nghiên cứu lý thuyết và thực nghiệm cần được tiến hành song song. Các nghiên cứu thực nghiệm hệ thống thủy lực điều khiển lái cần phải được tiến hành trên giá thử. Việc tiến hành các nghiên cứu thực nghiệm giúp giải quyết các bài toán sau đây /58, 95/: Thực nghiệm xác định và chính xác hóa giá trị số các tham số của mô hình toán học; Xác định tính tương thích của các mô hình toán học; Kiểm tra khả năng hoạt động của các tính toán thiết kế."
    },
    {
      "id": "4.1",
      "title": "Thử nghiệm trên bệ thử cơ cấu thủy lực điều khiển lái.",
      "content": "4.1 Thử nghiệm trên bệ thử cơ cấu thủy lực điều khiển lái. Khi nghiên cứu thực nghiệm cần lựa chọn đối tượng và thiết bị cần đo để thực hiện các nghiên cứu thực nghiệm."
    },
    {
      "id": "4.1.1",
      "title": "Đối tượng và thiết bị nghiên cứu thực nghiệm.",
      "content": "4.1.1 Đối tượng và thiết bị nghiên cứu thực nghiệm. Mẫu thử nghiệm cơ cấu thủy lực điều khiển lái là đối tượng thử nghiệm trên bệ thử với tham số kết cấu khuyến cáo của bộ phân phối thủy lực và thể tích công tác của động cơ thủy lực tín hiệu ngược là 125.10 -6 m 3 trình bày trong phần 4, hình dạng chung và kết cấu của nó được trình bày trên hình 4.1 và 4.2. Các nghiên cứu thực nghiệm được tiến hành trên bệ thử tại bộ môn “Xe công trình” Cibadi trình bày trên hình 4.3. Các phần tử cơ bản của bệ thử nghiệm gồm: Thùng dầu Б, bơm H kiểu НШ, van an toàn ПК , van điều tiết ДР1 … ДР3, bầu lọc Ф. Hướng tải trọng tác động lên các xi lanh thủy lực Ц1, Ц2 được điều khiển bằng bộ phân phối thủy lực điện điều khiển P. Trên bệ thử lắp bộ chia thể tích dòng chất lỏng ДП. Khi xác định các tham số động học và tĩnh học dẫn động thủy lực điều khiển lái trên bệ thử, các tác động lên đối tượng nghiên cứu và phản xạ của các tác động này được điều khiển bằng cảm biến, cảm biến đổi các tương tác thành tín hiệu điện, tín hiệu điện biến đổi thành dạng số và nhờ các bộ biến đổi số lưu trữ tín hiệu trong máy tính. Hình 4.1. Hình dạng chung cơ cấu thủy lực điều khiển lái thử nghiệm. Hình 4.2. Kết cấu mẫu thử nghiệm cơ cấu thủy lực điều khiển lái. Hình 4.3. Hình dạng chung bệ thử dùng để nghiên cứu thực nghiệm cơ cấu thủy lực điều khiển lái. Kiểm soát các tham số bằng các đồng hồ đo áp suất MH 1 …MH 5 . Dịch chuyển cán xi lanh chấp hành được cố định bằng cảm biến chuyển động П1. Áp suất chất lỏng công tác tại đầu vào của cơ cấu thủy lực điều khiển lái, trong khoang cao áp của xi lanh chấp hành và trong khoang cao áp của xi lanh chịu tải được cố định bằng các cảm biến điện Д 1 , Д 2, Д 3 kiểu ДТ-150. Giá trị lưu lượng chất lỏng công tác đến xi lanh thủy lực cũng như nhiệt độ chất lỏng công tác được cố định bằng máy thử thủy lực T 1 hiệu ГТ-600. Trên hình 4.4 trình bày sơ đồ thủy lực bệ thử có chỉ rõ vị trí lắp các cảm biến. Hình 4.4 Sơ đồ thủy lực dùng để nghiên cứu thực nghiệm cơ cấu thủy lực điều khiển lái có chỉ rõ vị trí lắp các cảm biến. Thiết bị đo là tổ hợp đo tích hợp lắp trên xe đẩy (hình 4.5). Tổ hợp thiết bị đo gồm: Máy tính và bộ vi mạch chuyển đổi tín hiệu kỹ thuật số АЦП L -783; Cảm biến đo các tham số kỹ thuật; Máy thử thủy lực ГТ – 600; Bộ nguồn điện một chiều Б5-8. Hình 4.5. Tổ hợp thiết bị đo Bộ vi mạch chuyển đổi tín hiệu kỹ thuật số АЦП L -783 là thiết bị hiện đại tác động nhanh, làm việc tin cậy trên nền máy công suất lớn PCI 2.1 dùng để nhập, xuất và xử lý các thông tin số trên máy tính. Nhờ giao diện PCI đảm bảo tốc độ trao đổi thông tin lớn, không xung đột với các thiết bị khác lắp trong máy tính. Tất cả các chế độ làm việc của bộ vi mạch chuyển đổi tín hiệu số này đều được lập trình và thể hiện dưới dạng hình ảnh. L-783 có thể được xem là công cụ thu thập và xử lý thông tin nhiều kênh cho phép người dùng thực hiện các thuật toán xử lý dữ liệu ở cấp độ phân mềm cài đặt trên các bộ vi xử lý hiện đại của công ty Analog Devices, Inc sản xuất /11, 22/. Hình 4.6. Hình dạng ngoài của bộ chuyển đổi tín hiệu số A ЦП L-783 Các thí nghiệm được tiến hành ở điều kiện nhiệt độ chất lỏng công tác T = 353 K. Độ lệch nhiệt độ chất lỏng công tác so với giá trị trên khi tiến hành nghiên cứu không quá ± 2K /21, 46/. Các nghiên cứu tiến hành với chất lỏng công tác M8 Г 2 theo tiêu chuẩn ГОСТ 8581-78. Khi tiến hành các nghiên cứu thí nghiệm đối tượng trên bệ thử đã xác định các tham số sau: Độ dịch chuyển cán xi lanh chấp hành; Áp suất trong ống thủy giữa bơm và cơ cấu thủy lực điều khiển lái; Áp suất trong các khoang của xi lanh chấp hành; Áp suất trong các khoang của xi lanh chịu tải; Lưu lượng chất lỏng công tác trong ống thủy lực giữa cơ cấu thủy lực điều khiển lái và xi lanh chấp hành; Nhiệt độ chất lỏng công tác. Các tham số xác định khi tiến hành thí nghiệm được đo theo tiêu chuẩn ГОСТ 17108-86. Để xác định tọa độ dịch chuyển cán xi lanh chấp hành sử dụng cảm biến chiết áp chuyên dụng (hình 4.7) biến tín hiệu dịch chuyển thành tín hiệu điện, cảm biến hoạt hoạt động dựa trên các điện trở C П-44-01-1 bảo đảm sai lệch tín hiệu đo không quá ± 0,3%. Cảm biến được mắc theo sơ đồ đảm bảo ghi nhận trực tiếp các dịch chuyển /95/. Áp suất trong các khoang của xi lanh chấp hành và xi lanh chịu tải và trong ống thủy lực giữa bơm với cơ cấu thủy lực điều khiển lái đo bằng các cảm biến áp suất có độ chính xác cao ТД – 150 (hình 4.8) với sai số tối đa là 0,8%. Hình 4.7. Cảm biến chiết áp xoay đo dịch chuyển cán xi lanh chấp hành Hiệu chuẩn cảm biến áp suất được thực hiện trên bệ chuyên dụng (hình 4.9). Áp suất chất lỏng công tác tác động lên phần tử của cảm biến có độ nhạy cảm cao do bơm pistong tạo ra và được kiểm soát bằng đồng hồ loại có độ chính xác 0,4 theo tiêu chuẩn ГОСТ 2405-80. Hiệu chuẩn được tiến hành bằng phương pháp chất tải và giảm tải trực tiếp trong dải áp suất 0-15 Mpa với các khoảng 0,5 Mpa. Hình 4.8. Cảm biến chiết áp áp suất có độ chính xác cao Hình 4.9. Hiệu chuẩn cảm biến áp suất. Việc hiệu chuẩn các kênh đo với mục tiêu nâng cao độ chính xác đo và đánh giá sai lệch được lặp lại không dưới 4 lần. Việc hiệu chỉnh phải làm rõ tính tuyến tính đo các tín hiệu ra, cho phép xác định các hệ số cần thiết để xác định giá trị các tham số theo biểu đồ dao động /58/. Xác định lưu lượng chất lỏng công tác vào xi lanh chấp hành và nhiệt độ chất lỏng công tác được tiến hành bằng máy thử thủy lực ГТ 600. Máy thử thủy lực ГТ 600 dùng để chẩn đoán các cụm thủy lực không tháo rời, xác định các hư hỏng của dẫn động thủy lực, dự báo hệ số dự trữ kỹ thuật và thiết lập tối ưu các phần tử thủy lực của các máy công trình, máy làm đường và các phương tiện vận tải công nghệ cao /58/. Bộ máy thử thủy lực gồm: khối điện và khối cơ, cáp liên kết và cáp nối với mạng điện thân xe hoặc bình điện bằng các kẹp. Khối cơ (hình 4.10) cấu tạo gồm thân, bên trong thân lắp cảm biến lưu lượng chất lỏng công tác, nhiệt độ và áp suất dầu, thân được đậy kín bằng nắp chuyên dụng. Trên nắp đậy có giắc cắm. Khối cơ được trang bị các đầu nối ra, vào thiết bị chịu tải, cho phép tạo ra áp suất nhỏ nhất mà không cần có tín hiệu tác động /58/. Khối điện tử (hình 4.11) thiết kế để giảm tác động cơ học, lắp bên trong hộp vỏ. Bên ngoài có các giắc cắm, các núm điều chỉnh, bảng hiển thị số các tham số đo với sai số đo tối đa 1,5%, và các đặc tính phi tuyến 1%: lưu lượng chất lỏng công tác, nhiệt độ, áp suất chất lỏng công tác /58/. Công việc đo được tiến hành như sau: Lắp các cảm biến (khối cơ khí) bằng cách dùng các đầu nối vào và đầu nối ra nối vào ống thủy lực cần đo trong sơ đồ mạch thủy lực sau phần tử cần chẩn đoán. Nối khối cơ khí với khối điện tử bằng dây cáp và đấu nối khối điện tử với nguồn điện. Công tắc chuyển mạch chế độ đo “Режим измерения” bật về vị trí chẩn đoán tham số. Tại vị trí “Расход” và “Температура” trên bảng Tablo hiển thị giá trị lưu lượng chất lỏng công tác và nhiệt độ ở dạng số, còn các đèn chỉ thị cho biết đơn vị đo. Đồng hồ đo áp suất trên khối cơ cho biết giá trị áp suất, đơn vị đo là kG/cm 2 . Hình 4.10. Khối cơ của máy thử thủy lực ГТ -600 Hình 4.11. Khối điện tử của máy thử thủy lực ГТ -600"
    },
    {
      "id": "4.1.2",
      "title": "Thực nghiệm đo và xác định các hệ số của mô hình toán.",
      "content": "4.1.2 Thực nghiệm đo và xác định các hệ số của mô hình toán. Dựa vào sơ đồ vị trí lắp các cảm biến trình bày trong phần 4.1.1 ta tiến hành nghiên cứu thực nghiệm như sau: Tạo áp suất trong xi lanh chịu tải với giá trị đã được tính toán nhờ mô hình toán; Thiết lập tác động điều khiển: Khi mở dẫn động thủy lực cần: Xác định tọa độ dịch chuyển cán xi lanh chấp hành. Xác định lưu lượng chất lỏng công tác tại đầu ra của cơ cấu thủy lực điều khiển lái. Xác định áp suất do bơm tạo ra tại vị trí trung gian của bộ phân phối thủy lực. Xác định áp suất do bơm tạo ra khi quay tay lái từ từ. Xác định áp suất trong khoang cao áp của xi lanh chấp hành khi quay từ từ tay lái. Kiểm tra độ tương thích áp suất trong khoang cao áp của xi lanh chịu tải với giá trị thiết lập khi quay đều tay lái. Kh tắt dẫn động thủy lực (bỏ tác động điều khiển) cần: Xác định áp suất bơm tạo ra khi bộ phân phối thủy lực ở vị trí trung gian. Xác định áp suất trong khoang cao áp của xi lanh của xi lanh chấp hành. Xác định áp suất trong khoang cao áp của xi lanh chịu tải. Trên hình 4.12 và 4.13 trình bày ví dụ biểu đồ dao động các quá trình công tác của hệ thống thủy lực điều khiển lái khi mở và tắt dẫn động thủy lực. Hình 4.12 Biểu đồ dao động các quá trình công tác hệ thống thủy lực điều khiển lái khi mở dẫn động thủy lực. Hình 4.13. Biểu đồ dao động các quá trình công tác của hệ thống thủy lực điều khiển lái khi tắt dẫn động thủy lực. Xác định chính xác các hệ số mô hình toán học. Trong quá trình tiến hành thí nghiệm đã làm rõ các hệ số và các tham số sau có trong mô hình toán: sự rò rỉ trong cơ cấu thủy lực điều khiển lái; mô men má sát trong cặp van trượt –vỏ; kích thước hình học ống thủy lực; kích thước hình học xi lanh thủy lực; thể tích “chết” của khoang xi lanh chấp hành; kích thước hình học đệm xi lanh thủy lực. Ngoài ra từ các mối quan hệ đã trình bày đã xác định: Độ chênh áp suất tại tay lái thủy lực Δ р ГРМ ; Vế phải phương trình chuyển động cán xi lanh thủy lực (3.29) Δ р AB : (4.1) Độ chênh áp khi bộ phân phối thủy lực ở vị trí trung gian Δ р НЕЙТР ; Áp suất dư trong khoang xi lanh thủy lực p ОСТ : từ mối quan hệ p A (xem hình 4.12) có thể kết luận rằng khi tắt dẫn động thủy lực dưới tác động của tải trọng ngược trong khoang cao áp của xi lanh chấp hành sẽ sinh áp lực khóa không cho chất lỏng lưu chảy, dẫn tới tạo va đập ở vòng quay tay lái sau cùng, điều này giải thích bởi độ chễ xả tải từ xi lanh chịu tải. Trong quá trình tiến hành thí nghiệm đã thu được các tham số đầu ra ở chế độ làm việc xác định như sau: Giá trị lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái Q là 1,15.10 -4 m 3 /s; Giá trị áp suất bơm nguồn khi bộ phân phối thủy lực ở vị trí trung gian p НЕЙТР là 0,8.10 6 Pa; Giá trị áp suất bơm nguồn khi quay đều tay lái p là 11,6.10 6 Pa; Giá trị áp suất trong khoang cao áp p A của xi lanh chấp hành khi quay đều tay lái là 8,8.10 6 Pa; Giá trị áp suất trong khoang cao áp của xi lanh chịu tải p B khi quay đều tay lái là 8.10 6 Pa; Giá trị áp suất dư p ОСТ trong khoang cao áp của xi lanh chấp hành sau khi ngừng tác động lên tay lái là 5,4.10 6 Pa."
    },
    {
      "id": "4.2",
      "title": "Đánh giá tính đúng đắn của mô hình toán học.",
      "content": "4.2 Đánh giá tính đúng đắn của mô hình toán học. Mô hình toán học phải đảm bảo tính đúng đắn /72, 95/. Điều kiện đảm bảo tính đúng đắn là yêu cầu quan trọng đối với mọi mô hình toán. Tính đúng của mô hình toán là một trong các minh chứng đảm bảo độ tin cậy của nghiên cứu lý thuyết. Sai lệch các đặc tính về lượng các tham số cơ bản của đối tượng thu được bằng nghiên cứu lý thuyết và thực nghiệm là thước đo tính đúng đắn của mô hình toán. Độ chính xác của mô hình toán của hệ thống thủy lực điều khiển lái được chứng minh bằng cách phân tích so sánh các tham số cơ bản của các quá trình chuyển tiếp khi mở và đóng dẫn động thủy lực. Các quá trình chuyển tiếp nhận được khi tính toán so sánh với các quá trình đã được ghi trong bộ nhớ của máy tính bằng bộ biến đổi số loại suy. So sánh các tham số đầu ra sau: Giá trị lưu lượng chất lỏng công tác trong hệ thống thủy lực điều khiển lái; Áp suất của chất lỏng công tác do bơm tạo ra; Áp suất trong khoang cao áp của xi lanh chấp hành; Tọa độ dịch chuyển cán xi lanh chấp hành. Ngoài ra còn so sánh các chỉ số chất lượng của các quá trình chuyển tiếp: Thời gian trễ thực tế tăng áp lực của bơm cấp chất lỏng công tác; Thời gian trễ thực tế dịch chuyển cán pistong của xi lanh chấp hành khi mở dẫn động thủy lực; Thời gian điều chỉnh áp suất bơm cấp chất lỏng công tác khi mở dẫn động thủy lực; Thời gian điều chỉnh áp suất trong khoang của xi lanh chấp hành khi mở dẫn động thủy lực; Thời gian điều chỉnh áp suất của bơm khi tắt dẫn động thủy lực; Thời gian điều chỉnh áp suất của bơm khi mở dẫn động thủy lực; Lưu lượng chất lỏng công tác vượt ngưỡng do bơm tạo ra khi tắt dẫn động thủy lực. Ví dụ so sánh các quá trình chuyển tiếp lý thuyết và thực nghiệm ra tăng áp suất của bơm khi mở dẫn động thủy lực trình bày trên hình 4.14. Trên hình 4.15 trình bày ví dụ so sánh các quá trình chuyển tiếp lý thuyết và thực nghiệm tụt áp suất bơm khi tắt dẫn động thủy lực. Trên hình 4.16 trình bày ví dụ so sánh các quá trình chuyển tiếp ra tăng áp suất lý thuyết và thực nghiệm trong khoang cao áp của xi lanh chấp hành khi mở dẫn động thủy lực. Trên hình 4.17 trình bày ví dụ so sánh các quá trình chuyển tiếp dịch chuyển cán pistong của xi lanh chấp hành theo nghiên cứu lý thuyết và thực nghiệm khi mở dẫn động thủy lực. Nhìn trên các đồ thị 4.14, 4.15, 4.16, 4.17 ta thấy các đường cong miêu tả các quá trình chuyển tiếp theo nghiên cứu lý thuyết và thực nghiệm không có sự sai lệch đáng kể. Sự sai lệch của các giá trị lý thuyết và thực nghiệm về giá trị lưu lượng chất lỏng công tác tại đầu ra của cơ cấu thủy lực điều khiển lái là 5,7%; về giá trị áp suất bơm khi quay đều tay lái là 2,4%; về giá trị áp suất trong khoang cao áp của xi lanh chấp hành là khoảng 3,3%. Sai lệch giữa nghiên cứu lý thuyết và thực nghiệm về độ trễ thực ra tăng áp suất của bơm và dịch chuyển cán xi lanh thủy lực khi mở dẫn động thủy lực không quá 7%; về thời gian điều chỉnh áp suất khi mở dẫn động thủy lực không quá 7,5%, khi tắt dẫn động thủy lực không quá 6%; về giá trị áp suất chất lỏng công tác vượt ngưỡng khi mở dẫn động thủy lực không quá 5,2%, khi tắt dẫn động thủy lực là không quá 8,6%. Hình 4.14. Quá trình chuyển tiếp ra tăng áp suất bơm khi mở dẫn động thủy lực theo nghiên cứu lý thuyết và thực nghiệm. Hình 4.15. Quá trình chuyển tiếp tụt áp suất bơm khi tắt dẫn động thủy lực theo nghiên cứu lý thuyết và thực nghiệm. Hình 4.16. Quá trình chuyển tiếp ra tăng áp suất trong xi lanh thủy lực khi mở dẫn động thủy lực theo nghiên cứu lý thuyết và thực nghiệm. Hình 4.17. Quá trình chuyển tiếp dịch chuyển cán xi lanh thủy lực khi mở dẫn động thủy lực theo nghiên cứu lý thuyết và thực nghiệm. Nguyên nhân sai lệch các giá trị lý thuyết và thực nghiệm là do các giả thuyết đặt ra khi xây dựng mô hình toán dẫn động thủy lực, các giá trị tham số đưa vào mô hình khi tính toán các hệ số của mô hình toán không chính xác, cũng như các đặc tính của dẫn động thủy lực thực tế không ổn định. Độ sai lệch các giá trị tính toán khi giải các bài toán đặt ra trong công trình này là chấp nhận được. Các kết luận chương . Kết quả các nghiên cứu lý thuyết và thực nghiệm mẫu thử cơ cấu thủy lực điều khiển lái đã giải quyết được các vấn đề sau: 1. Mô tả đồ thị dao động các quá trình công tác diễn ra trong hệ thống thủy lực điều khiển lái khi mở và tắt dẫn động thủy lực. 2. Chính xác hóa các hệ số trong mô hình toán. 3. Chứng minh được tính đúng đắn của mô hình toán bằng cách so sánh các nghiên cứu lý thuyết và thực nghiệm. Sai lệch các giá trị đã thiết lập đối với các đặc tính đầu ra không quá 5,7%. Sai lệch các chỉ số chất lượng của các quá trình chuyển tiếp không quá 8,6%. Tài liệu tham khảo."
    }
  ]
}